{
    "psalms": [
        {
            "number": 1,            
            "text": [
                "Beatus vir qui non abiit in consilio impiorum,",
                "et in via peccatorum non stetit,",
                "et in cathedra pestilentiae non sedit;",
                "sed in lege Domini voluntas ejus,",
                "et in lege ejus meditabitur die ac nocte.",
                "Et erit tamquam lignum quod plantatum est secus decursus aquarum,",
                "quod fructum suum dabit in tempore suo:",
                "et folium ejus non defluet,",
                "et omnia quaecumque faciet prosperabuntur.",
                "Non sic impii, non sic;",
                "sed tamquam pulvis quem projicit ventus a facie terrae.",
                "Ideo non resurgent impii in judicio,",
                "neque peccatores in concilio justorum.",
                "Quoniam novit Dominus viam justorum,",
                "et iter impiorum peribit."
            ]
        },
        {
            "number": 2,
            "text": [
                "Quare fremuerunt gentes, et populi meditati sunt inania?",
                "Astiterunt reges terrae, et principes convenerunt in unum,",
                "adversus Dominum et adversus christum ejus.",
                "Dirumpamus vincula eorum, et projiciamus a nobis jugum ipsorum!",
                "Qui habitat in caelis irridebit eos, et Dominus subsannabit eos.",
                "Tunc loquetur ad eos in ira sua, et in furore suo conturbabit eos:",
                "Ego autem constitui regem meum super Sion, montem sanctum meum.",
                "Praedicabo decretum Domini: Dominus dixit ad me:",
                "Filius meus es tu, ego hodie genui te.",
                "Postula a me, et dabo tibi gentes hereditatem tuam,",
                "et possessionem tuam terminos terrae.",
                "Reges eos in virga ferrea, et tamquam vas figuli confringes eos.",
                "Et nunc, reges, intelligite; erudimini, qui judicatis terram.",
                "Servite Domino in timore, et exsultate ei cum tremore.",
                "Apprehendite disciplinam, ne quando irascatur, et pereatis de via justa.",
                "Cum exarserit in brevi ira ejus, beati omnes qui confidunt in eo."
            ]
        },
        {
                "number": 4,
                "text": [
                    "Cum invocarem exaudivit me Deus justitiae meae:",
                    "in tribulatione dilatasti mihi.",
                    "Miserere mei, et exaudi orationem meam.",
                    "Filii hominum, usquequo gravi corde?",
                    "Ut quid diligitis vanitatem, et quaeritis mendacium?",
                    "Et scitote quoniam mirificavit Dominus sanctum suum:",
                    "Dominus exaudiet me cum clamavero ad eum.",
                    "Irascimini, et nolite peccare:",
                    "quae dicitis in cordibus vestris,",
                    "in cubilibus vestris compungimini.",
                    "Sacrificate sacrificium justitiae, et sperate in Domino.",
                    "Multi dicunt: Quis ostendit nobis bona?",
                    "Signatum est super nos lumen vultus tui, Domine:",
                    "dedisti laetitiam in corde meo.",
                    "A fructu frumenti, vini et olei sui multiplicati sunt.",
                    "In pace in idipsum dormiam et requiescam;",
                    "quoniam tu, Domine, singulariter in spe constituisti me."
                ]
            },
        {
            "number": 6,
            "text": [
                "Domine, ne in furore tuo arguas me,",
                "neque in ira tua corripias me.",
                "Miserere mei, Domine, quoniam infirmus sum;",
                "sana me, Domine, quoniam conturbata sunt ossa mea.",
                "Et anima mea turbata est valde:",
                "sed tu, Domine, usquequo?",
                "Convertere, Domine, eripe animam meam;",
                "salvum me fac propter misericordiam tuam.",
                "Quoniam non est in morte qui memor sit tui;",
                "in inferno autem quis confitebitur tibi?",
                "Laboravi in gemitu meo,",
                "lavabo per singulas noctes lectum meum;",
                "lacrimis meis stratum meum rigabo.",
                "Turbatus est a furore oculus meus,",
                "inveteravi inter omnes inimicos meos.",
                "Discedite a me, omnes qui operamini iniquitatem,",
                "quoniam exaudivit Dominus vocem fletus mei.",
                "Exaudivit Dominus deprecationem meam,",
                "Dominus orationem meam suscepit.",
                "Erubescant et conturbentur vehementer omnes inimici mei;",
                "convertantur et erubescant valde velociter."
            ]
        },
        {
            "number": 7,            
            "text": [
                "Psalmus David, quem cantavit Domino pro verbis Chusi filii Jemini",
                "Domine Deus meus, in te speravi; salvum me fac ex omnibus persequentibus me, et libera me.",
                "Nequando rapiat ut leo animam meam, dum non est qui redimat, neque qui salvum faciat.",
                "Domine Deus meus, si feci istud, si est iniquitas in manibus meis,",
                "si reddidi retribuentibus mihi mala, decidam merito ab inimicis meis inanis.",
                "Persequatur inimicus animam meam, et comprehendat, et conculcet in terra vitam meam, et gloriam meam in pulverem deducat.",
                "Exsurge, Domine, in ira tua; exaltare in finibus inimicorum meorum.",
                "Et exsurge, Domine Deus meus, in praecepto quod mandasti, et synagoga populorum circumdabit te.",
                "Et propter hanc in altum regredere; Dominus judicat populos.",
                "Judica me, Domine, secundum justitiam meam, et secundum innocentiam meam super me.",
                "Consumetur nequitia peccatorum, et diriges justum, scrutans corda et renes, Deus.",
                "Justum adjutorium meum a Domino, qui salvos facit rectos corde.",
                "Deus judex justus, fortis, et patiens; numquid irascitur per singulos dies?",
                "Nisi conversi fueritis, gladium suum vibrabit; arcum suum tetendit, et paravit illum.",
                "Et in eo paravit vasa mortis; sagittas suas ardentibus effecit.",
                "Ecce parturiit injustitiam, concepit dolorem, et peperit iniquitatem.",
                "Lacum aperuit, et effodit eum, et incidit in foveam quam fecit.",
                "Convertetur dolor ejus in caput ejus, et in verticem ipsius iniquitas ejus descendet.",
                "Confitebor Domino secundum justitiam ejus, et psallam nomini Domini altissimi."
            ]
        },
        {
            "number": 8,
            "text": [
              "Domine, Dominus noster,",
              "quam admirabile est nomen tuum in universa terra!",
              "Quoniam elevata est magnificentia tua,",
              "super caelos.",
              "Ex ore infantium et lactentium perfecisti laudem",
              "propter inimicos tuos,",
              "ut destruas inimicum et ultorem.",
              "Cum videam caelos tuos, opera digitorum tuorum,",
              "lunam et stellas, quae tu fundasti,",
              "quid est homo, quod memor es eius?",
              "aut filius hominis, quod curas eum?",
              "Eum fecisti paulo minus Deo,",
              "gloria et honore coronasti eum.",
              "Dedisti ei potestatem super opera manuum tuarum,",
              "omnia subiecisti sub pedibus eius,",
              "oves et boves universas,",
              "insuper et pecora campi,",
              "volucres caeli et pisces maris,",
              "quae percurrunt semitas maris.",
              "Domine, Dominus noster,",
              "quam admirabile est nomen tuum in universa terra!"
            ]
          },
        
        {
            "number": 9,
            "section": "A",
            "text": [
                "Confitebor tibi, Domine, in toto corde meo;",
                "narrabo omnia mirabilia tua.",
                "Laetabor et exsultabo in te;",
                "psallam nomini tuo, Altissime.",
                "... (verses 1–21)"
            ]
        },
        {
            "number": 9,
            "section": "B",
            "text": [
                "Quoniam ecce peccatores intenderunt arcum,",
                "paraverunt sagittas suas in pharetra,",
                "ut sagittent in obscuro rectos corde.",
                "... (remaining verses)"
            ]
        },
        {
            "number": 10,
            "text": [
                "In Domino confido: quomodo dicitis animae meae:",
                "\"Transvola in montem sicut passer?\"",
                "Quoniam ecce peccatores intenderunt arcum,",
                "paraverunt sagittas suas in pharetra,",
                "ut sagittent in obscuro rectos corde.",
                "Quae perfecisti, destruxerunt:",
                "justus autem quid fecit?",
                "Dominus in templo sancto suo,",
                "Dominus in caelo sedes ejus.",
                "Oculi ejus in pauperem respiciunt,",
                "palpebrae ejus interrogant filios hominum.",
                "Dominus interrogat justum et impium:",
                "qui autem diligit iniquitatem, odit animam suam.",
                "Pluet super peccatores laqueos:",
                "ignis, sulphur, et spiritus procellarum,",
                "pars calicis eorum.",
                "Quoniam justus Dominus, et justitias dilexit:",
                "aequitatem vidit vultus ejus."
            ]
        },
        {
            "number": 11,
            "text": [
                "Salvum me fac, Domine, quoniam defecit sanctus,",
                "quoniam diminutae sunt veritates a filiis hominum.",
                "Vana locuti sunt unusquisque ad proximum suum,",
                "labia dolosa, in corde et corde locuti sunt.",
                "Disperdat Dominus universa labia dolosa,",
                "et linguam magniloquam.",
                "Qui dixerunt: Linguam nostram magnificabimus,",
                "labia nostra a nobis sunt, quis noster dominus est?",
                "Propter miseriam inopum, et gemitum pauperum,",
                "nunc exsurgam, dicit Dominus.",
                "Ponam in salutari, fiducialiter agam in eo.",
                "Eloquia Domini, eloquia casta,",
                "argentum igne examinatum,",
                "probatum terrae, purgatum septuplum.",
                "Tu, Domine, servabis nos, et custodies nos",
                "a generatione hac in aeternum.",
                "In circuitu impii ambulant;",
                "secundum altitudinem tuam multiplicasti filios hominum."
            ]
        },
        {
            "number": 12,
            "text": [
                "Salvum me fac, Domine, quoniam defecit sanctus;",
                "quoniam diminutae sunt veritates a filiis hominum.",
                "Vana locuti sunt unusquisque ad proximum suum;",
                "labia dolosa, in corde et corde locuti sunt."
            ]
        },
        {
            "number": 13,
            "text": [
                "Usquequo, Domine, oblivisceris me in finem?",
                "Usquequo avertis faciem tuam a me?",
                "Quamdiu ponam consilia in anima mea,",
                "dolorem in corde meo per diem?"
            ]
        },
        {
            "number": 14,
            "text": [
                "Domine, quis habitabit in tabernaculo tuo?",
                "aut quis requiescet in monte sancto tuo?",
                "Qui ingreditur sine macula, et operatur justitiam;",
                "qui loquitur veritatem in corde suo."
            ]
        },
        {
            "number": 15,
            "text": [
                "Conserva me, Domine, quoniam in te speravi;",
                "dixi Domino: Deus meus es tu,",
                "quoniam bonorum meorum non eges.",
                "Sanctis qui sunt in terra ejus,",
                "mirificavit omnes voluntates meas in eis.",
                "Multiplicatae sunt infirmitates eorum;",
                "postea acceleraverunt.",
                "Non congregabo conventicula eorum de sanguinibus,",
                "nec memor ero nominum eorum per labia mea.",
                "Dominus pars hereditatis meae et calicis mei;",
                "tu es qui restitues hereditatem meam mihi.",
                "Funes ceciderunt mihi in praeclaris;",
                "etenim hereditas mea praeclara est mihi.",
                "Benedicam Dominum qui tribuit mihi intellectum;",
                "insuper et usque ad noctem increpuerunt me renes mei.",
                "Providebam Dominum in conspectu meo semper;",
                "quoniam a dextris est mihi, ne commovear.",
                "Propter hoc laetatum est cor meum, et exsultavit lingua mea;",
                "insuper et caro mea requiescet in spe.",
                "Quoniam non derelinques animam meam in inferno;",
                "nec dabis sanctum tuum videre corruptionem.",
                "Notas mihi fecisti vias vitae;",
                "adimplebis me laetitia cum vultu tuo;",
                "delectationes in dextera tua usque in finem."
            ]
        },
        {
            "number": 16,
            "text": [
                "Exaudi, Domine, justitiam meam; intende deprecationem meam.",
                "Auribus percipe orationem meam, non in labiis dolosis.",
                "De vultu tuo judicium meum prodeat; oculi tui videant aequitates.",
                "Probasti cor meum, et visitasti nocte; igne me examinasti, et non est inventa in me iniquitas.",
                "Ut non loquatur os meum opera hominum; propter verba labiorum tuorum ego custodivi vias duras.",
                "Perfice gressus meos in semitis tuis, ut non moveantur vestigia mea.",
                "Ego clamavi, quoniam exaudisti me, Deus; inclina aurem tuam mihi, et exaudi verba mea.",
                "Mirifica misericordias tuas, qui salvos facis sperantes in te.",
                "A resistentibus dexterae tuae custodi me, ut pupillam oculi.",
                "Sub umbra alarum tuarum protege me",
                "a facie impiorum qui me afflixerunt.",
                "Inimici mei animam meam circumdederunt; adipem suum concluserunt, os eorum locutum est superbiam.",
                "Projicientes me nunc circumdederunt me; oculos suos statuerunt declinare in terram.",
                "Susceperunt me sicut leo paratus ad praedam, et sicut catulus leonis habitans in abditis.",
                "Exsurge, Domine, praeveni eos, et supplanta eos.",
                "Eripe animam meam ab impio, frameam tuam ab inimicis manus tuae.",
                "Domine, a paucis de terra divide eos in vita eorum; de absconditis tuis adimpletus est venter eorum.",
                "Saturati sunt filiis, et dimiserunt reliquias suas parvulis suis.",
                "Ego autem in justitia apparebo conspectui tuo; satiabor cum apparuerit gloria tua."
            ]
        },        
        {
            "number": 17,
            "section": "A",
            "text": [
                "Diligo te, Domine, fortitudo mea;",
                "Dominus firmamentum meum, et refugium meum, et liberator meus.",
                "Deus meus, adjutor meus, et sperabo in eum;",
                "protector meus, et cornu salutis meae, et susceptor meus.",
                "Laudans invocabo Dominum, et ab inimicis meis salvus ero.",
                "Circumdederunt me dolores mortis, et torrentes iniquitatis conturbaverunt me.",
                "Dolores inferni circumdederunt me, praeoccupaverunt me laquei mortis.",
                "In tribulatione mea invocavi Dominum, et ad Deum meum clamavi;",
                "exaudivit de templo sancto suo vocem meam, et clamor meus in conspectu ejus introivit in aures ejus.",
                "Commota est, et contremuit terra; fundamenta montium conturbata sunt,",
                "et commota sunt, quoniam iratus est eis.",
                "Ascendit fumus in ira ejus, et ignis a facie ejus exarsit;",
                "carbones succensi sunt ab eo.",
                "Inclinavit coelos, et descendit, et caligo sub pedibus ejus.",
                "Et ascendit super cherubim, et volavit; volavit super pennas ventorum.",
                "Et posuit tenebras latibulum suum; in circuitu ejus tabernaculum ejus,",
                "tenebrosa aqua in nubibus aeris.",
                "Praefulgor ante eum nubes, grando et carbones ignis.",
                "Et intonuit de coelo Dominus, et Altissimus dedit vocem suam:",
                "grandinem et carbones ignis.",
                "Et misit sagittas suas, et dissipavit eos;",
                "fulgura multiplicavit, et conturbavit eos.",
                "Et apparuerunt fontes aquarum, et revelata sunt fundamenta orbis terrarum",
                "ab increpatione tua, Domine, ab inspiratione spiritus irae tuae.",
                "Misit de summo, et accepit me; assumpsit me de aquis multis.",
                "Eripuit me de inimico meo potentissimo, et ab his qui oderunt me:",
                "quoniam confortati sunt super me.",
                "Praevenerunt me in die afflictionis meae, et factus est Dominus protector meus.",
                "Et eduxit me in latitudinem; salvum me fecit, quoniam voluit me.",
                "Retribuet mihi Dominus secundum justitiam meam, et secundum puritatem manuum mearum retribuet mihi.",
                "Quia custodivi vias Domini, nec impie gessi a Deo meo.",
                "Quoniam omnia judicia ejus in conspectu meo, et justitias ejus non repuli a me.",
                "Et ero immaculatus cum eo, et observabo me ab iniquitate mea.",
                "Et retribuet mihi Dominus secundum justitiam meam, et secundum puritatem manuum mearum in conspectu oculorum ejus."
            ]
        },
        {
            "number": 17,
            "section": "B",
            "text": [
                "Cum sancto sanctus eris, et cum viro innocente innocens eris,",
                "et cum electo electus eris, et cum perverso perverteris.",
                "Quoniam tu populum humilem salvum facies, et oculos superborum humiliabis.",
                "Quoniam tu illuminas lucernam meam, Domine; Deus meus, illumina tenebras meas.",
                "Quoniam in te eripiar a tentatione, et in Deo meo transgrediar murum.",
                "Deus meus, impolluta via ejus; eloquia Domini igne examinata;",
                "protector est omnium sperantium in se.",
                "Quoniam quis Deus praeter Dominum? aut quis Deus praeter Deum nostrum?",
                "Deus qui praecinxit me virtute, et posuit immaculatam viam meam;",
                "qui perfecit pedes meos tamquam cervorum, et super excelsa statuens me;",
                "qui docet manus meas ad praelium, et posuisti arcum aereum brachia mea.",
                "Et dedisti mihi protectionem salutis tuae, et dextera tua suscepit me:",
                "et disciplina tua correxit me in finem, et disciplina tua ipsa me docebit.",
                "Dilatasti gressus meos subtus me, et non sunt infirmata vestigia mea.",
                "Persequar inimicos meos, et comprehendam illos; et non convertar donec deficiant.",
                "Conteram illos, nec poterunt stare; cadent subtus pedes meos.",
                "Et praecinxisti me virtute ad bellum; supplantasti insurgentes in me subtus me.",
                "Et inimicos meos dedisti mihi dorsum, et odientes me disperdidisti.",
                "Clamaverunt, nec erat qui salvos faceret; ad Dominum, nec exaudivit eos.",
                "Et comminuam eos ut pulverem ante faciem venti; ut lutum platearum delebo eos.",
                "Eripies me de contradictionibus populi; constitues me in caput gentium.",
                "Populus quem non cognovi servivit mihi; in auditu auris obedivit mihi.",
                "Filii alieni mentiti sunt mihi, filii alieni inveterati sunt,",
                "et claudicaverunt a semitis suis.",
                "Vivit Dominus, et benedictus Deus meus, et exaltetur Deus salutis meae.",
                "Deus qui dat vindictas mihi, et subjicit populos sub me,",
                "liberator meus de inimicis meis iracundis. Et ab insurgentibus in me exaltabis me;",
                "a viro iniquo eripies me.",
                "Propterea confitebor tibi in nationibus, Domine, et nomini tuo psalmum cantabo:",
                "magnificans salutes regis ejus, et faciens misericordiam christo suo David, et semini ejus usque in saeculum."
            ]
        },
        {
            "number": 18,
            "text": [
                "Caeli enarrant gloriam Dei, et opera manuum ejus annuntiat firmamentum.",
                "Dies diei eructat verbum, et nox nocti indicat scientiam.",
                "Non sunt loquelae, neque sermones, quorum non audiantur voces eorum.",
                "In omnem terram exivit sonus eorum, et in fines orbis terrae verba eorum.",
                "In sole posuit tabernaculum suum; et ipse tamquam sponsus procedens de thalamo suo,",
                "exsultavit ut gigas ad currendam viam.",
                "A summo caelo egressio ejus, et occursus ejus usque ad summum ejus;",
                "nec est qui se abscondat a calore ejus.",
                "Lex Domini immaculata, convertens animas; testimonium Domini fidele, sapientiam praestans parvulis.",
                "Justitiae Domini rectae, laetificantes corda; praeceptum Domini lucidum, illuminans oculos.",
                "Timor Domini sanctus, permanens in saeculum saeculi; judicia Domini vera, justificata in semetipsa.",
                "Desiderabilia super aurum et lapidem pretiosum multum; et dulciora super mel et favum.",
                "Etenim servus tuus custodit ea, in custodiendis illis retributio multa.",
                "Delicta quis intelligit? ab occultis meis munda me;",
                "et ab alienis parce servo tuo. Si mei non fuerint dominati, tunc immaculatus ero,",
                "et emundabor a delicto maximo.",
                "Et erunt ut complaceant eloquia oris mei, et meditatio cordis mei in conspectu tuo semper,",
                "Domine, adjutor meus, et redemptor meus."
            ]
        },
        
        {
            "number": 19,
            "text": [
                "Exaudiat te Dominus in die tribulationis; protegat te nomen Dei Jacob.",
                "Mittat tibi auxilium de sancto, et de Sion tueatur te.",
                "Memor sit omnis sacrificii tui, et holocaustum tuum pingue fiat.",
                "Tribuat tibi secundum cor tuum, et omne consilium tuum confirmet.",
                "Laetabimur in salutari tuo; et in nomine Dei nostri magnificabimur.",
                "Impleat Dominus omnes petitiones tuas; nunc cognovi quoniam salvum fecit Dominus christum suum.",
                "Exaudiet illum de caelo sancto suo; in potentatibus salus dexterae ejus.",
                "Hi in curribus, et hi in equis; nos autem in nomine Domini Dei nostri invocabimus.",
                "Ipsi obligati sunt, et ceciderunt; nos autem surreximus et erecti sumus.",
                "Domine, salvum fac regem, et exaudi nos in die qua invocaverimus te."
            ]
        },
        {
               "number": 90,
               "text": [
                   "Qui habitat in adjutorio Altissimi,",
                   "in protectione Dei caeli commorabitur.",
                   "Dicet Domino: Susceptor meus es tu, et refugium meum;",
                   "Deus meus, sperabo in eum.",
                   "Quoniam ipse liberavit me de laqueo venantium,",
                   "et a verbo aspero.",
                   "Scapulis suis obumbrabit tibi,",
                   "et sub pennis ejus sperabis.",
                   "Scuto circumdabit te veritas ejus:",
                   "non timebis a timore nocturno,",
                   "a sagitta volante in die,",
                   "a negotio perambulante in tenebris,",
                   "ab incursu et daemonio meridiano.",
                   "Cadent a latere tuo mille,",
                   "et decem millia a dextris tuis:",
                   "tibi autem non appropinquabit.",
                   "Quoniam angelis suis mandavit de te,",
                   "ut custodiant te in omnibus viis tuis.",
                   "In manibus portabunt te,",
                   "ne forte offendas ad lapidem pedem tuum.",
                   "Super aspidem et basiliscum ambulabis,",
                   "et conculcabis leonem et draconem.",
                   "Quoniam in me speravit, liberabo eum;",
                   "protegam eum quoniam cognovit nomen meum.",
                   "Clamabit ad me, et ego exaudiam eum;",
                   "cum ipso sum in tribulatione:",
                   "eripiam eum et glorificabo eum.",
                   "Longitudine dierum replebo eum,",
                   "et ostendam illi salutare meum."
               ]
           },
                {
                    "number": 118,
                    "section": "Aleph",
                    "text": [
                        "Beati immaculati in via, qui ambulant in lege Domini.",
                        "Beati qui scrutantur testimonia ejus, in toto corde exquirunt eum.",
                        "Non enim qui operantur iniquitatem, in viis ejus ambulaverunt.",
                        "Tu mandasti mandata tua custodiri nimis.",
                        "Utinam dirigantur viae meae, ad custodiendas justificationes tuas!",
                        "Tunc non confundar, cum perspexero in omnibus praeceptis tuis.",
                        "Confitebor tibi in directione cordis, in eo quod didici judicia justitiae tuae.",
                        "Justificationes tuas custodiam, non me derelinquas usquequaque."
                    ]
                },
                {
                    "number": 118,
                    "section": "Beth",
                    "text": [
                        "In quo corrigit adolescentior viam suam? In custodiendo sermones tuos.",
                        "In toto corde meo exquisivi te, ne repellas me a mandatis tuis.",
                        "In corde meo abscondi eloquia tua, ut non peccem tibi.",
                        "Benedictus es, Domine, doce me justificationes tuas.",
                        "In labiis meis pronuntiavi omnia judicia oris tui.",
                        "In via testimoniorum tuorum delectatus sum, sicut in omnibus divitiis.",
                        "In mandatis tuis exercebor, et considerabo vias tuas.",
                        "In justificationibus tuis meditabor, non obliviscar sermones tuos."
                    ]
                },
                {
                    "number": 118,
                    "section": "Gimel",
                    "text": [
                        "Retribue servo tuo, vivifica me, et custodiam sermones tuos.",
                        "Revela oculos meos, et considerabo mirabilia de lege tua.",
                        "Incola ego sum in terra, non abscondas a me mandata tua.",
                        "Concupivit anima mea desiderare justificationes tuas in omni tempore.",
                        "Increpasti superbos, maledicti qui declinant a mandatis tuis.",
                        "Aufer a me opprobrium et contemptum, quia testimonia tua exquisivi.",
                        "Etenim sederunt principes, et adversum me loquebantur; servus autem tuus exercebatur in justificationibus tuis.",
                        "Nam et testimonia tua meditatio mea est, et consilium meum justificationes tuae."
                    ]
                },
                {
                    "number": 118,
                    "section": "Daleth",
                    "text": [
                        "Adhaesit pavimento anima mea, vivifica me secundum verbum tuum.",
                        "Vias meas enuntiavi, et exaudisti me; doce me justificationes tuas.",
                        "Viam justificationum tuarum instrue me, et exercebor in mirabilibus tuis.",
                        "Dormitavit anima mea prae taedio, confirma me in verbis tuis.",
                        "Viam iniquitatis amove a me, et de lege tua miserere mei.",
                        "Viam veritatis elegi, judicia tua non sum oblitus.",
                        "Adhaesi testimoniis tuis, Domine, noli me confundere.",
                        "Viam mandatorum tuorum cucurri, cum dilatasti cor meum."
                    ]
                },
                {
                    "number": 118,
                    "section": "He",
                    "text": [
                        "Legem pone mihi, Domine, viam justificationum tuarum, et exquiram eam semper.",
                        "Da mihi intellectum, et scrutabor legem tuam, et custodiam illam in toto corde meo.",
                        "Deduc me in semitam mandatorum tuorum, quia ipsam volui.",
                        "Inclina cor meum in testimonia tua, et non in avaritiam.",
                        "Averte oculos meos ne videant vanitatem, in via tua vivifica me.",
                        "Statue servo tuo eloquium tuum in timore tuo.",
                        "Amputa opprobrium meum quod suspicatus sum, quia judicia tua jucunda.",
                        "Ecce concupivi mandata tua, in aequitate tua vivifica me."
                    ]
                },
                {
                    "number": 118,
                    "section": "Vau",
                    "text": [
                        "Et veniat super me misericordia tua, Domine, salutare tuum secundum eloquium tuum.",
                        "Et respondebo exprobrantibus mihi verbum, quia speravi in sermonibus tuis.",
                        "Et ne auferas de ore meo verbum veritatis usquequaque, quia in judiciis tuis supersperavi.",
                        "Et custodiam legem tuam semper, in saeculum et in saeculum saeculi.",
                        "Et ambulabam in latitudine, quia mandata tua exquisivi.",
                        "Et loquebar de testimoniis tuis in conspectu regum, et non confundebar.",
                        "Et meditabar in mandatis tuis, quae dilexi.",
                        "Et levavi manus meas ad mandata tua quae dilexi, et exercebar in justificationibus tuis."
                    ]
                },
                {
                    "number": 118,
                    "section": "Zain",
                    "text": [
                        "Memor esto verbi tui servo tuo, in quo mihi spem dedisti.",
                        "Haec me consolata est in humilitate mea, quia eloquium tuum vivificavit me.",
                        "Superbi inique agebant usquequaque, a lege autem tua non declinavi.",
                        "Memor fui judiciorum tuorum a saeculo, Domine, et consolatus sum.",
                        "Defectio tenuit me, pro peccatoribus derelinquentibus legem tuam.",
                        "Cantabiles mihi erant justificationes tuae in loco peregrinationis meae.",
                        "Memor fui nocte nominis tui, Domine, et custodivi legem tuam.",
                        "Hoc factum est mihi, quia justificationes tuas exquisivi."
                    ]
                },
                {
                    "number": 118,
                    "section": "Heth",
                    "text": [
                        "Portio mea, Domine, dixi custodire legem tuam.",
                        "Deprecatus sum faciem tuam in toto corde meo, miserere mei secundum eloquium tuum.",
                        "Cogitavi vias meas, et converti pedes meos in testimonia tua.",
                        "Paratus sum, et non sum turbatus, ut custodiam mandata tua.",
                        "Funes peccatorum circumplexi sunt me, et legem tuam non sum oblitus.",
                        "Media nocte surgebam ad confitendum tibi, super judicia justitiae tuae.",
                        "Particeps ego sum omnium timentium te, et custodientium mandata tua.",
                        "Misericordia tua, Domine, plena est terra, justificationes tuas doce me."
                    ]
                },
                {
                    "number": 118,
                    "section": "Teth",
                    "text": [
                        "Bonitatem fecisti cum servo tuo, Domine, secundum verbum tuum.",
                        "Bonitatem et disciplinam et scientiam doce me, quia mandatis tuis credidi.",
                        "Priusquam humiliarer ego deliqui, propterea eloquium tuum custodivi.",
                        "Bonus es tu, et in bonitate tua doce me justificationes tuas.",
                        "Multiplicata est super me iniquitas superborum, ego autem in toto corde meo scrutabor mandata tua.",
                        "Coagulatum est sicut lac cor eorum, ego vero legem tuam meditatus sum.",
                        "Bonum mihi quia humiliasti me, ut discam justificationes tuas.",
                        "Bonum mihi lex oris tui, super millia auri et argenti."
                    ]
                },
                {
                    "number": 118,
                    "section": "Jod",
                    "text": [
                        "Manus tuae fecerunt me, et plasmaverunt me, da mihi intellectum, et discam mandata tua.",
                        "Qui timent te videbunt me et laetabuntur, quia in verba tua supersperavi.",
                        "Cognovi, Domine, quia aequitas judicia tua, et in veritate tua humiliasti me.",
                        "Fiat misericordia tua ut consoletur me, secundum eloquium tuum servo tuo.",
                        "Veniant mihi miserationes tuae et vivam, quia lex tua meditatio mea est.",
                        "Confundantur superbi, quia injuste iniquitatem fecerunt in me; ego autem exercebor in mandatis tuis.",
                        "Convertantur mihi timentes te, et qui noverunt testimonia tua.",
                        "Fiat cor meum immaculatum in justificationibus tuis, ut non confundar."
                    ]
                },
                {
                    "number": 118,
                    "section": "Caph",
                    "text": [
                        "Defecit in salutare tuum anima mea, et in verbum tuum supersperavi.",
                        "Defecerunt oculi mei in eloquium tuum, dicentes: Quando consolaberis me?",
                        "Quia factus sum sicut uter in pruina, justificationes tuas non sum oblitus.",
                        "Quot sunt dies servi tui? quando facies de persequentibus me judicium?",
                        "Narraverunt mihi iniqui fabulationes, sed non ut lex tua.",
                        "Omnia mandata tua veritas; inique persecuti sunt me, adjuva me.",
                        "Paulo minus consummaverunt me in terra, ego autem non dereliqui mandata tua.",
                        "Secundum misericordiam tuam vivifica me, et custodiam testimonia oris tui."
                    ]
                },
                {
                    "number": 118,
                    "section": "Lamed",
                    "text": [
                        "In aeternum, Domine, verbum tuum permanet in caelo.",
                        "In generationem et generationem veritas tua; fundasti terram, et permanet.",
                        "Ordinatione tua perseverat dies, quoniam omnia serviunt tibi.",
                        "Nisi quod lex tua meditatio mea est, tunc forte periissem in humilitate mea.",
                        "In aeternum non obliviscar justificationes tuas, quia in ipsis vivificasti me.",
                        "Tuus sum ego, salvum me fac, quoniam justificationes tuas exquisivi.",
                        "Me exspectaverunt peccatores ut perderent me; testimonia tua intellexi.",
                        "Omnis consummationis vidi finem, latum mandatum tuum nimis."
                    ]
                },
                {
                    "number": 118,
                    "section": "Mem",
                    "text": [
                        "Quomodo dilexi legem tuam, Domine! tota die meditatio mea est.",
                        "Super inimicos meos prudentem me fecisti mandato tuo, quia in aeternum mihi est.",
                        "Super omnes docentes me intellexi, quia testimonia tua meditatio mea est.",
                        "Super senes intellexi, quia mandata tua quaesivi.",
                        "In omni via mala prohibui pedes meos, ut custodiam verba tua.",
                        "A judiciis tuis non declinavi, quia tu legem posuisti mihi.",
                        "Quam dulcia faucibus meis eloquia tua! super mel ori meo.",
                        "A mandatis tuis intellexi, propterea odivi omnem viam iniquitatis."
                    ]
                },
                {
                    "number": 118,
                    "section": "Nun",
                    "text": [
                        "Lucerna pedibus meis verbum tuum, et lumen semitis meis.",
                        "Juravi et statui custodire judicia justitiae tuae.",
                        "Humiliatus sum usquequaque, Domine, vivifica me secundum verbum tuum.",
                        "Voluntaria oris mei beneplacita fac, Domine, et judicia tua doce me.",
                        "Anima mea in manibus tuis semper, et legem tuam non sum oblitus.",
                        "Posuerunt peccatores laqueum mihi, et de mandatis tuis non erravi.",
                        "Hereditate acquisivi testimonia tua in aeternum, quia exsultatio cordis mei sunt.",
                        "Inclinavi cor meum ad faciendas justificationes tuas in aeternum, propter retributionem."
                    ]
                },
                {
                    "number": 118,
                    "section": "Samech",
                    "text": [
                        "Iniquos odio habui, et legem tuam dilexi.",
                        "Adjutor et susceptor meus es tu, et in verbum tuum supersperavi.",
                        "Declinate a me, maligni, et scrutabor mandata Dei mei.",
                        "Suscita me secundum verbum tuum, et vivam, et non confundas me ab exspectatione mea.",
                        "Adjuva me, et salvus ero, et meditabor in justificationibus tuis semper.",
                        "Sprevisti omnes discedentes a judiciis tuis, quia injusta cogitatio eorum.",
                        "Praevari cantes reputavi omnes peccatores terrae, ideo dilexi testimonia tua.",
                        "Confige timore tuo carnes meas, a judiciis enim tuis timui."
                    ]
                },
                {
                    "number": 118,
                    "section": "Ain",
                    "text": [
                        "Feci judicium et justitiam, non tradas me calumniantibus me.",
                        "Suscipe servum tuum in bonum, non calumnientur me superbi.",
                        "Oculi mei defecerunt in salutare tuum, et in eloquium justitiae tuae.",
                        "Fac cum servo tuo secundum misericordiam tuam, et justificationes tuas doce me.",
                        "Servus tuus sum ego, da mihi intellectum, ut sciam testimonia tua.",
                        "Tempus faciendi, Domine, dissipaverunt legem tuam.",
                        "Ideo dilexi mandata tua super aurum et topazion.",
                        "Propterea ad omnia mandata tua dirigebar, omnem viam iniquam odio habui."
                    ]
                },
                {
                    "number": 118,
                    "section": "Pe",
                    "text": [
                        "Mirabilia testimonia tua, ideo scrutata est ea anima mea.",
                        "Declaratio sermonum tuorum illuminat, et intellectum dat parvulis.",
                        "Os meum aperui et attraxi spiritum, quia mandata tua desiderabam.",
                        "Aspice in me et miserere mei, secundum judicium diligentium nomen tuum.",
                        "Gressus meos dirige secundum eloquium tuum, et non dominetur mei omnis iniquitas.",
                        "Redime me a calumniis hominum, ut custodiam mandata tua.",
                        "Faciem tuam illumina super servum tuum, et doce me justificationes tuas.",
                        "Exitius aquae deduxerunt oculi mei, quia non custodierunt legem tuam."
                    ]
                },
                {
                    "number": 118,
                    "section": "Sade",
                    "text": [
                        "Justus es, Domine, et rectum judicium tuum.",
                        "Mandasti justitiam testimonia tua, et veritatem tuam nimis.",
                        "Tabescere me fecit zelus meus, quia obliti sunt verba tua inimici mei.",
                        "Igneus sermo tuus vehementer, et servus tuus dilexit eum.",
                        "Adolescentulus sum ego et contemptus, justificationes tuas non sum oblitus.",
                        "Justitia tua justitia in aeternum, et lex tua veritas.",
                        "Tribulatio et angustia invenerunt me, mandata tua meditatio mea est.",
                        "Aequitas testimonia tua in aeternum, intellectum da mihi, et vivam."
                    ]
                },
                {
                    "number": 118,
                    "section": "Coph",
                    "text": [
                        "Clamavi in toto corde meo, exaudi me, Domine; justificationes tuas requiram.",
                        "Clamavi ad te, salvum me fac, ut custodiam mandata tua.",
                        "Praeveni in maturitate, et clamavi, quia in verba tua supersperavi.",
                        "Praevenerunt oculi mei ad te diluculo, ut meditarer eloquia tua.",
                        "Vocem meam audi secundum misericordiam tuam, Domine, et secundum judicium tuum vivifica me.",
                        "Appropinquaverunt persequentes me iniquitatem, a lege autem tua longe facti sunt.",
                        "Prope es tu, Domine, et omnes viae tuae veritas.",
                        "Initio cognovi de testimoniis tuis, quia in aeternum fundasti ea."
                    ]
                },
                {
                    "number": 118,
                    "section": "Res",
                    "text": [
                        "Vide humilitatem meam, et eripe me, quia legem tuam non sum oblitus.",
                        "Judica judicium meum, et redime me, propter eloquium tuum vivifica me.",
                        "Longe a peccatoribus salus, quia justificationes tuas non exquisierunt.",
                        "Misericordiae tuae multae, Domine, secundum judicium tuum vivifica me.",
                        "Multi qui persequuntur me, et tribulant me; a testimoniis tuis non declinavi.",
                        "Vidi praevaricantes, et tabescebam, quia eloquia tua non custodierunt.",
                        "Vide quoniam mandata tua dilexi, Domine, in misericordia tua vivifica me.",
                        "Principium verborum tuorum veritas, in aeternum omnia judicia justitiae tuae."
                    ]
                },
                {
                    "number": 118,
                    "section": "Sin",
                    "text": [
                        "Principes persecuti sunt me gratis, et a verbis tuis formidavit cor meum.",
                        "Laetabor ego super eloquia tua, sicut qui invenit spolia multa.",
                        "Iniquitatem odio habui et abominatus sum, legem autem tuam dilexi.",
                        "Septies in die laudem dixi tibi, super judicia justitiae tuae.",
                        "Pax multa diligentibus legem tuam, et non est illis scandalum.",
                        "Exspectabam salutare tuum, Domine, et mandata tua dilexi.",
                        "Custodivit anima mea testimonia tua, et dilexit ea vehementer.",
                        "Servavi mandata tua et testimonia tua, quia omnes viae meae in conspectu tuo."
                    ]
                },
                {
                    "number": 118,
                    "section": "Thau",
                    "text": [
                        "Appropinquet deprecatio mea in conspectu tuo, Domine; juxta eloquium tuum da mihi intellectum.",
                        "Intret postulatio mea in conspectu tuo; secundum eloquium tuum eripe me.",
                        "Eructabunt labia mea hymnum, cum docueris me justificationes tuas.",
                        "Pronuntiabit lingua mea eloquium tuum, quia omnia mandata tua aequitas.",
                        "Fiat manus tua ut salvet me, quoniam mandata tua elegi.",
                        "Concupivi salutare tuum, Domine, et lex tua meditatio mea est.",
                        "Vivet anima mea, et laudabit te, et judicia tua adjuvabunt me.",
                        "Erravi sicut ovis quae periit; quaere servum tuum, quia mandata tua non sum oblitus."
                    ]
                },
            
                    {
                        "number": 119,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Beati immaculati in via, qui ambulant in lege Domini.",
                            "Beati qui scrutantur testimonia ejus; in toto corde exquirunt eum.",
                            "Non enim qui operantur iniquitatem, in viis ejus ambulaverunt.",
                            "Tu mandasti mandata tua custodire nimis.",
                            "Utinam dirigantur viae meae ad custodiendas justificationes tuas!",
                            "Tunc non confundar, cum perspexero in omnibus mandatis tuis.",
                            "Confitebor tibi in directione cordis, in eo quod didici judicia justitiae tuae.",
                            "Justificationes tuas custodiam; non me derelinquas usquequaque."
                        ]
                    },
                    {
                        "number": 120,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Ad Dominum cum tribularer clamavi, et exaudivit me.",
                            "Domine, libera animam meam a labiis iniquis et a lingua dolosa.",
                            "Quid detur tibi, aut quid apponatur tibi ad linguam dolosam?",
                            "Sagittae potentis acutae, cum carbonibus desolatoriis.",
                            "Heu mihi, quia incolatus meus prolongatus est! Habitavi cum habitantibus Cedar;",
                            "multum incola fuit anima mea.",
                            "Cum his qui oderunt pacem, eram pacificus; cum loquebar illis, impugnabant me gratis."
                        ]
                    },
                    {
                        "number": 121,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Levavi oculos meos in montes, unde veniet auxilium mihi.",
                            "Auxilium meum a Domino, qui fecit caelum et terram.",
                            "Non det in commotionem pedem tuum, neque dormitet qui custodit te.",
                            "Ecce non dormitabit neque dormiet, qui custodit Israel.",
                            "Dominus custodit te; Dominus protectio tua super manum dexteram tuam.",
                            "Per diem sol non uret te, neque luna per noctem.",
                            "Dominus custodit te ab omni malo; custodiat animam tuam Dominus.",
                            "Dominus custodiat introitum tuum et exitum tuum, ex hoc nunc et usque in saeculum."
                        ]
                    },
                    {
                        "number": 122,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Laetatus sum in his quae dicta sunt mihi: In domum Domini ibimus.",
                            "Stantes erant pedes nostri in atriis tuis, Jerusalem.",
                            "Jerusalem, quae aedificatur ut civitas, cujus participatio ejus in idipsum.",
                            "Illuc enim ascenderunt tribus, tribus Domini, testimonium Israel, ad confitendum nomini Domini.",
                            "Quia illic sederunt sedes in judicio, sedes super domum David.",
                            "Rogate quae ad pacem sunt Jerusalem, et abundantia diligentibus te.",
                            "Fiat pax in virtute tua, et abundantia in turribus tuis.",
                            "Propter fratres meos et proximos meos, loquebar pacem de te.",
                            "Propter domum Domini Dei nostri, quaesivi bona tibi."
                        ]
                    },
                    {
                        "number": 123,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Ad te levavi oculos meos, qui habitas in caelis.",
                            "Ecce sicut oculi servorum in manibus dominorum suorum,",
                            "sicut oculi ancillae in manibus dominae suae: ita oculi nostri ad Dominum Deum nostrum, donec misereatur nostri.",
                            "Miserere nostri, Domine, miserere nostri, quia multum repleti sumus despectione;",
                            "quia multum repleta est anima nostra opprobrium abundantibus et despectio superbis."
                        ]
                    },
                    {
                        "number": 124,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Nisi quia Dominus erat in nobis, dicat nunc Israel,",
                            "nisi quia Dominus erat in nobis, cum exsurgerent homines in nos,",
                            "forsitan vivos deglutissent nos.",
                            "Cum irasceretur furor eorum in nos, forsitan aqua absorbuisset nos.",
                            "Torrentem pertransivit anima nostra; forsitan pertransisset anima nostra aquam intolerabilem.",
                            "Benedictus Dominus, qui non dedit nos in captionem dentibus eorum.",
                            "Anima nostra sicut passer erepta est de laqueo venantium; laqueus contritus est, et nos liberati sumus.",
                            "Adjutorium nostrum in nomine Domini, qui fecit caelum et terram."
                        ]
                    },
                    {
                        "number": 125,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Qui confidunt in Domino, sicut mons Sion: non commovebitur in aeternum, qui habitat in Jerusalem.",
                            "Montes in circuitu ejus, et Dominus in circuitu populi sui, ex hoc nunc et usque in saeculum.",
                            "Quia non relinquet Dominus virgam peccatorum super sortem justorum, ut non extendant justi ad iniquitatem manus suas.",
                            "Benefac, Domine, bonis, et rectis corde.",
                            "Declinantes autem in obligationes, adducet Dominus cum operantibus iniquitatem. Pax super Israel!"
                        ]
                    },
                    {
                        "number": 126,
                        "section": "Psalms of Ascent",
                        "text": [
                            "In convertendo Dominus captivitatem Sion, facti sumus sicut consolati.",
                            "Tunc repletum est gaudio os nostrum, et lingua nostra exsultatione; tunc dicent inter gentes: Magnificavit Dominus facere cum eis.",
                            "Magnificavit Dominus facere nobiscum; facti sumus laetantes.",
                            "Converte, Domine, captivitatem nostram, sicut torrens in austro.",
                            "Qui seminant in lacrimis, in exsultatione metent.",
                            "Euntes ibant et flebant, mittentes semina sua; venientes autem venient cum exsultatione, portantes manipulos suos."
                        ]
                    },
                    {
                        "number": 127,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Nisi Dominus aedificaverit domum, in vanum laboraverunt qui aedificant eam; nisi Dominus custodierit civitatem, in vanum vigilat qui custodit eam.",
                            "Vanum est vobis ante lucem surgere; surgite postquam sederitis, qui manducatis panem doloris.",
                            "Cum dederit dilectis suis somnum: ecce hereditas Domini, filii; merces, fructus ventris.",
                            "Sicut sagittae in manu potentis, ita filii excussorum.",
                            "Beatus vir qui implevit desiderium suum ex ipsis; non confundetur cum loquetur inimicis suis in porta."
                        ]
                    },
                    {
                        "number": 128,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Beati omnes qui timent Dominum, qui ambulant in viis ejus.",
                            "Labores fructuum tuorum manducabis; beatus es, et bene tibi erit.",
                            "Uxor tua sicut vitis abundans in lateribus domus tuae; filii tui sicut novellae olivarum in circuitu mensae tuae.",
                            "Ecce sic benedicetur homo qui timet Dominum.",
                            "Benedicat tibi Dominus ex Sion, et videas bona Jerusalem omnibus diebus vitae tuae.",
                            "Et videas filios filiorum tuorum. Pax super Israel!"
                        ]
                    },
                    {
                        "number": 129,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Saepe expugnaverunt me a juventute mea, dicat nunc Israel;",
                            "saepe expugnaverunt me a juventute mea, etenim non potuerunt mihi.",
                            "Supra dorsum meum fabricaverunt peccatores; prolongaverunt iniquitatem suam.",
                            "Dominus justus concidit cervices peccatorum.",
                            "Confundantur et convertantur retrorsum omnes qui oderunt Sion.",
                            "Fiant sicut foenum tectorum, quod priusquam evellatur exaruit,",
                            "de quo non implevit manum suam qui metit, et sinum suum qui manipulos colligit.",
                            "Et non dixerunt qui praeteribant: Benedictio Domini super vos; benediximus vobis in nomine Domini."
                        ]
                    },
                    {
                        "number": 130,
                        "section": "Psalms of Ascent",
                        "text": [
                            "De profundis clamavi ad te, Domine;",
                            "Domine, exaudi vocem meam. Fiant aures tuae intendentes in vocem deprecationis meae.",
                            "Si iniquitates observaveris, Domine, Domine, quis sustinebit?",
                            "Quia apud te propitiatio est, et propter legem tuam sustinui te, Domine.",
                            "Sustinuit anima mea in verbo ejus; speravit anima mea in Domino.",
                            "A custodia matutina usque ad noctem, speret Israel in Domino.",
                            "Quia apud Dominum misericordia, et copiosa apud eum redemptio.",
                            "Et ipse redimet Israel ex omnibus iniquitatibus ejus."
                        ]
                    },
                    {
                        "number": 131,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Domine, non est exaltatum cor meum, neque elati sunt oculi mei; neque ambulavi in magnis, neque in mirabilibus super me.",
                            "Si non humiliter sentiebam, sed exaltavi animam meam; sicut ablactatus est super matre sua, ita retributio in anima mea.",
                            "Speret Israel in Domino, ex hoc nunc et usque in saeculum."
                        ]
                    },
                    {
                        "number": 132,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Memento, Domine, David et omnis mansuetudinis ejus;",
                            "quomodo juravit Domino, votum vovit Deo Jacob:",
                            "Si introiero in tabernaculum domus meae, si ascendero in lectum strati mei,",
                            "si dedero somnum oculis meis, aut palpebris meis dormitationem,",
                            "aut requiem temporibus meis, donec inveniam locum Domino, tabernaculum Deo Jacob.",
                            "Ecce audivimus eam in Ephrata; invenimus eam in campis silvae.",
                            "Introibimus in tabernaculum ejus; adorabimus in loco ubi steterunt pedes ejus.",
                            "Surge, Domine, in requiem tuam, tu et arca sanctificationis tuae.",
                            "Sacerdotes tui induantur justitiam, et sancti tui exsultent.",
                            "Propter David servum tuum, non avertas faciem christi tui.",
                            "Juravit Dominus David veritatem, et non frustrabitur eam: De fructu ventris tui ponam super sedem tuam.",
                            "Si custodierint filii tui testamentum meum, et testimonia mea haec quae docebo eos, et filii eorum usque in saeculum sedebunt super sedem tuam.",
                            "Quoniam elegit Dominus Sion; elegit eam in habitationem sibi:",
                            "Haec requies mea in saeculum saeculi; hic habitabo quoniam elegi eam.",
                            "Victum ejus benedicens benedicam; pauperes ejus saturabo panibus.",
                            "Sacerdotes ejus induam salutari, et sancti ejus exsultatione exsultabunt.",
                            "Illuc producam cornu David; paravi lucernam christo meo.",
                            "Inimicos ejus induam confusione; super ipsum autem florebit sanctificatio mea."
                        ]
                    },
                    {
                        "number": 133,
                        "section": "Psalms of Ascent",
                        "text": [
                            "Ecce quam bonum et quam jucundum habitare fratres in unum!",
                            "Sicut unguentum in capite, quod descendit in barbam, barbam Aaron,",
                            "quod descendit in oram vestimenti ejus; sicut ros Hermon, qui descendit in montem Sion.",
                            "Quoniam illic mandavit Dominus benedictionem, et vitam usque in saeculum."
                        ]
                    },
                
       
        {
            "number": 150,
            "text": [
                "Laudate Dominum in sanctis ejus;",
                "laudate eum in firmamento virtutis ejus.",
                "Laudate eum in virtutibus ejus;",
                "laudate eum secundum multitudinem magnitudinis ejus."
            ]
        }
    ]
}
