{
  "themes": [

    {
      "psalmNumber": 1,
      "category": "",
      "themes": [
        {
          "name": "Separation → Delight",
          "description": "From avoidance of the wicked to joy in God's law",
          "lemmas": ["sto", "abeo", "sedeo", "lex", "meditor"],
          "startLine": 1,
          "endLine": 2,
          "comment": "The blessed one turns away from the path of the wicked and instead finds delight in the law of the Lord.", 
          "comment2": "Augustine interprets this as a triple renunciation (consilium → via → cathedra), culminating in the joy of meditating on the Law. For him, the righteous one is defined by inward transformation and desire for God (Enarr. Ps. 1.1–2)."
        },

       {
          "name": "Rootedness → Fruitfulness",
          "description": "From spiritual planting to lasting vitality and success",
          "lemmas": ["lignum", "planto", "aqua", "fructus", "prospero"],
          "startLine": 3,
          "endLine": 4,
          "comment": "The just is like a tree planted by streams, yielding fruit in its season and not withering. This image emphasizes stability, growth, and enduring vitality through divine nourishment.",
          "comment2": "Augustine reads the tree as one rooted in grace and Scripture, continually refreshed by Christ, the living water. Its fruit signifies good works in due season, prospering by God’s help (Enarr. Ps. 1.3)."
        },
        {
          "name": "Chaff → Separation",
          "description": "From unstable wickedness to final divine separation",
          "lemmas": ["pulvis", "iudicium", "via", "iter", "pereo", "nosco"],
          "startLine": 5,
          "endLine": 6,
          "comment": "The wicked cannot stand in judgment or in the assembly of the righteous, for the Lord knows the way of the just while the way of the impious comes to nothing.",
          "comment2": "Augustine contrasts the rooted tree of the righteous with the empty lightness of the ungodly. The Lord 'knows' (novit) the way of the just with covenantal intimacy, but the way of the wicked perishes — eternal separation from God (Enarr. Ps. 1.5–6)."
        }
      ]
    },

{
  "psalmNumber": 2,
  "category": "",
  "themes": [
    {
      "name": "Rage → Opposition",
      "description": "From the turmoil of nations to defiance against the Lord and His Christ",
      "lemmas": ["fremo", "inanis", "christus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Nations rage in vanity, rulers set themselves against the Lord and His Anointed, revealing the futility of human power against divine kingship.",
      "comment2": "Augustine interprets this as the nations plotting against Christ and His Church, yet all human counsels are 'inania'—empty—before the eternal decree of God (Enarr. Ps. 2.1–2)."
    },
    {
      "name": "Chains → Laughter",
      "description": "From rebellion against divine bonds to God’s derision from heaven",
      "lemmas": ["vinculum", "iugum", "irrideo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The peoples reject the Lord’s yoke as bondage, but God responds not with fear but with laughter, revealing their revolt as powerless.",
      "comment2": "Augustine notes that what the proud see as 'chains' are in fact bonds of love and discipline; God mocks their rebellion as vain pretension (Enarr. Ps. 2.3–4)."
    },
    {
      "name": "Wrath → Installation",
      "description": "From divine anger to the establishment of the true King on Zion",
      "lemmas": ["ira", "furo", "rex", "Sion"],
      "startLine": 5,
      "endLine": 6,
      "comment": "God answers with wrath, establishing His chosen king upon Zion, His holy mountain.",
      "comment2": "Augustine reads Zion as the Church, the place where Christ reigns despite worldly rage; God's anger here manifests as His unshakable justice (Enarr. Ps. 2.5–6)."
    },
    {
      "name": "Sonship → Inheritance",
      "description": "From divine begetting to the universal rule of the Son",
      "lemmas": ["filius", "genui", "hereditas"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The Lord declares the King to be His begotten Son and grants Him all nations as inheritance and possession.",
      "comment2": "For Augustine, 'hodie genui te' refers to the eternal generation of the Son and also to the Resurrection; the inheritance is the Church drawn from all nations (Enarr. Ps. 2.7–8)."
    },
    {
      "name": "Rod → Shattering",
      "description": "From rule with iron to the breaking of resistance",
      "lemmas": ["virga", "ferreus", "confringo"],
      "startLine": 9,
      "endLine": 10,
      "comment": "The Messiah rules with a rod of iron, shattering nations like fragile pottery, yet kings are called to wisdom and instruction.",
      "comment2": "Augustine notes the dual sense: the iron rod is both severe judgment and the firm, unbreakable discipline of Christ, which smashes pride but also reforms the humble (Enarr. Ps. 2.9–10)."
    },
    {
      "name": "Service → Trust",
      "description": "From trembling service to blessed confidence in the Lord",
      "lemmas": ["servio", "timor", "disciplina", "confido"],
      "startLine": 11,
      "endLine": 12,
      "comment": "The psalm ends by exhorting rulers to serve with fear, rejoice with trembling, embrace discipline, and find blessing in trust.",
      "comment2": "Augustine interprets this as the movement from fear to love: discipline leads to true freedom, and blessedness belongs to all who cling to Christ in humble trust (Enarr. Ps. 2.11–12)."
    }
  ]
},


    
   
{
  "psalmNumber": 3,
  "category": "",
  "themes": [
    {
      "name": "Enemies → Doubt",
      "description": "From multiplied persecutors to their taunt: no salvation in God",
      "lemmas": ["multus", "insurgo", "salus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalm opens with a cry of affliction: enemies surround and voices of despair rise — 'no salvation in his God.' Augustine sees here the voice of Christ’s body, the Church, mocked in its suffering (Enarr. Ps. 3.1–2)."
    },
    {
      "name": "Shield → Hearing",
      "description": "From God as protector and glory to the prayer He hears on His holy mountain",
      "lemmas": ["suscipio", "gloria", "exalto", "mons"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Against despair, God is confessed as shield, glory, and lifter of the head. Prayer is not wasted: it ascends and is heard from the holy mountain. Augustine reads this as Christ praying in the Passion, with assurance of the Father’s help (Enarr. Ps. 3.3–4)."
    },
    {
      "name": "Sleep → Rising",
      "description": "From mortal sleep to resurrection and fearless confidence",
      "lemmas": ["dormio", "soporor", "exsurgo", "suscipio"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The psalmist sleeps and wakes because the Lord sustains him. Augustine sees a mystery of Christ’s death and resurrection, by which the faithful too find courage: they need not fear even a multitude of foes (Enarr. Ps. 3.5–6)."
    },
    {
      "name": "Blow → Blessing",
      "description": "From God’s strike against enemies to salvation and blessing for His people",
      "lemmas": ["percutio", "dens", "salus", "benedictio"],
      "startLine": 7,
      "endLine": 8,
      "comment": "God shatters the teeth of sinners, breaking their power to devour. Salvation belongs to the Lord, and His blessing rests on His people. Augustine interprets this as Christ’s victory over sin and death, shared with the Church (Enarr. Ps. 3.7–8)."
    }
  ]
},

  {
  "psalmNumber": 4,
  "category": "",
  "themes": [
    {
      "name": "Call → Answer",
      "description": "From human invocation to divine enlargement and mercy",
      "lemmas": ["invoco", "exaudio", "dilato"],
      "startLine": 1,
      "endLine": 2,
      "comment": "God answers with both hearing and enlargement of the heart. The psalmist moves from constriction to freedom by divine mercy.",
      "comment2": "Augustine recalls how God 'dilated' his narrow heart during conversion, through Ambrose’s preaching and Monica’s tears (Conf. 9.4.8)."
    },
    {
      "name": "Vanity → Truth",
      "description": "From clinging to falsehood to beholding divine wonder",
      "lemmas": ["vanitas", "mendacium", "mirifico", "sanctus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The psalmist challenges men who love vanity and lies, redirecting them to the marvel of God’s chosen.",
      "comment2": "Augustine recognized his own 'heavy heart' in this appeal: God’s rebuke pierced him as one long ensnared by empty loves (Conf. 9.4.9)."
    },
    {
      "name": "Examination → Sacrifice",
      "description": "From self-search in silence to offering righteous worship",
      "lemmas": ["irascor", "pecco", "cubile", "sacrificium", "iustitia"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Nighttime reflection leads to repentance, expressed in offering the sacrifice of righteousness and trusting in the Lord.",
      "comment2": "Augustine links this to his garden conversion (shaken in his 'bed' by God’s command) and to Monica’s prayers as true sacrifice that upheld his hope (Conf. 8.12.28–29; 9.4.10–11)."
    },
    {
      "name": "Divine Light → Revelation",
      "description": "From worldly good to the light of God’s countenance",
      "lemmas": ["ostendo", "lumen", "vultus", "bonus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Earthly blessings pale before the shining of God’s face, which brings true joy.",
      "comment2": "Augustine contrasts the fleeting light of philosophy with the sealed light of Scripture — the illumination of God’s face (Conf. 9.4.12)."
    },
    {
      "name": "Abundance → Eternal Rest",
      "description": "From earthly plenty to the peace of divine rest",
      "lemmas": ["frumentum", "vinum", "pax", "requiesco"],
      "startLine": 8,
      "endLine": 9,
      "comment": "Material abundance points beyond itself to the peace found only in God, where the soul rests secure.",
      "comment2": "At Ostia, Augustine and Monica tasted this peace — the Eucharistic abundance of 'grain and wine' finding fulfillment in eternal rest (Conf. 9.10.23–26)."
    }
  ]
},
  
{
  "psalmNumber": 5,
  "category": "",
  "themes": [
    {
      "name": "Speech → Prayer",
      "description": "From vocal petition to intimate appeal before God the King",
      "lemmas": ["verbum", "clamor", "oratio", "rex"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine sees these opening lines as a layering of communication: words (verba), then inward groaning (clamor), then formal petition (oratio). God is not just King but intimate listener (Enarr. Ps. 5.2)."
    },
    {
      "name": "Morning → Presence",
      "description": "From early prayer to reverent standing before God",
      "lemmas": ["mane", "orabo", "astabo", "videbo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The soul rises early to speak and then to watch, anticipating divine presence. Augustine connects this with Christ rising early to pray (Mk 1:35), revealing devotion and attentiveness (Enarr. Ps. 5.4)."
    },
    {
      "name": "Evil → Rejection",
      "description": "From wicked intentions to divine intolerance",
      "lemmas": ["malignus", "iniquitas", "habito", "permaneo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "God’s holiness cannot dwell with evil. Augustine sees the dwelling (habitare) as incompatible with impurity; those clinging to iniquity remain outside (Enarr. Ps. 5.5)."
    },
    {
      "name": "Blood → Worship",
      "description": "From condemnation of the violent to the fear-filled approach to the sanctuary",
      "lemmas": ["sanguis", "dolus", "introeo", "adoro", "misericordia"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Contrasting the abominable (abominabitur) with the beloved who enters the temple. Augustine emphasizes that only through mercy (misericordia) does one dare draw near (Enarr. Ps. 5.8)."
    },
    {
      "name": "Injustice → Guidance",
      "description": "From facing deceitful enemies to seeking righteous direction",
      "lemmas": ["iustitia", "inimicus", "dirigo", "deduco"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Because the enemy lacks truth, the psalmist seeks a path directed by God's justice. Augustine sees this path as Christ, the Way (John 14:6), given to those who reject the empty hearts of the wicked (Enarr. Ps. 5.9–10)."
    },
    {
      "name": "Deceit → Judgment",
      "description": "From poisonous speech to divine judgment",
      "lemmas": ["sepulchrum", "dolus", "iudico", "decido", "impietas"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Their throats are open graves, and their deceit requires divine judgment. Augustine reads this as the corruption of false teachers and the need for God to scatter their vain plots (Enarr. Ps. 5.11–12; Rom 3:13)."
    },
    {
      "name": "Hope → Exultation",
      "description": "From trusting in God to everlasting joy and communion",
      "lemmas": ["spero", "exsulto", "laetor", "glorior"],
      "startLine": 13,
      "endLine": 14,
      "comment": "Augustine sees this as the fruit of the just soul: exultation and divine indwelling. Hope leads to joy, joy to glory, and glory to divine presence (Enarr. Ps. 5.13–14)."
    },
    {
      "name": "Favor → Shield",
      "description": "From divine goodwill to crowned protection",
      "lemmas": ["voluntas", "scutum", "corono"],
      "startLine": 15,
      "endLine": 15,
      "comment": "God’s favor (voluntas) surrounds the just like a shield. Augustine sees this not only as protection, but glorification—God crowns the soul with His own goodness (Enarr. Ps. 5.15)."
    }
  ]

},


{
  "psalmNumber": 6,
  "category": "",
  "themes": [
    {
      "name": "Wrath → Mercy",
      "description": "From divine anger to a plea for healing compassion",
      "lemmas": ["furor", "arguo", "corripio", "infirmus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist appeals to God not as a just judge but as a merciful physician. Weakness, both bodily and spiritual, is openly confessed.",
      "comment2": "Augustine interprets the chastisement ('arguas… corripias') not as condemnation but as medicinal correction, so that frailty may be healed by divine mercy (Enarr. Ps. 6.1–2)."
    },
    {
      "name": "Agitation → Rescue",
      "description": "From inner turmoil to divine salvation",
      "lemmas": ["turbo", "converto", "eripio", "misericordia"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The psalmist cries out from deep turmoil, pleading for rescue grounded not in merit but in mercy.",
      "comment2": "For Augustine, the soul’s turbulence is stilled only by God turning toward it; salvation rests entirely on the mercy of the Lord (Enarr. Ps. 6.3–4)."
    },
    {
      "name": "Mortality → Tears",
      "description": "From the silence of death to sorrowful intercession",
      "lemmas": ["mors", "infernus", "confiteor", "lacrima"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Death is a place of silence where no one confesses God; the psalmist therefore pours out tears in prayer while still alive.",
      "comment2": "Augustine sees these tears as compunction, watering the soul like a field, preparing it for renewal by God (Enarr. Ps. 6.5–6)."
    },
    {
      "name": "Weariness → Hearing",
      "description": "From exhaustion under oppression to God hearing the cry",
      "lemmas": ["inimicus", "invetero", "fletus", "exaudio"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Weary and worn down among enemies, the psalmist clings to hope because the Lord hears his weeping.",
      "comment2": "Augustine emphasizes that God’s hearing ('exaudivit') shows His closeness to the contrite heart, even amid human hostility (Enarr. Ps. 6.7–8)."
    },
    {
      "name": "Prayer → Reversal",
      "description": "From received prayer to the shame and retreat of enemies",
      "lemmas": ["oratio", "suscipio", "erubesco", "inimicus"],
      "startLine": 9,
      "endLine": 10,
      "comment": "The psalmist’s prayer is not only heard but embraced; enemies are overturned in shame and confusion.",
      "comment2": "Augustine highlights the reversal: the psalmist is lifted up ('suscepit'), while enemies are cast down in sudden shame ('erubescant valde velociter')—a figure of the final judgment (Enarr. Ps. 6.9–10)."
    }
  ]
},


{
  "psalmNumber": 7,
  "category": "",
  "themes": [
    {
      "name": "Threat → Refuge",
      "description": "From violent pursuit to trusting in divine protection",
      "lemmas": ["leo", "rapio", "spero", "libero"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist likens persecutors to a lion ready to seize its prey. In response, he entrusts himself to God as the only liberator.",
      "comment2": "Augustine interprets the lion as the devil or violent adversaries. Safety lies only in the Lord, who receives those fleeing in faith (Enarr. Ps. 7.1–2)."
    },
    {
      "name": "Integrity → Collapse",
      "description": "If unjust, the psalmist accepts shameful defeat",
      "lemmas": ["reddo", "retribuo", "decido", "inanis"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The psalmist offers himself to God’s judgment: if guilty of betrayal, let him fall empty-handed into enemy hands.",
      "comment2": "For Augustine, this is not pride but holy fear: a willingness to be judged shows the integrity of the just. To fall 'inanis' is to lose all fruit of life apart from God (Enarr. Ps. 7.3–4)."
    },
    {
      "name": "Capture → Dust",
      "description": "From pursuit to utter humiliation",
      "lemmas": ["persequor", "comprehendo", "conculco", "pulvis"],
      "startLine": 5,
      "endLine": 6,
      "comment": "If guilty, let the enemy overtake and trample him, reducing his glory to dust.",
      "comment2": "Augustine sees dust as the destiny of the proud soul abandoned to itself: the fall of human glory without God’s defense (Enarr. Ps. 7.5–6)."
    },
    {
      "name": "Judgment → Ascent",
      "description": "From divine summons to enthronement above all peoples",
      "lemmas": ["exsurgo", "mandatum", "synagoga", "iudico"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The Lord rises to judge among assembled nations, taking His seat on high.",
      "comment2": "Augustine reads this as Christ exalted after the resurrection, gathering peoples into His Church and judging with justice (Enarr. Ps. 7.7–8)."
    },
    {
      "name": "Innocence → Discernment",
      "description": "From appeal to justice to God’s searching judgment",
      "lemmas": ["iustitia", "innocentia", "scrutor", "renes"],
      "startLine": 9,
      "endLine": 10,
      "comment": "The psalmist asks to be judged by his innocence, yet acknowledges God searches even the heart and reins.",
      "comment2": "For Augustine, this penetrates deeper than outward acts: God weighs interior motives, revealing true justice (Enarr. Ps. 7.9–10)."
    },
    {
      "name": "Righteousness → Warning",
      "description": "From God’s help for the upright to warning the impenitent",
      "lemmas": ["iustus", "adiutorium", "patiens", "converto"],
      "startLine": 11,
      "endLine": 12,
      "comment": "God is patient and aids the upright, but warns that His forbearance has limits.",
      "comment2": "Augustine urges conversion while time remains: God’s patience is meant to lead sinners back, not excuse them forever (Enarr. Ps. 7.11–12)."
    },
    {
      "name": "Preparation → Execution",
      "description": "From preparation of weapons to fiery judgment",
      "lemmas": ["paro", "vibro", "sagitta", "ardens"],
      "startLine": 13,
      "endLine": 14,
      "comment": "God bends the bow and readies burning arrows, images of judgment.",
      "comment2": "Augustine interprets these arrows spiritually: divine words pierce sinners, igniting repentance rather than mere destruction (Enarr. Ps. 7.13–14)."
    },
    {
      "name": "Conception → Iniquity",
      "description": "From conceiving sin to its birth in injustice",
      "lemmas": ["parturio", "concipio", "iniquitas", "dolor"],
      "startLine": 15,
      "endLine": 16,
      "comment": "The wicked conceive trouble and give birth to iniquity, only to fall into their own pit.",
      "comment2": "Augustine sees in this the paradox of the cross: by plotting Christ’s death, the devil trapped himself in the pit he dug (Enarr. Ps. 7.15–16)."
    },
    {
      "name": "Retribution → Praise",
      "description": "From downfall of the wicked to exaltation of divine justice",
      "lemmas": ["convertor", "iniquitas", "confiteor", "psallo"],
      "startLine": 17,
      "endLine": 18,
      "comment": "The sinner’s violence recoils upon his own head, while the psalmist gives thanks in song.",
      "comment2": "Augustine highlights the contrast: the wicked are ensnared in their own works, but the just respond with praise of God’s unchanging righteousness (Enarr. Ps. 7.17–18)."
    }
  ]
},

{
  "psalmNumber": 8,
  "category": "",
  "themes": [
    {
      "name": "Divine Name → Universal Glory",
      "description": "From praising God’s name to His majesty exalted above the heavens",
      "lemmas": ["nomen", "admirabile", "magnificentia", "caelum"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist praises God’s admirable name (‘nomen,’ ‘admirabile’) across the earth, exalting His majesty (‘magnificentia’) above the heavens (‘caelum’).",
      "comment2": "Augustine sees ‘nomen’ and ‘admirabile’ as God’s glory revealed universally, with ‘magnificentia’ above ‘caelum’ prefiguring Christ’s ascension (Enarr. Ps. 8.1–2)."
    },
    {
      "name": "Weak Praise → Defeat of Enemies",
      "description": "From the praise of the weak to the destruction of God’s enemies",
      "lemmas": ["infans", "laudem", "inimicus", "destruo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "God perfects praise (‘laudem’) from infants (‘infans’), confounding the enemy (‘inimicus’) and avenger through their weakness, as He reveals His works (‘opera’) in the heavens.",
      "comment2": "Augustine interprets ‘infans’ and ‘laudem’ as the humble, including Christ and His Church, silencing the ‘inimicus’ through divine power (Enarr. Ps. 8.3–4)."
    },
    {
      "name": "Human Lowliness → Divine Honor",
      "description": "From human insignificance to being crowned with glory",
      "lemmas": ["homo", "memoro", "gloria", "corono"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The psalmist marvels that God remembers (‘memoro’) man (‘homo’), crowning him (‘corono’) with glory (‘gloria’) and honor, despite his lowliness.",
      "comment2": "Augustine sees ‘homo’ as Christ, the Son of Man, whom God ‘memoro’ and ‘corono’ with ‘gloria,’ exalting humanity through Him (Enarr. Ps. 8.5–6)."
    },
    {
      "name": "Divine Creation → Human Dominion",
      "description": "From God’s works to man’s authority over creation",
      "lemmas": ["constituo", "opus", "subicio", "pes"],
      "startLine": 7,
      "endLine": 8,
      "comment": "God establishes (‘constituo’) man over His works (‘opus’), subjecting (‘subicio’) all creation, from sheep to cattle, under his feet (‘pes’).",
      "comment2": "Augustine views ‘constituo’ and ‘subicio’ as Christ’s dominion over creation, with ‘opus’ and ‘pes’ symbolizing His authority extended to the Church (Enarr. Ps. 8.7–8)."
    },
    {
      "name": "Creation’s Paths → Universal Praise",
      "description": "From the creatures of air and sea to renewed praise of God’s name",
      "lemmas": ["volucris", "piscis", "nomen", "admirabile"],
      "startLine": 9,
      "endLine": 10,
      "comment": "The birds (‘volucris’) and fish (‘piscis’) traversing creation’s paths lead to renewed praise of God’s admirable name (‘nomen,’ ‘admirabile’) across the earth.",
      "comment2": "Augustine sees ‘volucris’ and ‘piscis’ as symbols of the Church’s mission, proclaiming God’s ‘nomen’ and ‘admirabile’ glory universally (Enarr. Ps. 8.9–10)."
    }
  ]
},


{
  "psalmNumber": 9,
  "category": "a",
  "themes": [
    {
      "name": "Wonder → Praise",
      "description": "From recounting God’s marvelous works to rejoicing in His name",
      "lemmas": ["mirabile", "exsulto", "psallo", "nomen"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist begins with wholehearted thanksgiving, rejoicing and singing to the Most High for His wondrous deeds.",
      "comment2": "Augustine sees here the Church’s song: the marvels of Christ’s resurrection and the new creation are confessed with joy and psalmody (Enarr. Ps. 9.1–2)."
    },
    {
      "name": "Enemy → Judgment",
      "description": "From the downfall of enemies to God’s righteous throne",
      "lemmas": ["inimicus", "infirmo", "iudicium", "thronus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "God turns back the enemy, causing them to perish before His face, while He sits enthroned in justice.",
      "comment2": "Augustine interprets this as the triumph of Christ over the devil and sin, enthroning God’s judgment as the foundation of the City of God (Enarr. Ps. 9.3–4)."
    },
    {
      "name": "Nations → Oblivion",
      "description": "From rebuked nations to perishing memory",
      "lemmas": ["increpo", "gens", "impious", "memoria"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The nations are rebuked, the wicked perish, their names erased, their cities destroyed, and their memory vanishes in noise.",
      "comment2": "For Augustine, this points to earthly kingdoms opposed to God, whose glory fades to nothing, unlike the eternal remembrance of the just (Enarr. Ps. 9.5–6)."
    },
    {
      "name": "Eternal Throne → Just Judgment",
      "description": "From God’s everlasting throne to equity in judgment",
      "lemmas": ["aeternus", "thronus", "iudicium", "iustitia"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The Lord remains forever, establishing His throne in judgment to govern the earth with righteousness.",
      "comment2": "Augustine sees Christ as the eternal Judge, who alone brings true equity — not partial or earthly justice, but eternal righteousness (Enarr. Ps. 9.7–8)."
    },
    {
      "name": "Refuge → Trust",
      "description": "From God as a refuge for the poor to the trust of those who know His name",
      "lemmas": ["refugium", "pauper", "nomen", "spero"],
      "startLine": 9,
      "endLine": 10,
      "comment": "The poor find refuge in God, and those who know His name place their trust in Him, confident He will not forsake them.",
      "comment2": "Augustine teaches that Christ Himself is the stronghold of the poor, and that true knowledge of God’s name comes through faith in Him (Enarr. Ps. 9.9–10)."
    },
    {
      "name": "Zion → Remembrance",
      "description": "From psalms in Zion to God remembering the blood of the poor",
      "lemmas": ["psallo", "Sion", "sanguis", "recordor"],
      "startLine": 11,
      "endLine": 12,
      "comment": "The psalm calls for song in Zion and the proclamation of God’s works, for He remembers the blood of the oppressed and the cry of the poor.",
      "comment2": "Augustine links this to the blood of the martyrs, never forgotten by God, whose cry is heard in His heavenly Zion (Enarr. Ps. 9.11–12)."
    },
    {
      "name": "Mortality → Praise",
      "description": "From prayer amid death’s gates to praise in Zion’s gates",
      "lemmas": ["humilitas", "porta", "mors", "laus"],
      "startLine": 13,
      "endLine": 14,
      "comment": "The psalmist begs God to see his affliction, to raise him from the gates of death, that he may proclaim God’s praise in the gates of Zion.",
      "comment2": "Augustine sees here Christ lifting believers from death into the life of the Church, so that the praise of God replaces the silence of the grave (Enarr. Ps. 9.13–14)."
    },
    {
      "name": "Trap → Judgment",
      "description": "From nations ensnared in their own snares to God’s revealed justice",
      "lemmas": ["gens", "laqueus", "iudicium", "peccator"],
      "startLine": 15,
      "endLine": 16,
      "comment": "The nations fall into the pit they made, caught in their hidden traps; the Lord makes Himself known in judgment, ensnaring the sinner by his own works.",
      "comment2": "Augustine interprets this as sin turning back on the sinner: the trap of pride becomes the means of downfall, while God’s justice is revealed in this reversal (Enarr. Ps. 9.15–16)."
    },
    {
      "name": "Forgetting God → Eternal Loss",
      "description": "From sinners descending to hell to hope for the poor",
      "lemmas": ["peccator", "infernum", "pauper", "patientia"],
      "startLine": 17,
      "endLine": 18,
      "comment": "Sinners and nations that forget God are turned into hell, while the poor will not be forgotten and their patience will not perish forever.",
      "comment2": "Augustine highlights the contrast: forgetfulness of God leads to eternal loss, but the poor in spirit, patient in faith, are remembered unto life (Enarr. Ps. 9.17–18)."
    }
  ]
},

{
  "psalmNumber": 9,
  "category": "b",
  "themes": [
    {
      "name": "Rise Up → Human Limits",
      "description": "From God’s rising against human pride to nations learning their mortality",
      "lemmas": ["exsurgo", "iudicium", "homo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist begs God to rise so that man does not prevail, and that nations may know they are but human.",
      "comment2": "Augustine sees this as the humiliation of pride: nations are taught their weakness under God’s law (Enarr. Ps. 9.1–2B)."
    },
    {
      "name": "Distance → Oppression",
      "description": "From God’s seeming absence to the poor consumed by the proud",
      "lemmas": ["recedo", "superbia", "pauper"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The psalm laments God’s apparent distance as the proud inflame the poor and ensnare them in plots.",
      "comment2": "Augustine interprets this as the trial of faith: God seems far, but He never abandons His people (Enarr. Ps. 9.3–4B)."
    },
    {
      "name": "Boast → Defilement",
      "description": "From the sinner’s self-praise to the corruption of his ways",
      "lemmas": ["peccator", "ira", "via"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The sinner boasts in his desires and angers the Lord, refusing to seek God, walking always in defiled paths.",
      "comment2": "Augustine contrasts this with the just, who glory not in themselves but in God (Enarr. Ps. 9.5–6B)."
    },
    {
      "name": "False Security → Deceit",
      "description": "From the wicked’s claim of stability to speech filled with curses and lies",
      "lemmas": ["moveo", "maledictio", "dolus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The wicked claim they will not be moved, yet their ways are full of deceit and domination over enemies.",
      "comment2": "Augustine says their words betray them: claiming strength, they reveal corruption (Enarr. Ps. 9.7–8B)."
    },
    {
      "name": "Boast → Corruption of Tongue",
      "description": "From arrogant confidence to a mouth filled with bitterness and fraud",
      "lemmas": ["cor", "maledictio", "dolor"],
      "startLine": 9,
      "endLine": 10,
      "comment": "The wicked say in their hearts they will not be moved, but their tongues are full of curses, lies, and bitterness.",
      "comment2": "Augustine notes the contrast: the proud heart produces a corrupt tongue, which betrays the inner decay (Enarr. Ps. 9.9–10B)."
    },
    {
      "name": "Ambush → Violence",
      "description": "From hidden traps to the lion’s den awaiting the poor",
      "lemmas": ["insidiae", "leo", "pauper"],
      "startLine": 11,
      "endLine": 12,
      "comment": "The wicked sit in ambush with the wealthy, seeking to kill the innocent, like a lion lurking in his den.",
      "comment2": "Augustine applies this to the devil and his agents who hunt the innocent in secret (Enarr. Ps. 9.11–12B)."
    },
    {
      "name": "Trap → Denial",
      "description": "From snaring the poor to denying God’s sight",
      "lemmas": ["laqueus", "pauper", "obliviscor"],
      "startLine": 13,
      "endLine": 14,
      "comment": "The wicked trap the poor, bending low until he falls, while claiming God has forgotten and turned away.",
      "comment2": "For Augustine, the wicked think God does not see, but His judgment will expose their false security (Enarr. Ps. 9.13–14B)."
    },
    {
      "name": "Exalted Hand → Defender of the Poor",
      "description": "From God’s exalted hand to His defense of the orphan",
      "lemmas": ["exsurgo", "manus", "pauper"],
      "startLine": 15,
      "endLine": 16,
      "comment": "The psalmist calls for God to rise with His hand exalted, not forgetting the poor.",
      "comment2": "Augustine sees Christ’s exaltation as the lifting of God’s hand to aid the humble and forgotten (Enarr. Ps. 9.15–16B)."
    },
    {
      "name": "Vision → Aid",
      "description": "From God’s seeing toil and sorrow to becoming helper of the orphan",
      "lemmas": ["video", "dolor", "orphano"],
      "startLine": 17,
      "endLine": 18,
      "comment": "The psalmist confesses God sees the labor and pain of His people, entrusting them into His hands and aiding the orphan.",
      "comment2": "Augustine emphasizes God’s providence: He sees what men ignore, defending the weakest (Enarr. Ps. 9.17–18B)."
    },
    {
      "name": "King Forever → Humble Secured",
      "description": "From God’s eternal reign to justice for the poor against human pride",
      "lemmas": ["regno", "aeternus", "iudico"],
      "startLine": 19,
      "endLine": 20,
      "comment": "The Lord reigns forever; nations perish from His land while the poor are secured in His Kingdom.",
      "comment2": "Augustine interprets this as eschatological hope: the reign of God is eternal, and pride vanishes before His justice (Enarr. Ps. 9.19–20B)."
    },
    {
      "name": "Desire → Final Judgment",
      "description": "From the prayer of the poor to the end of human self-exaltation",
      "lemmas": ["desiderium", "pauper", "iudicium"],
      "startLine": 21,
      "endLine": 23,
      "comment": "God hears the desire of the poor and judges for the humble, so that man may no longer exalt himself upon the earth.",
      "comment2": "Augustine says this is the closing hope: God hears the hidden desires of His saints, securing them against human pride (Enarr. Ps. 9.21–23B)."
    }
  ]
},
{
  "psalmNumber": 10,
  "category": "",
  "themes": [
    {
      "name": "Trust → Flight Questioned",
      "description": "From confidence in the Lord to the temptation of fleeing like a bird",
      "lemmas": ["confido", "transvolo", "passer"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist declares trust in the Lord, rejecting the counsel of fear that urges escape while the wicked prepare their arrows.",
      "comment2": "Augustine interprets the bird’s flight as vain self-reliance: the just must not flee from trial but trust in God (Enarr. Ps. 10.1–2)."
    },
    {
      "name": "Destruction → Divine Throne",
      "description": "From the collapse of human works to the Lord enthroned in heaven",
      "lemmas": ["destruo", "templum", "sedes"],
      "startLine": 3,
      "endLine": 4,
      "comment": "When the foundations are destroyed and the just seem powerless, the Lord remains in His holy temple, reigning from heaven.",
      "comment2": "Augustine sees this as the stability of God’s reign against human ruin: His temple is unshaken though earthly works collapse (Enarr. Ps. 10.3–4)."
    },
    {
      "name": "Divine Gaze → Testing",
      "description": "From God’s eyes upon the poor to His testing of the just and wicked",
      "lemmas": ["oculus", "pauper", "interrogo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The Lord’s eyes behold the poor, His eyelids test the children of men, examining both the righteous and the wicked.",
      "comment2": "Augustine teaches that God’s scrutiny purifies the just but exposes the wicked who hate their own souls through sin (Enarr. Ps. 10.5–6)."
    },
    {
      "name": "Judgment → Equity",
      "description": "From fire and storm upon sinners to the just Lord who loves righteousness",
      "lemmas": ["pluo", "ignis", "iustus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The wicked drink a cup of fire, sulfur, and storm, while the Lord, who is just, loves righteousness and shows His face in equity.",
      "comment2": "For Augustine, the cup of the wicked is eternal punishment, but the vision of God’s face belongs to the just (Enarr. Ps. 10.7–8)."
    }
  ]
},
{
  "psalmNumber": 11,
  "category": "",
  "themes": [
    {
      "name": "Loss of Truth → Deceptive Speech",
      "description": "From the vanishing of the faithful to false words and double hearts",
      "lemmas": ["deficio", "veritas", "labium"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist laments that the holy have failed and truth has diminished, while deceitful lips and divided hearts prevail.",
      "comment2": "Augustine reads the 'double heart' as hypocrisy: speaking peace outwardly while concealing malice inwardly (Enarr. Ps. 11.1–2)."
    },
    {
      "name": "Prideful Speech → Divine Judgment",
      "description": "From boastful tongues to the Lord cutting them off",
      "lemmas": ["disperdo", "lingua", "magnifico"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The Lord will destroy deceitful lips and the arrogant tongue that boasts of self-sufficiency and rejects divine authority.",
      "comment2": "For Augustine, pride in one’s own tongue opposes the Word of God; such speech is judged and brought low (Enarr. Ps. 11.3–4)."
    },
    {
      "name": "Oppression → Divine Rising",
      "description": "From the groaning of the poor to God’s intervention for salvation",
      "lemmas": ["miseria", "pauper", "exsurgo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "God rises because of the suffering of the needy, promising to place them in safety and act faithfully on their behalf.",
      "comment2": "Augustine interprets this as Christ rising to redeem the poor in spirit, establishing them securely in salvation (Enarr. Ps. 11.5–6)."
    },
    {
      "name": "Pure Words → Preservation",
      "description": "From refined speech of the Lord to His eternal protection",
      "lemmas": ["eloquium", "purgatus", "servo"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The words of the Lord are pure, like silver tested sevenfold, and He preserves His people forever from corruption.",
      "comment2": "Augustine sees the 'sevenfold purification' as the fullness of the Spirit, guaranteeing the truth of God’s promises (Enarr. Ps. 11.7–8)."
    },
    {
      "name": "Wicked Circling → Human Exaltation",
      "description": "From the wicked surrounding to the exaltation of human pride",
      "lemmas": ["in circuitu", "impius", "altitudo"],
      "startLine": 9,
      "endLine": 9,
      "comment": "The psalm ends with the wicked strutting around, while human pride multiplies in defiance of God.",
      "comment2": "Augustine contrasts this with the faithful preserved by God: the proud exalt themselves, but the humble are safeguarded (Enarr. Ps. 11.9)."
    }
  ]
},


{
  "psalmNumber": 12,
  "category": "",
  "themes": [
    {
      "name": "Lament in Suffering",
      "description": "The psalmist's cry of despair in prolonged suffering",
      "lemmas": ["usquequo", "obliviscor", "dolor"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Repeated 'usquequo' (How long?) frames the lament"
    },
    {
      "name": "Divine Hiddenness",
      "description": "Feeling of God's absence and unanswered prayers",
      "lemmas": ["averto", "facies"],
      "startLine": 1,
      "endLine": 1,
      "comment": "The turned face (avertō faciem) motif"
    },
    {
      "name": "Enemy Threat",
      "description": "Fear of enemy triumph and gloating",
      "lemmas": ["exalto", "inimicus", "praevaleo"],
      "startLine": 3,
      "endLine": 5,
      "comment": "Enemy references escalate from line 3 to 5"
    },
    {
      "name": "Petition for Help",
      "description": "Direct requests for divine intervention",
      "lemmas": ["respicio", "exaudio", "illumino"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Imperative verbs: respice (look), exaudi (hear)"
    },
    {
      "name": "Trust Transition",
      "description": "Shift from lament to confident trust",
      "lemmas": ["misericordia", "spero"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Pivot to trust (sperāvi) in God's mercy"
    },
    {
      "name": "Promise of Praise",
      "description": "Vow to worship despite circumstances",
      "lemmas": ["exsulto", "cano", "psallo"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Threefold praise verbs: exsultō, canō, psallō"
    }
  ]
},

{
  "psalmNumber": 13,
  "category": "",
  "themes": [
    {
      "name": "Folly of Atheism",
      "description": "Condemnation of the fool who denies God's existence",
      "lemmas": ["insipiens", "cor"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Opening declaration of practical atheism"
    },
    {
      "name": "Universal Corruption",
      "description": "Description of total human depravity",
      "lemmas": ["corrumpo", "abominabilis", "studium"],
      "startLine": 2,
      "endLine": 2,
      "comment": "All humanity is corrupt in deeds"
    },
    {
      "name": "Divine Scrutiny",
      "description": "God's examination of human understanding",
      "lemmas": ["caelum", "prospicio", "intelligens", "requiro"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Heavenly perspective on human wisdom"
    },
    {
      "name": "Universal Apostasy",
      "description": "Reiteration of total human waywardness",
      "lemmas": ["declino", "inutilis"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Parallel to verse 2 emphasizing universal sin"
    },
    {
      "name": "Oppression of the Righteous",
      "description": "Warning to those who exploit God's people",
      "lemmas": ["iniquitas", "devoro", "plebs", "panis"],
      "startLine": 5,
      "endLine": 5,
      "comment": "Condemnation of social injustice"
    },
    {
      "name": "False Fear",
      "description": "Contrast between godless fear and true reverence",
      "lemmas": ["invoco", "trepido", "timor"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Irony of fearing where no fear should exist"
    },
    {
      "name": "Righteous Remnant",
      "description": "Hope for the poor who trust in the Lord",
      "lemmas": ["justus", "consilium", "inops", "spes"],
      "startLine": 7,
      "endLine": 7,
      "comment": "Contrast to the corrupt majority"
    },
    {
      "name": "Messianic Hope",
      "description": "Longing for salvation from Zion",
      "lemmas": ["sion", "salus", "israel", "captivitas", "exsulto", "laetor"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Eschatological hope for restoration"
    },
    {
      "name": "Augustine:  Interior vs exterior denial",
      "description": "The fool says in his heart what he dares not say with his tongue",
      "lemmas": ["insipiens", "cor"],
      "startLine": 1,
      "endLine": 1,
      "comment": "En. Ps. 13.2 - Interior vs exterior denial"
    }
  ]
},
{
  "psalmNumber": 14,
  "category": "",
  "themes": [
    {
      "name": "Sacred Dwelling",
      "description": "Qualifications for abiding in God's holy presence",
      "lemmas": ["habito", "requiesco", "tabernaculum", "mons"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Opening rhetorical question about divine habitation"
    },
    {
      "name": "Moral Purity",
      "description": "Ethical requirements for the worshiper",
      "lemmas": ["macula", "justus", "veritas", "dolus"],
      "startLine": 2,
      "endLine": 3,
      "comment": "Positive and negative ethical markers"
    },
    {
      "name": "Social Integrity",
      "description": "Right relationship with neighbors",
      "lemmas": ["proximus", "malum", "opprobrium", "juro"],
      "startLine": 3,
      "endLine": 6,
      "comment": "Triple repetition of 'proximo' emphasizes social ethics"
    },
    {
      "name": "Financial Righteousness",
      "description": "Economic ethics as worship requirement",
      "lemmas": ["pecunia", "usura", "munus", "innocens"],
      "startLine": 7,
      "endLine": 7,
      "comment": "Prohibition of exploitative financial practices"
    },
    {
      "name": "Theological Foundation",
      "description": "Fear of the Lord as basis for ethics",
      "lemmas": ["malignus", "timeo", "glorifico", "dominus"],
      "startLine": 5,
      "endLine": 5,
      "comment": "Central theological affirmation"
    },
    {
      "name": "Eternal Stability",
      "description": "Promise of unshakable righteousness",
      "lemmas": ["aeternus", "moveo", "facio"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Climactic promise of permanence"
    }
  ]
},



{
  "psalmNumber": 15,
  "category": "",
  "themes": [
    {
      "name": "Refuge → Covenant",
      "description": "Taking refuge in God through covenantal declaration",
      "lemmas": ["conservo", "spero", "dico", "deus", "egeo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Cry for preservation (conserva) leads to confession of divine sufficiency (non eges)"
    },
    {
      "name": "Blessing → Suffering",
      "description": "Divine fulfillment amidst human frailty",
      "lemmas": ["sanctus", "mirifico", "voluntas", "infirmitas", "accelero"],
      "startLine": 3,
      "endLine": 4,
      "comment": "God's wonder (mirificavit) in saints contrasts with multiplied sufferings (infirmitates)"
    },
    {
      "name": "Rejection → Inheritance",
      "description": "Renouncing idolatry for divine portion",
      "lemmas": ["congrego", "sanguis", "memor", "pars", "hereditas", "calix", "restituo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Refusing pagan assemblies (conventicula) to claim the Lord as inheritance (pars haereditatis)"
    },
    {
      "name": "Boundaries → Instruction",
      "description": "Secure inheritance enabling spiritual discernment",
      "lemmas": ["funis", "cado", "praeclarus", "benedico", "tribuo", "intellectus", "increpo", "ren"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Pleasant boundaries (funes) precede divine instruction (intellectum) and conscience (renes)"
    },
    {
      "name": "Presence → Joy",
      "description": "Constant awareness of God producing embodied hope",
      "lemmas": ["provideo", "dexter", "commoveo", "laetor", "exsulto", "requiesco", "spes"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Setting God always before (Providebam) results in unshakable joy (laetatum) and rest (requiescet)"
    },
    {
      "name": "Resurrection → Fullness",
      "description": "Hope beyond death leading to eternal delight",
      "lemmas": ["derelinquo", "infernus", "corruptio", "notus", "via", "vita", "adimpleo", "laetitia", "delectatio"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Abandonment avoided (non derelinques) opens to paths of life (vias vitae) and joy (laetitia)"
    },

    {
      "name": "Augustine: Christ the Holy One",
      "description": "Christ as the true referent of 'sanctum tuum'",
      "lemmas": ["sanctus", "corruptio"],
      "startLine": 11,
      "endLine": 11,
      "comment": "Christ's body did not see corruption (Enarrationes in Psalmos 15:10)"
    },
    {
      "name": "Augustine: The Cup of the Lord",
      "description": "Eucharistic participation in Christ's passion",
      "lemmas": ["calix"],
      "startLine": 6,
      "endLine": 6,
      "comment": "The cup (calicis) signifies sharing in Christ's suffering (Sermon 213.8)"
    },
    {
      "name": "Augustine: The Nightly Examination",
      "description": "Conscience as divine instruction in the dark night",
      "lemmas": ["increpo", "ren"],
      "startLine": 8,
      "endLine": 8,
      "comment": "The kidneys (renes) represent the inner self being schooled by God (Enarr. 15.8)"
    },
    {
      "name": "Augustine: The Paths of Life",
      "description": "Christ as the way to the Father's presence",
      "lemmas": ["via", "vita", "vultus"],
      "startLine": 12,
      "endLine": 12,
      "comment": "The paths (vias) lead to the vision of God's face (vultu tuo) (Conf. IX.4)"
    },
    {
      "name": "Augustine: The Whole Christ",
      "description": "Corporate identity of Christ with His Church",
      "lemmas": ["sanctus", "cor", "lingua", "caro"],
      "startLine": 9,
      "endLine": 11,
      "comment": "Christ speaks through His members: heart, tongue and flesh (Enarr. 15:9)"
    }
  ]
},

{
  "psalmNumber": 16,
  "category": "",
  "themes": [
    {
      "name": "Judicial Prayer",
      "description": "Appeal for divine justice and sincere hearing",
      "lemmas": ["exaudio", "justitia", "deprecatio", "dolosus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Opening cry for God's just hearing of sincere prayer"
    },
    {
      "name": "Divine Examination",
      "description": "God's scrutiny proving the psalmist's righteousness",
      "lemmas": ["probo", "visito", "examino", "iniquitas"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Nightly testing by fire revealing no iniquity"
    },
    {
      "name": "Covenant Commitment",
      "description": "Obedience to God's words on difficult paths",
      "lemmas": ["custodio", "via", "durus", "perficio"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Commitment to keep God's commands despite hardship"
    },
    {
      "name": "Confident Intercession",
      "description": "Assurance in God's saving mercy",
      "lemmas": ["clamo", "exaudio", "mirifico", "salvus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Past answered prayers motivating new requests"
    },
    {
      "name": "Divine Protection",
      "description": "Sheltering presence amid danger",
      "lemmas": ["pupilla", "umbra", "ala", "protego"],
      "startLine": 9,
      "endLine": 11,
      "comment": "Apple-of-eye protection under God's wings"
    },
    {
      "name": "Lion-like Enemies",
      "description": "Proud adversaries surrounding the righteous",
      "lemmas": ["impius", "circumdo", "superbia", "leo"],
      "startLine": 12,
      "endLine": 14,
      "comment": "Arrogant foes ambushing like lions in hiding"
    },
    {
      "name": "Eschatological Hope",
      "description": "Final deliverance and divine satisfaction",
      "lemmas": ["eripio", "gloria", "satiabor", "appareo"],
      "startLine": 15,
      "endLine": 19,
      "comment": "Confidence in ultimate rescue and glory"
    },

    {
      "name": "Augustine: Christ the Just One",
      "description": "Christ as the true righteous sufferer",
      "lemmas": ["justitia", "examinasti"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Christ's perfect justice in his passion (Enarrationes 16.4)"
    },
    {
      "name": "Augustine: The Purifying Fire",
      "description": "Divine examination as sanctification",
      "lemmas": ["igne", "visito"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Nightly visitation signifies God's refining grace (Sermon 29.2)"
    },
    {
      "name": "Augustine: The Church as Pupil",
      "description": "Ecclesial identity in God's protective gaze",
      "lemmas": ["pupillam"],
      "startLine": 9,
      "endLine": 9,
      "comment": "Church as apple of God's eye protected in Christ (Enarr. 16.9)"
    },
    {
      "name": "Augustine: The Shadow of the Cross",
      "description": "Wings as cruciform protection",
      "lemmas": ["alarum"],
      "startLine": 10,
      "endLine": 10,
      "comment": "Wings' shadow prefigures shelter of Christ's cross (De Civitate Dei XVII.16)"
    },
    {
      "name": "Augustine: The Swelling of Pride",
      "description": "Enemies' fatness as spiritual arrogance",
      "lemmas": ["adipem", "superbia"],
      "startLine": 12,
      "endLine": 12,
      "comment": "Fatness symbolizes pride blinding the wicked (Enarr. 16.12)"
    },
    {
      "name": "Augustine: The Final Satisfaction",
      "description": "Eternal fulfillment in God's presence",
      "lemmas": ["satiabor", "gloria"],
      "startLine": 19,
      "endLine": 19,
      "comment": "Ultimate satisfaction in the beatific vision (Conf. XIII.15)"
    }
  ]
},

{
  "psalmNumber": 17,
  "category": "a",
  "themes": [
    {
      "name": "Divine Refuge Triad",
      "description": "Threefold declaration of God as strength, fortress, and deliverer",
      "lemmas": ["diligo", "firmamentum", "refugium", "liberator"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The opening establishes personal devotion through possessive pronouns (mea/meum)"
    },
    {
      "name": "Compound Divine Titles",
      "description": "Six roles of God declared in rapid succession",
      "lemmas": ["deus", "adjutor", "protector", "cornu", "susceptor", "spero"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Includes future hope ('sperabo') and salvation metaphor ('cornu salutis')"
    },
    {
      "name": "Praise Amid Peril",
      "description": "Worship contrasted with mortal danger",
      "lemmas": ["laudo", "invoco", "dolor", "torrens", "conturbo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Future safety promised ('salvus ero') while surrounded by death's pains"
    },

    {
      "name": "Snares of Death",
      "description": "Fourfold perfect-tense siege by mortality",
      "lemmas": [
        "circumdo",  
        "conturbo",  
        "praeoccupo", 
        "clamo"      
      ],
      "startLine": 6,  
      "endLine": 8,
      "comment": "Three passive perfects (circumdederunt...praeoccupaverunt) show death's total claim, answered by one active perfect (clamavi). Augustine reads this as Christ's descent into hell (En. Ps. 17.8) where 'death's snares' become Christ's victory trophies (Sermon 120.3)."
    },
    
    {
      "name": "Theophany Response",
      "description": "Cosmic reaction to divine hearing",
      "lemmas": ["exaudio", "tremesco", "fundamentum", "mons"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Earth shakes when God's ear is attentive to human cries"
    },
    {
      "name": "Smoke and Fire Wrath",
      "description": "Divine anger manifested elementally",
      "lemmas": ["fumus", "ignis", "irascor", "exardesco"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Classic theophany elements signaling God's judicial presence"
    },
    {
      "name": "Cosmic Descent",
      "description": "God bending heaven to intervene",
      "lemmas": ["inclino", "coelum", "descendo", "caligo"],
      "startLine": 13,
      "endLine": 14,
      "comment": "Darkness under feet contrasts with earlier fire imagery"
    },
    {
      "name": "Cherubic Flight",
      "description": "Divine mobility and hidden presence",
      "lemmas": ["cherub", "volo", "tenebrae", "tabernaculum"],
      "startLine": 15,
      "endLine": 16,
      "comment": "Double 'volavit' emphasizes swift movement to rescue"
    },
    {
      "name": "Storm Artillery",
      "description": "Hail and fire as divine weapons",
      "lemmas": ["grando", "carbo", "intono", "sagitta"],
      "startLine": 19,
      "endLine": 22,
      "comment": "Projectiles scatter enemies while revealing creation's foundations"
    },
    {
      "name": "Personal Rescue Narrative",
      "description": "First-person account of deliverance",
      "lemmas": ["eripio", "inimicus", "potens", "latitudo"],
      "startLine": 25,
      "endLine": 28,
      "comment": "From many waters to broad place - spatial salvation imagery"
    },
    {
      "name": "Covenant Righteousness",
      "description": "Reciprocal justice based on obedience",
      "lemmas": ["retribuo", "justitia", "puritas", "immaculatus"],
      "startLine": 29,
      "endLine": 34,
      "comment": "Double 'retribuet' frames ethical section closing the psalm"
    },
    {
      "name": "Augustine: Baptismal Victory",
      "description": "Waters of death becoming salvation",
      "lemmas": ["aqua", "eripio", "inimicus", "latitudo"],
      "startLine": 24,
      "endLine": 28,
      "comment": "'De aquis multis' as both threat and means of grace (Enarrationes 17.2)"
    },
    {
      "name": "Augustine: Twofold Retribution",
      "description": "Divine justice mirroring human purity",
      "lemmas": ["retribuo", "manus", "justitia", "oculus"],
      "startLine": 29,
      "endLine": 34,
      "comment": "'Secundum puritatem manuum' reflects God's gaze (City of God XX.22)"
    },
    {
      "name": "Augustine: Christ the Cherub",
      "description": "Flying on wings of incarnation",
      "lemmas": ["cherub", "volo", "tabernaculum"],
      "startLine": 15,
      "endLine": 16,
      "comment": "Divine flight signifies Christ's descent in flesh (Sermon 198.3)"
    },
    {
      "name": "Augustine: Wrath as Love's Fire",
      "description": "Purifying anger against evil",
      "lemmas": ["ignis", "ira", "carbones"],
      "startLine": 11,
      "endLine": 12,
      "comment": "God's wrath is love refusing compromise with sin (Conf. I.12)"
    }
  ]
},

{
  "psalmNumber": 17,
  "category": "b",
  "themes": [
    {
      "name": "Ethical Reciprocity",
      "description": "God's mirrored response to human character",
      "lemmas": ["sanctus", "innocens", "electus", "perverto"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Chiastic structure showing divine correspondence"
    },
    {
      "name": "Social Reversal",
      "description": "Divine preference for the humble",
      "lemmas": ["humilis", "salvus", "superbus", "humilio"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Salvation for lowly vs humbling of proud"
    },
    {
      "name": "Divine Rescue and Purity",
      "description": "God's deliverance from trials and the purity of His word",
      "lemmas": ["eripio", "tentatio", "transgredior", "impollutus", "eloquium", "examino"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Combines rescue imagery with fire-tested divine words"
    },
    {
      "name": "Illumination",
      "description": "Divine light overcoming darkness",
      "lemmas": ["illumino", "lucerna", "tenebrae"],
      "startLine": 4,
      "endLine": 6,
      "comment": "Personal light imagery in midst of trial"
    },
    {
      "name": "Divine Protection",
      "description": "God as shield for the faithful",
      "lemmas": ["protector", "spero", "dominus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Exclusive protection of Yahweh"
    },
    {
      "name": "Warrior's Preparation",
      "description": "Divine equipping for battle",
      "lemmas": ["praecingo", "virtus", "immaculatus", "perficio", "cervus", "excelsum"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Feet like deer for high places"
    },
    {
      "name": "Combat Training",
      "description": "Divine instruction in warfare",
      "lemmas": ["doceo", "praelium", "arcus", "aereus", "brachium"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Hands trained for bronze bow warfare"
    },
    {
      "name": "Divine Sustenance",
      "description": "God's ongoing support in battle",
      "lemmas": ["protego", "salus", "dexter", "suscipio", "disciplina"],
      "startLine": 12,
      "endLine": 14,
      "comment": "Right hand support and firm footing"
    },
    {
      "name": "Total Victory",
      "description": "Complete domination of enemies",
      "lemmas": ["persequor", "contero", "comprehendo", "supplanto", "disperdo"],
      "startLine": 15,
      "endLine": 18,
      "comment": "Enemies crushed and tripped"
    },
    {
      "name": "Judgment Imagery",
      "description": "Reduction of foes to insignificance",
      "lemmas": ["pulvis", "ventus", "lutum", "platea"],
      "startLine": 19,
      "endLine": 20,
      "comment": "Enemies scattered like dust before wind"
    },
    {
      "name": "Royal Exaltation",
      "description": "Kingly elevation over nations",
      "lemmas": ["caput", "gens", "servio", "obedio", "contradictio"],
      "startLine": 21,
      "endLine": 22,
      "comment": "Headship over previously unknown peoples"
    },
    {
      "name": "False Allegiance",
      "description": "Insincere submission of enemies",
      "lemmas": ["alienus", "mentior", "invetero", "claudico"],
      "startLine": 23,
      "endLine": 24,
      "comment": "Foreigners' deceptive obedience"
    },
    {
      "name": "Divine Supremacy",
      "description": "Yahweh's unique power",
      "lemmas": ["vivo", "benedico", "exalto", "salus"],
      "startLine": 25,
      "endLine": 26,
      "comment": "Living God contrasted with powerless idols"
    },
    {
      "name": "Just Rule",
      "description": "Divine administration of justice",
      "lemmas": ["vindicta", "subicio", "liberator", "ira"],
      "startLine": 26,
      "endLine": 27,
      "comment": "Vengeance against unjust oppressors"
    },
    {
      "name": "Universal Praise",
      "description": "Global acknowledgment of God",
      "lemmas": ["confiteor", "natio", "psalmus", "magnifico"],
      "startLine": 28,
      "endLine": 29,
      "comment": "Thanksgiving among the nations"
    },
    {
      "name": "Davidic Covenant",
      "description": "Promise to David's lineage",
      "lemmas": ["christus", "David", "semen", "misericordia", "saeculum"],
      "startLine": 29,
      "endLine": 30,
      "comment": "Eternal mercy to anointed king"
    }
  ]
},
{
  "psalmNumber": 18,
  "category": "",
  "themes": [
    {
      "name": "Cosmic Proclamation",
      "description": "Creation's unceasing declaration of divine glory",
      "lemmas": ["caelum", "firmamentum", "eructo", "indicat"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Day/night cycle as liturgical rhythm (Augustine: En. Ps. 18.2 - 'The heavens are like preachers with unceasing voices')"
    },
    {
      "name": "Universal Revelation",
      "description": "Wordless witness reaching all creation",
      "lemmas": ["loquela", "sonus", "orbis", "verbum"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Paradox of 'speech without words' (Augustine compares to natural law in Rom 1:20)"
    },
    {
      "name": "Solar Theophany",
      "description": "Sun as bridal warrior and divine symbol",
      "lemmas": ["sol", "tabernaculum", "sponsus", "gigas"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Christological reading: Sun = Christ as bridegroom (Augustine: Sermon 7.7)"
    },
    {
      "name": "Unavoidable Radiance",
      "description": "Divine presence penetrating all reality",
      "lemmas": ["egressio", "calor", "abscondo", "summus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "God's heat as both comfort and judgment (Augustine: Conf. 1.3 - 'You were more inward than my inmost self')"
    },
    {
      "name": "Torah's Sweetness",
      "description": "Law as delight surpassing material treasures",
      "lemmas": ["lex", "dulcis", "mel", "desiderabilia"],
      "startLine": 9,
      "endLine": 12,
      "comment": "Transition from cosmic to scriptural revelation (Augustine: 'The honeycomb is the unity of the Church')"
    },
    {
      "name": "Purification Paradox",
      "description": "Hidden sins revealed by divine light",
      "lemmas": ["delictum", "occultus", "mundus", "emundo"],
      "startLine": 13,
      "endLine": 16,
      "comment": "Illumination exposing what it cleanses (Augustine: 'My sins were like wounds seen only when light comes')"
    },
    {
      "name": "Sacred Reciprocity",
      "description": "Human words answering divine revelation",
      "lemmas": ["eloquium", "meditatio", "redemptor", "servus"],
      "startLine": 17,
      "endLine": 18,
      "comment": "Closing prayer mirrors opening cosmic praise (Augustine: 'Our words are echoes of God's Word')"
    },
    {
      "name": "Augustine: Twofold Book",
      "description": "Creation and Scripture as dual revelation",
      "lemmas": ["caelum", "verbum", "lex", "testimonium"],
      "startLine": 1,
      "endLine": 12,
      "comment": "'God wrote two books: the universe and Scripture' (Gen. ad Litt. 2.5)"
    },
    {
      "name": "Augustine: Solar Christology",
      "description": "Sun imagery prefiguring incarnate Word",
      "lemmas": ["sol", "sponsus", "egressio", "calor"],
      "startLine": 5,
      "endLine": 8,
      "comment": "'Christ is the Sun of Righteousness whose heat is love' (Tract. Ev. Jo. 34.9)"
    },
    {
      "name": "Augustine: Honeycomb Ecclesiology",
      "description": "Church as purified community of delight",
      "lemmas": ["mel", "favus", "immaculatus", "meditatio"],
      "startLine": 9,
      "endLine": 18,
      "comment": "'The Church's unity is sweeter than honey' (En. Ps. 18.15)"
    }
  ]
},

{
  "psalmNumber": 19,
  "category": "",
  "themes": [
    {
      "name": "Royal Intercession",
      "description": "Divine response to the king's petitions",
      "lemmas": ["exaudio", "protego", "mitto", "tueor", "impleo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Seven imperative verbs invoking divine action"
    },
    {
      "name": "Sacrificial Favor",
      "description": "God's remembrance of royal offerings",
      "lemmas": ["sacrificium", "holocaustum", "pinguis", "memor", "confirmo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Connection between sacrifice and answered prayers"
    },
    {
      "name": "Messianic Victory",
      "description": "Anointed king's divine deliverance",
      "lemmas": ["christus", "salvus", "potentia", "dextera", "rex"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Divine salvation specifically for the anointed"
    },
    {
      "name": "Military Contrast",
      "description": "Divine power vs. human strength",
      "lemmas": ["currus", "equus", "cado", "surgo", "erigo"],
      "startLine": 7,
      "endLine": 9,
      "comment": "Chariots/horses fail vs. divine name's power"
    },
    {
      "name": "Communal Participation",
      "description": "People's shared response to salvation",
      "lemmas": ["nos", "laetor", "magnifico", "invoco", "nomen"],
      "startLine": 5,
      "endLine": 10,
      "comment": "Plural verbs emphasizing collective worship"
    },
    {
      "name": "Zion Theology",
      "description": "Jerusalem as source of divine help",
      "lemmas": ["sanctus", "Sion", "caelum", "Deus", "Jacob"],
      "startLine": 2,
      "endLine": 7,
      "comment": "Heavenly and earthly loci of divine power"
    },
    {
      "name": "Covenantal Assurance",
      "description": "Confidence in God's faithful response",
      "lemmas": ["cor", "consilium", "petitio", "tribulatio", "dies"],
      "startLine": 1,
      "endLine": 10,
      "comment": "Personal and national petitions intertwined"
    }
  ],
  "structuralNotes": {
    "movement": "From individual petitions (1-4) to communal victory (5-10)",
    "keyTransition": "Line 5's shift to first-person plural",
    "militaryPivot": "Lines 7-9's contrast between human and divine power",
    "inclusio": "Framed by 'exaudiat' (1) and 'exaudi' (10)"
  }
},

{
  "psalmNumber": 34,
  "category": "",
  "themes": [
    {
      "name": "Plea → Divine Intervention",
      "description": "The psalmist cries for God to judge and fight on his behalf against unjust enemies.",
      "lemmas": ["iudico", "expugno", "arma", "scutum", "exsurgo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Opening plea sets a legal and martial tone—justice is asked not by self-retaliation but divine advocacy."
    },
    {
      "name": "Pursuit → Salvation",
      "description": "God is invoked to halt the persecutors and declare His saving presence.",
      "lemmas": ["effundo", "framea", "persequor", "salus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine: God’s voice to the soul—'I am your salvation'—is internal assurance in external conflict (Enarr. Ps. 34.3)."
    },
    {
      "name": "Chaff → Angelic Chase",
      "description": "The wicked are driven like dust and pursued by God’s angel.",
      "lemmas": ["pulvis", "ventus", "angelus", "coarcto", "persequor"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Spiritual warfare intensifies; divine justice is swift and fearful through angelic agency."
    },
    {
      "name": "Trap → Reversal",
      "description": "Enemies set traps, but fall into them themselves.",
      "lemmas": ["laqueus", "captio", "cado", "supervacue", "exprobro"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The psalmist invokes poetic justice: their hidden snares become their own downfall."
    },
    {
      "name": "Fear → Joyful Praise",
      "description": "The soul rejoices in God’s salvation, and all the bones exult.",
      "lemmas": ["exsulto", "delector", "salutaris", "os", "similis"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Even the bones—symbol of the inner self—praise the incomparable God who saves."
    },
    {
      "name": "Powerlessness → Deliverance",
      "description": "God rescues the poor from the powerful and false witnesses.",
      "lemmas": ["eripio", "inops", "fortis", "egenus", "testis"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Social and legal vulnerability becomes the arena for divine vindication."
    },
    {
      "name": "Betrayal → Penitence",
      "description": "From soul-wounding injustice to humble intercession through fasting, sackcloth and prayer",
      "lemmas": ["retribuo", "sterilitas", "molestus",  "sinus"],
      "startLine": 13,
      "endLine": 14,
      "comment": "Augustine reads this transition as a portrait of Christ: betrayed by those He loved, He responds not with wrath but with suffering charity. The psalmist puts on sackcloth ('cilicium'), fasts ('ieiunium'), and turns his prayer inward ('sinus') — a gesture of transformation through humility (Enarr. Ps. 34.13–14; Phil 2:7)."
    },

    {
      "name": "Sackcloth → Bosom",
      "description": "From outward humility and fasting to inward, returning prayer",
      "lemmas": ["cilicium", "ieiunium", "oratio"],
      "startLine": 14,
      "endLine": 14,
      "comment": "Augustine reads 'cilicium' as the flesh Christ assumed in humility. The psalmist fasts ('jejunium') and his prayer returns 'into his bosom' ('sinus') — a gesture of interior transformation and divine charity. It prefigures Christ’s suffering intercession for others (Enarr. Ps. 34.13–14; Phil 2:7).",
      "comment2": "The psalmist fasted and mourned for others as for a brother, clothed in sackcloth (cilicium). Yet they returned his love with scorn. Augustine sees this as Christ-like charity — unrequited and redemptive. The turning of prayer into the bosom ('sinus') reflects inward forgiveness and self-offering (Enarr. Ps. 34.13–14; Phil 2:7)."

    },

    
    {
      "name": "Friendship → Scourging",
      "description": "From deep empathy and mourning to attack and mockery.",
      "lemmas": ["frater", "lugeo", "contristo", "convenerunt", "subsanno"],
      "startLine": 15,
      "endLine": 16,
      "comment": "Augustine: 'They gathered against me unrepentant'—a contrast between interior love and exterior malice (Enarr. Ps. 34.15)."
    },

    {
  "name": "Scorn → Supplication",
  "description": "From violent ridicule and gnashing hatred to a desperate plea for rescue",
  "lemmas": ["subsanno", "frendeo", "dissipo", "restituo", "leo", "unicus"],
  "startLine": 17,
  "endLine": 18,
  "comment": "Augustine sees the subsannation and frendentes dentes as the height of scorn toward Christ or the righteous soul. In response, the psalmist turns fully to God—'When will You look?'—begging rescue from a lion's mouth. 'Unicam meam' reflects the singular soul's worth, or even Christ’s unique life (Enarr. Ps. 34.17–18)."
},
    {
      "name": "Politeness → Treachery",
      "description": "From outward gestures of peace to hidden malice and deceit",
      "lemmas": ["supergaudeo", "inique", "annuo", "pacifice", "dolus"],
      "startLine": 19,
      "endLine": 20,
      "comment": "Augustine notes the enemy’s 'peaceful speech' hides an 'earth-born rage' (iracundia terrae), a hypocrisy of false friendship. The winking eye (annuunt oculis) signals betrayal, like Judas with a kiss. This duplicity wounds more than open enemies (Enarr. Ps. 34.19–20)."
    },
    
    {
      "name": "Peace → Mockery",
      "description": "From false words of peace to open gloating over suffering",
      "lemmas": ["pacifice", "iracundia", "dolus", "dilato", "euge", "oculus"],
      "startLine": 21,
      "endLine": 22,
      "comment": "Augustine sees in these verses the wicked smiling with their lips while raging in their hearts. 'Euge, euge' is their cry of triumph, mocking the just as they fall. This mirrors the Passion: Christ, betrayed by feigned friendship, faced open derision (Enarr. Ps. 34.21–22; Luke 22:48)."
    },

    {
      "name": "Injustice → Divine Advocacy",
      "description": "From unjust persecution to appeal for God’s righteous intervention",
      "lemmas": ["exsurgo", "intende", "iudicium", "causa", "iustitia", "supergaudeo"],
      "startLine": 23,
      "endLine": 24,
      "comment": "Augustine reads this as the soul calling upon God not for vengeance but for justice rooted in divine truth. The psalmist entrusts his cause ('causam meam') to God's tribunal, resisting the pride of self-defense (Enarr. Ps. 34.23–24)."
    },
    {
      "name": "Boasting → Shame",
      "description": "From hidden gloating over downfall to public shame and reversal",
      "lemmas": ["euge", "anima", "devoro", "erubesco", "confusio", "magnificor"],
      "startLine": 25,
      "endLine": 26,
      "comment": "Augustine interprets the enemy’s gloating ('devoravimus eum') as pride in persecuting the righteous—yet this triumph is hollow. The psalmist calls for their undoing: shame and confusion will clothe those who exalted themselves (Enarr. Ps. 34.25–26)."
    },
    {
      "name": "Persecution → Praise",
      "description": "From suffering among enemies to shared joy among the just",
      "lemmas": ["exsulto", "laetor", "iustitia", "magnifico"],
      "startLine": 27,
      "endLine": 28,
      "comment": "Augustine sees a final turn: not only is the soul rescued, but the just are called into praise. Peace returns through God’s justice, and the psalmist’s voice—once silenced by sorrow—now proclaims truth daily (Enarr. Ps. 34.27–28)."
    },
    {
      "name": "Praise → All Day Long",
      "description": "From voiceless affliction to all-day meditation on God's justice",
      "lemmas": ["lingua", "meditor", "iustitia", "laudo", "totus"],
      "startLine": 29,
      "endLine": 29,
      "comment": "Augustine sees 'tota die' as the seal of deliverance: the tongue, once silenced by enemies, now rejoices without interruption. Meditation becomes praise; suffering gives way to full-day worship (Enarr. Ps. 34.29)."
    }

  ]
},

{
  "psalmNumber": 47,
  "category": "",
  "themes": [
    {
      "name": "Greatness → Holy City",
      "description": "From God’s greatness to His dwelling on Zion, the joy of the whole earth",
      "lemmas": ["magnus", "mons", "civitas", "rex"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalm begins with praise of the Lord’s greatness, made visible in Mount Zion, the city of the great King. Augustine interprets Zion as the Church, exalted above the world and a sign of universal joy (Enarr. Ps. 47.1–2)."
    },
    {
      "name": "God Present → Nations Shaken",
      "description": "From God’s presence in His city to the trembling of gathered kings",
      "lemmas": ["domus", "cognosco", "rex", "conturbo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "God is known within His holy dwellings, defending His city. Earthly rulers, gathering in pride, are confounded before Him, for no power endures against His protection (Enarr. Ps. 47.3–4)."
    },
    {
      "name": "Terror → Travail",
      "description": "From astonishment of kings to the image of labor pains",
      "lemmas": ["admiro", "tremor", "parturio"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The nations behold and are seized with fear, like women in travail. Augustine reads this as the world’s powers convulsed when confronted with Christ’s resurrection and the rise of His Church (Enarr. Ps. 47.5–6)."
    },
    {
      "name": "Storm → Foundation",
      "description": "From the breaking of ships to the eternal stability of God’s city",
      "lemmas": ["spiritus", "contero", "navis", "fundamentum"],
      "startLine": 7,
      "endLine": 8,
      "comment": "As ships are shattered by a mighty wind, so earthly strength collapses before God. Yet Zion stands firm, founded forever — the eternal dwelling of the Lord (Enarr. Ps. 47.7–8)."
    },
    {
      "name": "Mercy → Praise",
      "description": "From receiving God’s mercy in the temple to worldwide proclamation of His justice",
      "lemmas": ["misericordia", "templum", "laus", "iustitia"],
      "startLine": 9,
      "endLine": 10,
      "comment": "In the midst of the temple the faithful receive God’s mercy. His name and praise extend to the ends of the earth, His right hand full of justice — Christ’s redeeming power made manifest (Enarr. Ps. 47.9–10)."
    },
    {
      "name": "Joy → Witness",
      "description": "From Zion’s gladness to the charge to tell future generations",
      "lemmas": ["laetitia", "iudicium", "turris", "progenies"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Zion rejoices in God’s judgments, and her towers are to be recounted as testimony. Augustine sees the Church’s witness as a lasting proclamation to all generations (Enarr. Ps. 47.11–12)."
    },
    {
      "name": "Strength → Eternal Shepherd",
      "description": "From reflecting on Zion’s strength to God’s everlasting reign",
      "lemmas": ["virtus", "domus", "saeculum", "rego"],
      "startLine": 13,
      "endLine": 14,
      "comment": "The faithful are called to ponder Zion’s strength, for it proclaims God’s eternal reign. Augustine identifies this ruler as Christ, the shepherd who guides His people forever (Enarr. Ps. 47.13–14)."
    }
  ]
},

{
  "psalmNumber": 50,
  "category": "",
  "themes": [
    {
      "name": "Penitence",
      "description": "Recognition and contrition for sin",
      "lemmas": ["misereor", "peccatum", "iniquitas", "cognosco", "contra"],
      "startLine": 1,
      "endLine": 5,
      "comment": "David's confession begins with a plea for mercy (*misereor*) and acknowledges sin (*peccatum*, *iniquitas*)"
    },
    {
      "name": "Divine Mercy",
      "description": "Appeals to God's compassionate nature",
      "lemmas": ["misericordia", "miseratio", "deleo", "lavo", "mundo"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Mercy is rooted in God's nature (*misericordia*) and enacted through cleansing (*lava*, *deleo*)"
    },
    {
      "name": "Purification",
      "description": "Ritual and spiritual cleansing",
      "lemmas": ["aspergo", "hyssopus", "mundo", "lavo", "dealbo"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Hyssop symbolizes purification; washing metaphors (*lavabis*) transcend ritual"
    },
    {
      "name": "Heart Transformation",
      "description": "Request for inner renewal",
      "lemmas": ["cor", "innovo", "spiritus", "rectus", "crea"],
      "startLine": 11,
      "endLine": 12,
      "comment": "A new heart (*cor mundum*) and spirit (*spiritum rectum*) are God's work"
    },
    {
      "name": "True Sacrifice",
      "description": "Contrition over ritual offerings",
      "lemmas": ["sacrificium", "contribulo", "holocaustum", "despicio", "contritus"],
      "startLine": 17,
      "endLine": 18,
      "comment": "God rejects empty sacrifices (*holocaustis*) but accepts a broken spirit (*spiritus contribulatus*)"
    },
    {
      "name": "Restoration",
      "description": "Renewal of joy and mission",
      "lemmas": ["reddo", "laetitia",  "docebo", "exsulto"],
      "startLine": 13,
      "endLine": 16,
      "comment": "Forgiveness restores joy (*laetitiam*) and enables teaching (*docebo*)"
    },
    {
      "name": "Augustine: True Penance",
      "description": "Self-knowledge and humility in confession",
      "lemmas": ["cognosco", "contra", "humiliata", "veritatem", "visceribus"],
      "startLine": 4,
      "endLine": 11,
      "comment": "Augustine emphasizes truth (*veritatem*) and humility (*humiliata*) as prerequisites for mercy"
    },
    {
      "name": "Augustine: Hyssop of Humility",
      "description": "Purification through lowliness",
      "lemmas": ["hyssopus", "aspergo", "humilio", "dealbo"],
      "startLine": 8,
      "endLine": 9,
      "comment": "Hyssop cleanses because it signifies humility (*ossa humiliata*)"
    },
    {
      "name": "Augustine: Spiritual Sacrifice",
      "description": "Contrite heart as true worship",
      "lemmas": ["spiritus", "contribulo", "contritus", "holocaustum"],
      "startLine": 17,
      "endLine": 18,
      "comment": "Rejects ritual (*holocaustis*) for inward sacrifice (*spiritus contribulatus*)"
    },
    {
      "name": "Augustine: City of God",
      "description": "Jerusalem as the redeemed community",
      "lemmas": ["sion", "jerusalem", "aedifico", "altare", "vitulus"],
      "startLine": 19,
      "endLine": 20,
      "comment": "The rebuilding of Jerusalem (line 19) and altar offerings (line 20) prefigure the Church (cf. *City of God*, XVII)"
    }
  ]
},


{
  "psalmNumber": 56,
  "category": "",
  "themes": [
    {
      "name": "Speech → Iniquity",
      "description": "Contrast between professed justice and practiced wickedness",
      "lemmas": ["justitia", "loquor", "iniquitas", "operor"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine: 'Loquimini justitiam' vs 'in corde iniquitates' shows tongue-heart divide (Enarrationes 56.2)"
    },
    {
      "name": "Womb → Error",
      "description": "Sin's origin from conception",
      "lemmas": ["vulva", "uterus", "alieno", "erro"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Augustine: 'Ab utero' confirms original sin's transmission (De Peccatorum Meritis I.9)"
    },
    {
      "name": "Ears → Obstinacy",
      "description": "Willful rejection of truth",
      "lemmas": ["auris", "obturo", "surdus", "aspis"],
      "startLine": 4,
      "endLine": 5,
      "comment": "Augustine: Deaf adder symbolizes unrepentant soul (Sermon 76.5)"
    },
    {
      "name": "Teeth → Judgment",
      "description": "Divine dismantling of evil's instruments",
      "lemmas": ["dens", "contero", "os", "leo"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Augustine: Crushed teeth signify broken power to harm (Enarrationes 56.8)"
    },
    {
      "name": "Wax → Purification",
      "description": "Transience of wickedness before divine fire",
      "lemmas": ["cera", "fluo", "ignis", "sol"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine: Melting wax represents sinners before God's light (Confessions XIII.15)"
    },
    {
      "name": "Blood → Vindication",
      "description": "Righteous celebration of divine justice",
      "lemmas": ["sanguis", "lavo", "justus", "vindicta"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Augustine: 'Lavabit in sanguine' symbolizes participation in Christ's victory (City of God XVII.7)"
    },
    {
      "name": "Augustine: Cor Duplex",
      "description": "Heart's division between truth and iniquity",
      "lemmas": ["cor", "loquor", "justitia", "iniquitas"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Tension between 'loquimini justitiam' and 'in corde iniquitates' (De Trinitate XIV.17)"
    },
    {
      "name": "Augustine: Serpens Aures",
      "description": "Spiritual deafness as primal sin",
      "lemmas": ["aspis", "obturo", "surdus", "erro"],
      "startLine": 4,
      "endLine": 5,
      "comment": "Echo of Adam's willful disobedience (De Genesi contra Manichaeos II.15)"
    },
    {
      "name": "Augustine: Ignis Illustratio",
      "description": "Fire as divine truth exposing evil",
      "lemmas": ["ignis", "sol", "cera", "nihilum"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Sinners' impermanence revealed by God's light (Enarrationes 56.12)"
    }
  ]
},


{
  "psalmNumber": 62,
  "category": "",
  "themes": [
    {
      "name": "Soul's Thirst",
      "description": "Intense spiritual longing for God's presence.",
      "lemmas": ["sitio", "adhaereo", "anima", "desertus"],
      "startLine": 1,
      "endLine": 3,
      "comment": "Desert imagery emphasizing spiritual thirst"
    },
    {
      "name": "Divine Refuge",
      "description": "God as protector and sustainer.",
      "lemmas": ["adjutor", "velamen", "dextera", "suscipio"],
      "startLine": 7,
      "endLine": 9,
      "comment": "Wing and hand imagery for protection"
    },
    {
      "name": "Sacred Praise",
      "description": "Wholehearted worship in all circumstances.",
      "lemmas": ["laudo", "benedico", "exsulto", "juro"],
      "startLine": 4,
      "endLine": 12,
      "comment": "Praise from dawn to dark"
    },
    {
      "name": "Divine Justice",
      "description": "God's judgment on the wicked.",
      "lemmas": ["gladius", "vulpes", "iniquus", "obstruo"],
      "startLine": 10,
      "endLine": 12,
      "comment": "Contrast between faithful and wicked"
    },
    {
      "name": "Royal Vindication",
      "description": "The king's joy in God's justice.",
      "lemmas": ["rex", "laetor", "juro", "obstruo"],
      "startLine": 12,
      "endLine": 12,
      "comment": "Messianic undertones"
    }
  ]
},
{
  "psalmNumber": 63,
  "category": "",
  "themes": [
    {
      "name": "Cry for Help",
      "description": "The psalmist urgently pleads for God's intervention against enemies.",
      "lemmas": ["exaudio", "deprecor", "eripio", "timore"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Immediate plea for divine rescue from danger."
    },
    {
      "name": "Divine Protection",
      "description": "God's shielding power against hostile forces.",
      "lemmas": ["protego", "conventus", "malignus", "multitudo"],
      "startLine": 2,
      "endLine": 2,
      "comment": "God's defense against collective evil."
    },
    {
      "name": "Enemy Weapons",
      "description": "The dangerous arsenal of adversaries including words and projectiles.",
      "lemmas": ["gladius", "lingua", "arcus", "sagitta", "laqueus"],
      "startLine": 3,
      "endLine": 6,
      "comment": "Metaphorical and literal weapons used against the righteous."
    },
    {
      "name": "Failed Schemes",
      "description": "The enemies' plans ultimately fail despite their efforts.",
      "lemmas": ["scrutor", "deficio", "conturbo", "infirmo"],
      "startLine": 7,
      "endLine": 10,
      "comment": "Divine reversal of evil plans through exposure and weakness."
    },
    {
      "name": "Righteous Vindication",
      "description": "The just are ultimately rewarded and God is glorified.",
      "lemmas": ["justus", "laetor", "spero", "laudo", "rectus"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Final triumph of the faithful and recognition of God's works."
    },
    {
      "name": "Divine Exaltation",
      "description": "God is ultimately lifted up as the righteous take refuge in Him.",
      "lemmas": ["exalto", "cor", "altum", "annuntio"],
      "startLine": 8,
      "endLine": 12,
      "comment": "Theological climax where God's supremacy is revealed."
    }
  ]
},

{
  "psalmNumber": 64,
  "category": "",
  "themes": [
    {
      "name": "Sacred Worship",
      "description": "Proper praise and vows to God in holy places.",
      "lemmas": ["hymnus", "votum", "sanctus", "templum"],
      "startLine": 1,
      "endLine": 5,
      "comment": "Focus on liturgical elements in Jerusalem"
    },
    {
      "name": "Cosmic Power",
      "description": "God's control over nature and nations.",
      "lemmas": ["virtus", "potentia", "conturbo", "praeparo"],
      "startLine": 7,
      "endLine": 9,
      "comment": "Theophanic imagery of mountains and seas"
    },
    {
      "name": "Agricultural Blessing",
      "description": "Divine provision through abundant harvests.",
      "lemmas": ["repleo", "fructus", "uber", "frumentum", "germino"],
      "startLine": 10,
      "endLine": 15,
      "comment": "Celebration of fertility and abundance"
    },
    {
      "name": "Prayer Dynamics",
      "description": "Human petitions and divine responses.",
      "lemmas": ["exaudio", "oratio", "propitior", "visito"],
      "startLine": 1,
      "endLine": 10,
      "comment": "Pattern of invocation and answer"
    },
    {
      "name": "Eschatological Joy",
      "description": "Creation's ultimate rejoicing in God.",
      "lemmas": ["laetor", "exsultatio", "hymnus", "clamo"],
      "startLine": 12,
      "endLine": 15,
      "comment": "Creation personified in celebration"
    }
  ]
},

{
  "psalmNumber": 66,
  "category": "",
  "themes": [
    {
      "name": "Divine Face Metaphor",
      "description": "God's countenance shining upon His people",
      "lemmas": ["vultus", "illumino", "super"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Illuminet vultum suum super nos - classic biblical metaphor for divine favor"
    },
    {
      "name": "Agricultural Blessings",
      "description": "Earth's fruitfulness as divine blessing",
      "lemmas": ["terra", "fructus", "benedico"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Terra dedit fructum suum - personification of earth yielding its produce"
    },
    {
      "name": "Universal Worship",
      "description": "All nations called to praise God",
      "lemmas": ["omnis", "gens", "populus", "confiteor"],
      "startLine": 3,
      "endLine": 5,
      "comment": "Repeated calls for global confession and praise"
    },
    {
      "name": "Divine Guidance",
      "description": "God's direction of nations and individuals",
      "lemmas": ["via", "dirigo", "salutare"],
      "startLine": 2,
      "endLine": 4,
      "comment": "Judging peoples with equity and guiding nations"
    },
    {
      "name": "Cosmic Benediction",
      "description": "Global scope of God's blessing",
      "lemmas": ["finis", "terra", "metuo"],
      "startLine": 7,
      "endLine": 7,
      "comment": "Omnes fines terrae - hyperbolic expression of universal reverence"
    },
    {
      "name": "Joyful Judgment",
      "description": "Righteous rule producing celebration",
      "lemmas": ["laetor", "exsulto", "judico", "aequitas"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Paradox of nations rejoicing under divine judgment"
    },
    {
      "name": "Liturgical Blessing",
      "description": "Priestly benediction structure",
      "lemmas": ["misereor", "benedico", "illumino"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Mirrors Aaronic blessing (Numbers 6:24-26)"
    },
    {
      "name": "Ecological Obedience",
      "description": "Earth's response to divine will",
      "lemmas": ["terra", "fructus", "dedit"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Personification of creation fulfilling its purpose"
    }
  ]
},


{
  "psalmNumber": 75,
  "category": "",
  "themes": [
    {
      "name": "Known → Dwelt",
      "description": "God’s identity, once proclaimed among Judah, becomes presence—He now dwells among His people in Zion.",
      "lemmas": ["notus", "deus", "judaea", "israel", "nomen", "pax", "locus", "habitatio", "sion"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine: God is not merely known, but has made a peaceful home among His people. Recognition matures into relationship (Enarr. Ps. 75.1).",
      "comment2": "The psalm’s journey begins with the movement from public knowledge to relational presence—God is not just confessed, but dwelling."
    },
    {
      "name": "War → Wonder",
      "description": "Weapons are shattered and war ceases; God's light dawns from the eternal hills.",
      "lemmas": ["confringo", "arcus", "gladius", "scutum", "bellum", "illumino", "montes", "aeternus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine: The hills ‘aeterni’ represent divine peace. The God who shatters weapons offers not retaliation but revelation (Enarr. Ps. 75.3–4).",
      "comment2": "This is the psalm’s second step: violence is answered by light, fear by awe—war gives way to wonder."
    },
    {
      "name": "Pride → Powerlessness",
      "description": "The arrogant are reduced to sleep and silence by divine rebuke.",
      "lemmas": ["insipiens", "turbo", "dormio", "somnus", "divitiae", "increpatio", "equus"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine: Sleep here is judgment, not rest. The self-reliant fall powerless at God's rebuke (Enarr. Ps. 75.5–6).",
      "comment2": "A humbling phase in the psalm's movement—earthly pride is unseated to prepare for true reverence."
    },
    {
      "name": "Wrath → Silence",
      "description": "God's judgment silences even the earth—wrath gives way to sacred stillness.",
      "lemmas": ["terribilis", "ira", "judicium", "resisto", "tremo", "quiesco"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine: Divine wrath makes the whole earth tremble and then still—‘quievit terra’ signals reverence and awe (Enarr. Ps. 75.7–8).",
      "comment2": "This transition shifts from divine anger to cosmic stillness—wrath yields to quiet readiness for worship."
    },
    {
      "name": "Judgment → Festival",
      "description": "God rises to save the meek, and human thoughts are transformed into festal worship.",
      "lemmas": ["exsurgo", "judicium", "salvus", "mansuetus", "cogitatio", "confiteor", "reliquiae", "festus", "dies"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Augustine: The ‘reliquiae cogitationis’ are those thoughts that remain after judgment—redeemed and turned to praise (Enarr. Ps. 75.10).",
      "comment2": "The psalm’s arc completes here: from judgment to joy. The final word is celebration—worship from those God has saved."
    }
  ]
},



{
  "psalmNumber": 87,
  "category": "",
  "themes": [
    {
      "name": "Day/Night Cry → Unanswered Prayer",
      "description": "Persistent prayer meets divine silence",
      "lemmas": ["clamo", "dies", "nox", "oratio", "precem"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine reads the day/night contrast as the psalmist's unceasing prayer (Rom 12:12), yet God's ear seems un-inclined. This mirrors Christ's cry on the cross—the righteous may endure seasons where heaven seems silent, yet still call faithfully."
    },
    {
      "name": "Life → Brink of Sheol",
      "description": "The soul's descent into death's dominion",
      "lemmas": ["vita", "infernum", "lacus", "aestimo", "descendo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine allegorizes this as the soul's despair when grace feels absent. 'Counted among those who go down' reflects our solidarity with fallen humanity. The paradox of 'free among the dead' suggests the righteous suffer like all mortals, yet retain hope's freedom even in darkness."
    },
    {
      "name": "Divine Memory → Divine Rejection",
      "description": "From being forgotten to being actively repelled",
      "lemmas": ["memor", "repello", "manus", "sepulcrum", "vulnero"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine sees here the terror of reprobation—when God's hand no longer sustains but pushes away. The 'wounded sleeping in tombs' represent souls dead in sin, unaware of their peril until divine judgment awakens them."
    },
    {
      "name": "Human Companionship → Utter Isolation",
      "description": "From community to abhorred outcast",
      "lemmas": ["notus", "longe", "abominatio", "fluctus", "furor"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine compares this to Christ's abandonment by disciples. The 'waves' are adversities permitted by God; the 'abomination' reflects how the righteous become offensive to the worldly when suffering reveals their fragility."
    },
    {
      "name": "Vision → Blindness",
      "description": "Eyes fail as poverty overwhelms",
      "lemmas": ["oculus", "languo", "inopia", "trado", "egredior"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Augustine reads this as spiritual blindness—when distress dims the soul's vision of God. The 'spread hands' gesture mirrors Christ on the cross, showing prayer persists even when strength fails."
    },
    {
      "name": "Miracles → Grave's Silence",
      "description": "God's wonders seem absent in death's realm",
      "lemmas": ["mirabilis", "sepulcrum", "mortuus", "medicus", "suscito"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Augustine notes these rhetorical questions find their answer in Christ's resurrection. The 'physicians' (law/works) cannot raise the dead—only grace can. The grave's silence precedes Easter's dawn."
    },
    {
      "name": "Mercy/Truth → Land of Oblivion",
      "description": "Divine attributes seem negated by death's oblivion",
      "lemmas": ["misericordia", "veritas", "perditio", "oblivio", "tenebrae"],
      "startLine": 13,
      "endLine": 13,
      "comment": "Augustine sees this as the soul's darkest trial—when God's promises seem void amid suffering. Yet this very cry becomes, in Christ, the 'Eloi' moment that precedes resurrection (Mk 15:34)."
    },
    {
      "name": "Rejection → Relentless Prayer",
      "description": "Divine hiddenness met with dogged supplication",
      "lemmas": ["repello", "facies", "clamo", "mane", "oratio"],
      "startLine": 14,
      "endLine": 15,
      "comment": "Augustine observes how the psalmist, like Job, argues with God rather than disengages. 'Morning prayer' signifies hope persisting through night—the discipline of seeking God's face even when He seems to avert it."
    },
    {
      "name": "Youthful Labor → Aged Desolation",
      "description": "A life of suffering culminates in final turmoil",
      "lemmas": ["juventus", "labor", "exalto", "humilio", "conturbo"],
      "startLine": 16,
      "endLine": 17,
      "comment": "Augustine reads this as the soul's lifelong battle with concupiscence—the 'exaltation' of pride followed by crushing humiliations. The 'terrors' are ultimately medicinal, driving us to grace."
    },
    {
      "name": "Solitude → Encircling Flood",
      "description": "Isolation gives way to overwhelming assault",
      "lemmas": ["aqua", "circumdo", "dies", "ira", "terror"],
      "startLine": 18,
      "endLine": 18,
      "comment": "Augustine interprets the encircling waters as both external persecutions and internal temptations. Yet this flood, like Noah's, carries the sufferer to God's new creation—the very waves that seem to destroy become the path to salvation."
    }
  ]
},
{
  "psalmNumber": 89,
  "category": "",
  "themes": [
    {
      "name": "Time → Eternity",
      "description": "From generational life to God's timeless refuge",
      "lemmas": ["refugium", "generatio", "progenies", "saeculum"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine emphasizes that God's eternity stands outside all generations. While humans come and go, God remains constant: 'a saeculo et usque in saeculum tu es'. He sees this as a comfort and a warning — our only lasting refuge is found outside time, in God Himself."
    },
    {
      "name": "Pride → Repentance",
      "description": "Human fall reversed through conversion",
      "lemmas": ["humilitas", "converto", "averto", "filius"],
      "startLine": 3,
      "endLine": 4,
      "comment": "When God says 'Convertimini, filii hominum,' Augustine hears the voice of mercy calling fallen humanity home. The 'return' is not geographical but spiritual — turning from pride to humility. He links this to Adam's exile and the lifelong journey of conversion for every soul."
    },
    {
      "name": "Years → Nothingness",
      "description": "A thousand years dissolve in divine light",
      "lemmas": ["mille", "dies", "custodia", "nihil"],
      "startLine": 4,
      "endLine": 5,
      "comment": "To Augustine, 'mille anni... tamquam dies hesterna' illustrates God's eternity more than human brevity. The contrast reveals how God sees history in a single glance. Augustine says human pride in longevity is shattered by this — for to God, all time is as nothing unless filled with love."
    },
    {
      "name": "Flourishing → Fading",
      "description": "Life’s morning beauty withers by evening",
      "lemmas": ["mane", "herba", "floreo", "vesper", "aresco"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Augustine compares the morning grass to the person who flourishes outwardly — perhaps in beauty or power — but has no deep root in charity. Like Christ’s parable of the sower, they spring up quickly and wither when trial comes. Only love makes the soul endure the heat of the day."
    },
    {
      "name": "Wrath → Illumination",
      "description": "Divine anger met by the light of His face",
      "lemmas": ["ira", "furor", "iniquitas", "illuminatio", "vultus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine says God's wrath isn't like human passion, but His just judgment. Yet even as He exposes iniquity, His 'illumination' is healing. He calls the face of God 'that which enlightens and reforms the heart' — wrath convicts, but the light restores."
    },
    {
      "name": "Span → Spiderweb",
      "description": "Human years dissolve into fragile thought",
      "lemmas": ["dies", "aranea", "meditor", "labor", "dolor"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Life, Augustine says, is like a spider’s web: beautiful yet easily destroyed. 'Meditabuntur' means our years are only murmurs, barely substantial. Even the strong (those who reach eighty) live in toil and sorrow — unless grace transforms their labor."
    },
    {
      "name": "Severity → Instruction",
      "description": "From divine wrath to heart-wisdom",
      "lemmas": ["mansuetudo", "corripio", "sapientia", "timor", "potestas"],
      "startLine": 11,
      "endLine": 12,
      "comment": "‘Quis novit potestatem irae tuae?’ Augustine asks with awe. God’s wrath is real, but it brings correction. Through fear — not terror, but reverent awe — the soul becomes wise. The paradox of divine gentleness and wrath is resolved in discipline that leads to understanding."
    },
    {
      "name": "Marking → Mercy",
      "description": "From divine rebuke to personal pleading",
      "lemmas": ["dextera", "nota", "eruditus", "converto", "deprecabilis"],
      "startLine": 13,
      "endLine": 14,
      "comment": "Augustine sees God’s right hand as both powerful and personal. 'Nota fac' implies a divine imprint — a sign of election and instruction. The plea 'Convertere, Domine, usquequo?' is both lament and hope. Augustine says the soul longs for a merciful God who still owns His servants."
    },
    {
      "name": "Affliction → Joy",
      "description": "Suffering transfigured into satisfaction",
      "lemmas": ["misericordia", "repleo", "laetor", "humilio", "malum", "splendor"],
      "startLine": 15,
      "endLine": 18,
      "comment": "Augustine reflects on how joy does not erase past suffering, but redeems it. 'Repleti sumus mane misericordia tua' suggests a resurrection morning — when divine light returns. The works of our hands, he says, matter only when directed by God, and joy follows obedience through trials."
    }
  ]
},

{
  "psalmNumber": 90,
  "category": "",
  "themes": [
    {
      "name": "Divine Shelter → Heavenly Protection",
      "description": "From dwelling in God’s help to abiding under His protection",
      "lemmas": ["habito", "adiutorium", "protectio", "caelum"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalm opens with confidence: to dwell in God’s help is to rest under His protection, safe from every danger.",
      "comment2": "Augustine interprets this as the faithful resting in Christ, who is Himself the refuge and heavenly shelter (Enarr. Ps. 90.1–2)."
    },
    {
      "name": "Trust in God → Divine Deliverance",
      "description": "From confessing God as refuge to deliverance from snares",
      "lemmas": ["susceptor", "refugium", "spero", "libero"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The psalmist proclaims God as refuge and savior, trusting in His power to deliver from hidden traps and threats.",
      "comment2": "Augustine sees ‘susceptor’ and ‘refugium’ fulfilled in Christ, who liberates from spiritual snares and false voices (Enarr. Ps. 90.3–4)."
    },
    {
      "name": "Divine Covering → Fearless Trust",
      "description": "From God’s sheltering wings to fearless confidence",
      "lemmas": ["scapula", "penna", "veritas", "timeo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "God’s protective wings symbolize His nearness; His truth is a shield, removing fear of unseen terrors.",
      "comment2": "Augustine reads the wings as God’s mercy and the shield as Christ’s truth, freeing the Church from fear (Enarr. Ps. 90.5–6)."
    },
    {
      "name": "Destruction of Enemies → Safety of the Faithful",
      "description": "From the downfall of thousands to the preservation of the just",
      "lemmas": ["cado", "mille", "appropinquo", "video"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Though multitudes fall in judgment, the faithful are preserved and see the punishment of the wicked.",
      "comment2": "Augustine interprets the thousands as the fallen powers of the enemy, while the faithful safely watch God’s judgment (Enarr. Ps. 90.7–8)."
    },
    {
      "name": "Hope in God → Divine Refuge",
      "description": "From personal trust to God’s protection of the household",
      "lemmas": ["spes", "refugium", "malum", "appropinquo"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Hope in God transforms Him into a dwelling-place, keeping evil far from one’s home.",
      "comment2": "Augustine links this to Christ as the true dwelling: in Him, the faithful are kept from ultimate harm (Enarr. Ps. 90.9–10)."
    },
    {
      "name": "Angelic Guardians → Safe Journey",
      "description": "From angelic command to protection on life’s path",
      "lemmas": ["angelus", "custodio", "offendo", "pes"],
      "startLine": 11,
      "endLine": 12,
      "comment": "God sends His angels to guard the faithful, preventing stumbling along the way.",
      "comment2": "Augustine applies this to the apostolic preachers — angels in function — who protect believers from stumbling in faith (Enarr. Ps. 90.11–12)."
    },
    {
      "name": "Triumph over Evil → Victory over Serpents",
      "description": "From treading on serpents to conquering all hostile beasts",
      "lemmas": ["aspis", "basiliscus", "leo", "conculco"],
      "startLine": 13,
      "endLine": 14,
      "comment": "The imagery of trampling lions and serpents depicts victory over deadly and violent enemies.",
      "comment2": "Augustine interprets aspis, basilisk, and lion as figures of Satan and his powers, defeated in Christ by the faithful’s perseverance (Enarr. Ps. 90.13–14)."
    },
    {
      "name": "Trustful Cry → Divine Salvation",
      "description": "From crying to God in trust to His saving response",
      "lemmas": ["spero", "clamor", "exaudio", "salutare"],
      "startLine": 15,
      "endLine": 16,
      "comment": "The psalm closes with the faithful crying out in trust, and God’s promise of salvation, long life, and glory.",
      "comment2": "Augustine interprets this as the Church’s prayer fulfilled in Christ: through His exaltation comes salvation and eternal glory (Enarr. Ps. 90.15–16)."
    }
  ]
},

{
  "psalmNumber": 91,
  "category": "",
  "themes": [
    {
      "name": "Divine Praise",
      "description": "Celebration of God's character through worship",
      "lemmas": ["confiteor", "psallo", "magnifico", "exsulto", "delecto"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Opens with call to praise (*confiteor*) and musical worship (*psallo*), emphasizing joy (*exsultabo*)"
    },
    {
      "name": "Musical Worship",
      "description": "Instruments as vehicles for devotion",
      "lemmas": ["decachordum", "psalterium", "cithara", "canticum"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Specific instruments (*cithara*) reflect temple worship practices"
    },
    {
      "name": "Divine Wisdom",
      "description": "Contrast between God's knowledge and human limitation",
      "lemmas": ["profundus", "cogitatio", "insipiens", "stultus", "intelligo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "God's deep (*profundae*) thoughts contrast with foolishness (*stultus*)"
    },
    {
      "name": "Righteous Flourishing",
      "description": "Metaphors of growth and stability",
      "lemmas": ["palma", "cedrus", "floreo", "multiplico", "planto"],
      "startLine": 12,
      "endLine": 14,
      "comment": "Botanical imagery (*cedrus Libani*) symbolizes enduring vitality"
    },
    {
      "name": "Divine Justice",
      "description": "Temporal judgment and eternal sovereignty",
      "lemmas": ["iniquitas", "pereo", "dispergo", "intereo", "rectus"],
      "startLine": 7,
      "endLine": 15,
      "comment": "Wicked perish (*pereo*) while God's justice (*rectus*) endures"
    },
    {
      "name": "Temporal vs Eternal",
      "description": "Contrast between transient evil and enduring God",
      "lemmas": ["fenum", "aeternum", "saeculum", "altissimus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Sinners like grass (*fenum*) vs God's eternity (*in aeternum*)"
    },
    {
      "name": "Temple Imagery",
      "description": "Sacred space as locus of blessing",
      "lemmas": ["domus", "atrium", "planto", "altissimus"],
      "startLine": 13,
      "endLine": 13,
      "comment": "Planted (*plantati*) in God's courts (*atriis*)"
    },
    {
      "name": "Augustine: True Worship",
      "description": "Inner disposition over ritual form",
      "lemmas": ["confiteor", "rectus", "iniquitas", "delecto"],
      "startLine": 1,
      "endLine": 15,
      "comment": "Augustine connects praise (*confiteor*) with moral uprightness (*rectus*)"
    },
    {
      "name": "Augustine: Two Destinies",
      "description": "Eschatological contrast of outcomes",
      "lemmas": ["intereo", "floreo", "dispergo", "multiplico"],
      "startLine": 7,
      "endLine": 14,
      "comment": "Wicked scatter (*dispergentur*) while righteous flourish (*florebunt*)"
    },
    {
      "name": "Augustine: Spiritual Longevity",
      "description": "Enduring grace in old age",
      "lemmas": ["senectus", "uber", "patiens", "cornu"],
      "startLine": 10,
      "endLine": 14,
      "comment": "Horn (*cornu*) as symbol of strength in later years (*senecta uberi*)"
    }
  ]
},

{
  "psalmNumber": 94,
  "category": "",
  "themes": [
    {
      "name": "Exultation → Thanksgiving",
      "description": "From joyful shouting to approaching God with confession and psalms",
      "lemmas": ["exsulto", "iubilo", "confessio", "psalmus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalm begins with a call to joyful worship, urging the faithful to approach God with psalms and thanksgiving. Augustine sees this as the Church’s daily summons to open the heart in praise (Enarr. Ps. 94.1–2).",
      "comment2": "For Augustine, this exultant song is the 'new song' of the New Covenant in Christ, who is Himself our salvation. The jubilus — a cry beyond words — expresses the soul’s stretching toward eternity (Enarr. Ps. 94.1)."
    },
    {
      "name": "Greatness → Dominion",
      "description": "From the greatness of God to His sovereignty over creation’s boundaries",
      "lemmas": ["magnus", "rex", "manus", "altitudo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The Lord is proclaimed as king above all gods, whose hands hold both the earth’s limits and the heights of the mountains. Augustine underlines that no realm lies outside His dominion (Enarr. Ps. 94.3–4).",
      "comment2": "Augustine links this sovereignty to Christ the King, to whom the Father has given 'all things in His hand' (John 3:35). The mountains symbolize the proud, and the depths the humble — yet all are under Christ’s rule."
    },
    {
      "name": "Sea → Adoration",
      "description": "From God as maker of sea and land to worship before Him who made us",
      "lemmas": ["mare", "arida", "adoro", "procido"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The sea and the dry land are His creation, and so the faithful are summoned to kneel before their Maker. Augustine contrasts this humility with the pride of those who refuse to bow (Enarr. Ps. 94.5–6).",
      "comment2": "Augustine recalls Christ calming the sea (Mark 4:39): He who made the waters also rules their storms. Thus, adoration of the Creator is fulfilled in bowing to Christ, through whom all was made (John 1:3)."
    },
    {
      "name": "People → Voice",
      "description": "From belonging to God’s flock to hearing His voice today",
      "lemmas": ["populus", "ovis", "vox", "hodie"],
      "startLine": 7,
      "endLine": 8,
      "comment": "God’s people are the sheep of His hand, called to listen today if they hear His voice. Augustine stresses the urgency of 'hodie'—today is the time of obedience and conversion (Enarr. Ps. 94.7–8).",
      "comment2": "Christ is the Shepherd, and we the sheep of His pasture (John 10:14). Augustine emphasizes that 'today' points to the present moment of grace in Christ — the acceptable time of salvation (2 Cor 6:2)."
    },
    {
      "name": "Testing → Rebellion",
      "description": "From the desert trial to the provocation of a hardened heart",
      "lemmas": ["tentatio", "exacerbatio", "desertum", "opera"],
      "startLine": 9,
      "endLine": 10,
      "comment": "The desert generation tested and provoked the Lord, though they saw His works. Augustine recalls this as a warning for the Church, lest we repeat their unbelief (Enarr. Ps. 94.9–10).",
      "comment2": "Augustine interprets the desert testing as prefiguring Christ, the Rock struck to give living water (1 Cor 10:4). The provocation warns us not to harden our hearts against the grace poured out in Him."
    },
    {
      "name": "Error → Exclusion",
      "description": "From wandering hearts to the oath of exclusion from God’s rest",
      "lemmas": ["erro", "via", "requies", "ira"],
      "startLine": 11,
      "endLine": 12,
      "comment": "For forty years the Lord bore with a wayward people, declaring they would not enter His rest. Augustine interprets this as the eternal rest of God, entered only by faith and obedience (Enarr. Ps. 94.11).",
      "comment2": "Augustine sees 'requies' as Christ Himself, our Sabbath rest (Matt 11:28–29). Those hardened in unbelief cannot enter. Thus the psalm anticipates the Church’s hope: eternal rest in Christ’s kingdom."
    }
  ]
},


{
  "psalmNumber": 113,
  "category": "",
  "themes": [
    {
      "name": "Exodus → Sanctification",
      "description": "From departure out of Egypt to being made holy and empowered by God.",
      "lemmas": ["exitus", "aegyptus", "jacob", "sanctificatio", "potestas"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The redemptive journey begins with God's deliverance and culminates in Israel becoming His sanctified people."
    },
    {
      "name": "Sea → Leaping Hills",
      "description": "From receding waters to mountains dancing with life",
      "lemmas": ["fugio", "converto", "exsulto", "aries", "agnus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine sees grace moving nature: the waters flee, and the hills leap. Rams represent the strong in faith; lambs, the humble. All creation responds to God’s presence in a joyful transformation (Enarr. Ps. 113.4–6)."
    },

     {
      "name": "Terror → Submission",
      "description": "From rhetorical awe to acknowledgment of nature’s obedience to God.",
      "lemmas": ["fugio", "converto", "mons", "exsulto"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Questions provoke reflection on why nature trembled—pointing to God as the true cause of submission."
    },
    {
  "name": "Rock → Water",
  "description": "From immovable rock to life-giving waters by the power of Christ",
  "lemmas": ["petra", "rupes", "stagnum", "fons"],
  "startLine": 7,
  "endLine": 8,
  "comment": "Augustine sees standing water and springing wells. Petra and rupes (flint stone) as Christ, from whom living waters flow. The stagnum (pool) and fontes (springs) represent the grace Christ bestows — as fulfilled in John 7:37–38. The transformation of rock into water is the mystery of Christ’s provision (Enarr. Ps. 113.8; 1 Cor 10:4; Jn 7:37)."
},

   {
      "name": "Glory → Defense",
      "description": "From divine glorification to defense of God's reputation among the nations.",
      "lemmas": ["nomen", "gloria", "misericordia", "veritas", "gens"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Glory is due to God's name alone; His mercy and truth vindicate Him before skeptical nations."
    },
    {
      "name": "Creator → Contrast",
      "description": "From God's sovereignty in heaven to the lifelessness of idols on earth.",
      "lemmas": ["caelum", "facio", "simulacrum", "argentum", "aurum", "manus"],
      "startLine": 11,
      "endLine": 12,
      "comment": "God acts freely in heaven while idols, made by human hands, are mute and impotent."
    },
    {
      "name": "Senses → Absence",
      "description": "From visible senses in idols to complete spiritual absence.",
      "lemmas": ["os", "oculus", "auris", "naris", "loquor", "video", "audio", "odoror"],
      "startLine": 13,
      "endLine": 14,
      "comment": "Though shaped with sensory organs, idols lack all life and power—mockery of divine perception."
    },
    {
      "name": "Impotence → Imitation",
      "description": "From motionless idols to the spiritual deadness of their makers.",
      "lemmas": ["manus", "palpo", "pes", "ambulo", "guttur", "similis", "confido"],
      "startLine": 15,
      "endLine": 16,
      "comment": "The lifelessness of idols reflects back on those who trust them: a descent into spiritual sterility."
    },
    {
      "name": "Hope → Help",
      "description": "From trusting in God to receiving His aid and protection.",
      "lemmas": ["domus", "spero", "adjutor", "protector", "israel", "aaron"],
      "startLine": 17,
      "endLine": 18,
      "comment": "The pattern of trust followed by divine response solidifies the covenantal relationship."
    },
    {
      "name": "Remembrance → Blessing",
      "description": "From God’s memory of His people to His active blessing upon all.",
      "lemmas": ["memor", "benedico", "timentes", "pusillus", "maior"],
      "startLine": 19,
      "endLine": 21,
      "comment": "God’s memory is not passive—it initiates blessing across generations and social ranks."
    },
    {
      "name": "Expansion → Praise",
      "description": "From increase in family and land to praise among the living.",
      "lemmas": ["adjicio", "filius", "terra", "infernum", "benedicimus", "vivimus"],
      "startLine": 22,
      "endLine": 26,
      "comment": "The psalm closes in a crescendo of praise—from earthly blessings to the eternal praise of the living."
    }
  ]
},




    {
      "psalmNumber": 118,
      "category": "aleph",
      "themes": [
        {
          "name": "Double Beatitude",
          "description": "Blessings for the obedient",
          "lemmas": ["beatus", "immaculatus", "via", "ambulo"],
          "startLine": 1,
          "endLine": 2,
          "comment": "Opening blessings for law-keepers (v1-2)"
        },
        {
          "name": "Wholehearted Seeking",
          "description": "Complete devotion to God's word",
          "lemmas": ["scrutor", "testimonium", "cor", "exquiro"],
          "startLine": 2,
          "endLine": 2,
          "comment": "Whole-hearted study of testimonies (v2)"
        },
        {
          "name": "Path Contrast",
          "description": "Opposing ways of righteousness and wickedness",
          "lemmas": ["iniquitas", "via", "ambulo"],
          "startLine": 3,
          "endLine": 3,
          "comment": "Negative example of law-breakers (v3)"
        },
        {
          "name": "Commandment Imperative",
          "description": "Divine charge to obey",
          "lemmas": ["mando", "mandatum", "custodio", "nimis"],
          "startLine": 4,
          "endLine": 4,
          "comment": "Explicit command to keep statutes (v4)"
        },
        {
          "name": "Prayer for Guidance",
          "description": "Petition for directed obedience",
          "lemmas": ["dirigo", "via", "custodio", "justificatio"],
          "startLine": 5,
          "endLine": 5,
          "comment": "Desire for paths aligned with God's law (v5)"
        },
        {
          "name": "Confident Assurance",
          "description": "Freedom from shame through obedience",
          "lemmas": ["confundor", "perspicio", "mandatum"],
          "startLine": 6,
          "endLine": 6,
          "comment": "Result of comprehensive obedience (v6)"
        },
        {
          "name": "Grateful Learning",
          "description": "Thankful response to divine instruction",
          "lemmas": ["confiteor", "justus", "disco", "justificatio"],
          "startLine": 7,
          "endLine": 7,
          "comment": "Commitment to learn judgments (v7)"
        },
        {
          "name": "Covenantal Commitment",
          "description": "Promise to keep God's statutes",
          "lemmas": ["custodio", "derelinquo", "mandatum", "quaero"],
          "startLine": 8,
          "endLine": 8,
          "comment": "Resolution not to forsake the law (v8)"
        }
      ]
    },
    {
      "psalmNumber": 118,
      "category": "beth",
      "themes": [
        {
          "name": "Spiritual Formation",
          "description": "Guidance for the young believer's path",
          "lemmas": ["corrigo", "adolescens", "custodio", "doceo", "exerceo"],
          "startLine": 1,
          "endLine": 2,
          "comment": "Opening focus on correction and keeping God's words"
        },
        {
          "name": "Heart Engagement",
          "description": "Wholehearted seeking and internalization",
          "lemmas": ["cor", "exquiro", "abscondo", "meditor", "obliviscor"],
          "startLine": 2,
          "endLine": 4,
          "comment": "Mental and emotional aspects of devotion in middle verses"
        },
        {
          "name": "Divine Communication",
          "description": "God's spoken and written revelation",
          "lemmas": ["sermo", "eloquium", "judicium", "testimonium", "mandatum"],
          "startLine": 1,
          "endLine": 8,
          "comment": "Multiple terms for God's instructions throughout"
        },
        {
          "name": "Delightful Obedience",
          "description": "Joy in keeping God's commands",
          "lemmas": ["delector", "pronuntio", "benedico", "considero", "justificatio"],
          "startLine": 5,
          "endLine": 8,
          "comment": "Positive emotional response in closing verses"
        },
        {
          "name": "Vocational Response",
          "description": "Outward actions flowing from devotion",
          "lemmas": ["pronuntio", "exerceo", "doceo", "meditor", "considero"],
          "startLine": 5,
          "endLine": 8,
          "comment": "Active verbs showing engaged response"
        },
        {
          "name": "Augustine: Memory Theater",
          "description": "Storing God's word in the heart",
          "lemmas": ["abscondo", "cor", "obliviscor", "eloquium", "meditor"],
          "startLine": 3,
          "endLine": 4,
          "comment": "Augustinian emphasis on memory as spiritual faculty"
        },
        {
          "name": "Augustine: Delightful Discipline",
          "description": "Grace transforming duty into joy",
          "lemmas": ["delector", "mandatum", "exerceo", "benedico", "justificatio"],
          "startLine": 6,
          "endLine": 8,
          "comment": "How grace makes God's law desirable"
        }
      ]
    },
{
  "psalmNumber": 118,
  "category": "gimel",
  "themes": [
    {
      "name": "Servant Identity",
      "description": "The psalmist's self-understanding as God's servant",
      "lemmas": ["servus", "vivifico", "custodio", "exerceo", "incola"],
      "startLine": 1,
      "endLine": 3,
      "comment": "Repeated servant language with active obedience"
    },
    {
      "name": "Divine Illumination",
      "description": "Prayers for spiritual understanding",
      "lemmas": ["revelo", "oculus", "considero", "mirabilium", "lex"],
      "startLine": 2,
      "endLine": 3,
      "comment": "Vision metaphors for Torah comprehension"
    },
    {
      "name": "Exilic Longing",
      "description": "Earthly alienation and heavenly desire",
      "lemmas": ["incola", "terra", "concupisco", "desidero", "tempus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Tension between earthly sojourn and divine commandments"
    },
    {
      "name": "Opposition Context",
      "description": "Conflict with the arrogant and powerful",
      "lemmas": ["increpo", "superbus", "maledico", "declino", "princeps"],
      "startLine": 5,
      "endLine": 7,
      "comment": "Social resistance to Torah observance"
    },
    {
      "name": "Covenantal Defense",
      "description": "Appeal to God's testimonies in adversity",
      "lemmas": ["opprobrium", "contemptum", "testimonium", "exquiro", "meditatio"],
      "startLine": 6,
      "endLine": 8,
      "comment": "Using God's words as protection against slander"
    },
    {
      "name": "Augustine: Two Cities",
      "description": "Contrast between heavenly and earthly communities",
      "lemmas": ["incola", "superbus", "princeps", "testimonium", "justificatio"],
      "startLine": 3,
      "endLine": 7,
      "comment": "Earthly powers vs. heavenly citizenship"
    },
    {
      "name": "Augustine: Delightful Struggle",
      "description": "Grace transforming persecution into meditation",
      "lemmas": ["exerceo", "concupisco", "meditatio", "justificatio", "desidero"],
      "startLine": 4,
      "endLine": 8,
      "comment": "How adversity deepens love for God's law"
    },
     {
      "name": "Augustine: Ordered Love",
      "description": "Proper desire directed toward eternal law",
      "lemmas": ["concupisco", "desidero", "justificatio", "anima", "tempus"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Soul's longing rightly oriented toward God's statutes"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "daleth",
  "themes": [
    {
      "name": "Mortal Anguish",
      "description": "Deep distress requiring divine intervention",
      "lemmas":  ["adhaereo", "pavimentum", "dormito", "taedium", "confirmo"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Physical metaphors for spiritual crisis"
    },
    {
      "name": "Divine Rescue",
      "description": "Pleas for life and preservation",
      "lemmas": ["vivifico", "confirmo", "opprobrium", "misereor"],  
      "startLine": 1,
      "endLine": 8,
      "comment": "Requests for God to act amid suffering"
    },
    {
      "name": "Pedagogy of Suffering",
      "description": "Affliction as context for learning God's ways",
      "lemmas": ["doceo", "justificatio", "instruo", "exerceo", "mirabilium"],
      "startLine": 2,
      "endLine": 3,
      "comment": "Educational language in trial context"
    },
    {
      "name": "Two Ways Contrast",
      "description": "Choice between truth and iniquity",
      "lemmas": ["via", "iniquitas", "veritas", "elego", "removeo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Classic wisdom literature dichotomy"
    },
    {
      "name": "Covenantal Pursuit",
      "description": "Active devotion to God's commandments",
      "lemmas": ["adhaereo", "testimonium", "curro", "dilato", "cor"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Dynamic verbs of spiritual commitment"
    },
    {
      "name": "Heart Transformation",
      "description": "Divine action enabling obedience",
      "lemmas": ["cor", "dilato", "confirma", "miserere", "elego"],
      "startLine": 4,
      "endLine": 8,
      "comment": "God's role in shaping human will"
    },
    {
      "name": "Augustine: Humble Learning",
      "description": "Brokenness as prerequisite for divine instruction",
      "lemmas": ["pavimentum", "doceo", "taedium", "instruo", "confirma"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Contrast between human lowliness and divine teaching"
    },
    {
      "name": "Augustine: Dilated Heart",
      "description": "Grace expanding capacity for love",
      "lemmas": ["dilato", "cor", "adhaereo", "curro", "testimonium"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Divine action enabling wholehearted obedience"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "he",
  "themes": [
    {
      "name": "Petition → Obedience",
      "description": "Requests for divine guidance enabling Torah fidelity",
      "lemmas": ["pono", "deduco", "custodio", "mandatum"],
      "startLine": 1,
      "endLine": 3,
      "comment": "Imperative verbs (pone, deduc) precede covenantal obedience (custodiam)"
    },
    {
      "name": "Faculty Alignment",
      "description": "Reorientation of human capacities toward divine law",
      "lemmas": ["intellectus", "cor", "oculus", "inclino"],
      "startLine": 2,
      "endLine": 4,
      "comment": "Heart (cor), mind (intellectum), and eyes (oculos) recalibrated to testimonies"
    },
    {
      "name": "Aversion → Vivification",
      "description": "Turning from vanity to find life in God's way",
      "lemmas": ["averto", "vanitas", "vivifico", "via"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Double movement: 'turn away' (averte) and 'give life' (vivifica)"
    },
    {
      "name": "Judicial Delight",
      "description": "God's judgments as both joyful and equitable",
      "lemmas": ["judicium", "jucundus", "aequitas", "concupisco"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Unexpected pairing: opprobrium (shame) with jucunda (pleasant judgments)"
    },
    {
      "name": "Augustine: Lex Vivificans",
      "description": "Law as living path rather than dead letter",
      "lemmas": ["via", "vivifico", "mandatum"],
      "startLine": 3,
      "endLine": 5,
      "comment": "'In via tua vivifica me' shows law animated by grace (Enarrationes 118.33)"
    },
    {
      "name": "Augustine: Oculus Cordis",
      "description": "Spiritual vision purified for divine contemplation",
      "lemmas": ["oculus", "vanitas", "cor"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Eyes turned from vanity (Conf. VII.21) to see via justificationum"
    }
  
  ]
},

{
  "psalmNumber": 118,
  "category": "vau",
  "themes": [
    {
      "name": "Mercy → Salvation",
      "description": "Divine compassion actualizing promised deliverance",
      "lemmas": ["misericordia", "salutare", "eloquium", "venio"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Mercy (v.41) precedes and enables the keeping of law (v.44)"
    },
    {
      "name": "Hope → Vindication",
      "description": "Confident expectation answering adversaries",
      "lemmas": ["spero", "superspero", "respondeo", "exprobro"],
      "startLine": 2,
      "endLine": 3,
      "comment": "Double hope (speravi/supersperavi) confronts reproach (exprobrantibus)"
    },
    {
      "name": "Truth → Eternity",
      "description": "Uncompromised fidelity to everlasting covenant",
      "lemmas": ["veritas", "usquequaque", "saeculum", "custodio"],
      "startLine": 3,
      "endLine": 4,
      "comment": "'Utterly' (usquequaque) modifies both truth-keeping and eternal scope"
    },
    {
      "name": "Freedom → Proclamation",
      "description": "Liberty enabling bold testimony",
      "lemmas": ["latitudo", "testimonium", "rex", "confundor"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Width (latitudine) of movement parallels royal confidence"
    },
    {
      "name": "Love → Gesture",
      "description": "Affection expressed through physical devotion",
      "lemmas": ["diligo", "levo", "meditor", "exerceo"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Hand-raising (levavi) completes the meditation-practice cycle"
    },
    {
      "name": "Augustine: Misericordia Subjunctiva",
      "description": "Prayer's grammatical mood shaping grace",
      "lemmas": ["venio", "aufero", "custodio"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Subjunctives (veniat/auferas) show grace-dependent obedience (Enarrationes 118.41)"
    },
    {
      "name": "Augustine: Supersperatio",
      "description": "Excessive hope transcending circumstances",
      "lemmas": ["superspero", "judicium", "exprobro"],
      "startLine": 2,
      "endLine": 3,
      "comment": "Super-abundant hope (supersperavi) amid reproach (Sermon 32.12)"
    },
   {
      "name": "Teresa: Manus Orantis",
      "description": "Elevated hands as total surrender",
      "lemmas": ["levo", "diligo", "justificatio"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Physical gesture (levavi) manifests 'Nada te turbe' abandon (Interior Castle V.3)"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "zain",
  "themes": [
    {
      "name": "Covenantal Promises",
      "description": "God's word as source of hope and life-giving comfort",
      "lemmas": ["memor", "verbum", "spes", "consolor", "vivifico"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist anchors hope in God's remembered promises"
    },
    {
      "name": "Resistance and Eternity",
      "description": "Steadfast obedience amid evil with eternal perspective",
      "lemmas": ["superbus", "iniquus", "declino", "judicium", "saeculum"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Contrast between present wickedness and God's eternal judgments"
    },
    {
      "name": "Exhaustion and Joy",
      "description": "Spiritual weariness transformed through joyful obedience",
      "lemmas": ["defectio", "teneo", "peccator", "cantabilis", "peregrinatio"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Paradox of finding song in God's statutes during exile"
    },
    {
      "name": "Nocturnal Fidelity",
      "description": "Nighttime remembrance and covenant keeping",
      "lemmas": ["memor", "nomen", "custodio", "exquiro", "nox"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Devotion expressed through vigilant nighttime observance"
    },
    {
      "name": "Augustine: Memory as Sacrament",
      "description": "Remembrance as active participation in divine reality",
      "lemmas": ["memor", "verbum", "nox", "nomen", "custodio"],
      "startLine": 1,
      "endLine": 8,
      "comment": "Nocturnal remembrance is sacramental communion with God"
    },
    {
      "name": "Augustine: Lex Vivificans",
      "description": "God's law as living, active, and life-giving force",
      "lemmas": ["vivifico", "verbum", "justificatio", "lex", "exquiro"],
      "startLine": 2,
      "endLine": 8,
      "comment": "God's word operates as resurrection power in the soul"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "heth",
  "themes": [
    {
      "name": "Covenantal Commitment",
      "description": "Voluntary dedication to God's law",
      "lemmas": ["portio", "custodio", "paratus", "participo"],
      "startLine": 1,
      "endLine": 7,
      "comment": "Active choice to make God's law one's portion (v.57) and identity (v.63)"
    },
    {
      "name": "Prayerful Dependence",
      "description": "Petitions grounded in God's character",
      "lemmas": ["deprecor", "misereor", "confiteor", "misericordia"],
      "startLine": 2,
      "endLine": 8,
      "comment": "Appeals to mercy (vv.58,64) and nocturnal worship (v.62)"
    },
    {
      "name": "Perseverance Amid Opposition",
      "description": "Steadfastness despite external pressures",
      "lemmas": ["converto", "funis", "circumplector", "turbo"],
      "startLine": 3,
      "endLine": 5,
      "comment": "Encirclement by sinners (v.61) contrasted with resolve (v.60)"
    },
    {
      "name": "Communal Piety",
      "description": "Solidarity with the faithful",
      "lemmas": ["particeps", "timeo", "custodio", "terra"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Identification with God-fearers (v.63) and global mercy (v.64)"
    },
    {
      "name": "Augustine: Nocturnal Conversion",
      "description": "Night as time for spiritual turning",
      "lemmas": ["cogito", "converto", "media", "surgo"],
      "startLine": 3,
      "endLine": 6,
      "comment": "Parallel between v.59's conversion and v.62's midnight rising"
    },
    {
      "name": "Augustine: Mercy and Justice",
      "description": "Divine compassion enabling obedience",
      "lemmas": ["misericordia", "justificatio", "doceo", "eloquium"],
      "startLine": 2,
      "endLine": 8,
      "comment": "Grace (v.58) precedes instruction in righteousness (v.64)"
    }
  ]
},
{
  "psalmNumber": 118,
  "category": "teth",
  "themes": [
    {
      "name": "Divine Pedagogy",
      "description": "God's goodness as instructional",
      "lemmas": ["bonitas", "discipline", "scientia", "doceo", "humilio"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Divine goodness (v.65) linked to teaching (v.66) and humbling (v.71)"
    },
    {
      "name": "Theological Paradox",
      "description": "Affliction as divine gift",
      "lemmas": ["bonus", "humilio", "disco", "iniquitas"],
      "startLine": 5,
      "endLine": 7,
      "comment": "Humbling (v.71) and pride's opposition (v.69) become means of learning"
    },
    {
      "name": "Comparative Value",
      "description": "Spiritual vs. material worth",
      "lemmas": ["lex", "aurum", "argentum", "super", "mille"],
      "startLine": 8,
      "endLine": 8,
      "comment": "God's law valued above precious metals (v.72)"
    },
    {
      "name": "Contrast of Hearts",
      "description": "Opposing internal dispositions",
      "lemmas": ["superbus", "cor", "coagulo", "scrutor", "meditor"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Proud hearts curdled (v.70) vs. devoted meditation (v.70)"
    },
    {
      "name": "Augustine: Humble Learning",
      "description": "Precondition for true knowledge",
      "lemmas": ["humilio", "disco", "priusquam", "delinquo"],
      "startLine": 3,
      "endLine": 7,
      "comment": "Sin (v.67) precedes humility that enables learning"
    },
    {
      "name": "Augustine: Ordered Love",
      "description": "Right valuation of divine law",
      "lemmas": ["bonus", "aurum", "lex", "super"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Proper love hierarchy: God's word > earthly riches"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "jod",
  "themes": [
    {
      "name": "Divine Craftsmanship",
      "description": "God as creator and instructor of humanity",
      "lemmas": ["manus", "facio", "plasto", "intellectus", "disco"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Creator-creation relationship (v.73) demands illumination"
    },
    {
      "name": "Communal Joy",
      "description": "Shared gladness among the faithful",
      "lemmas": ["timeo", "video", "laetor", "superspero"],
      "startLine": 2,
      "endLine": 2,
      "comment": "Mutual recognition of hope in God's word (v.74)"
    },
    {
      "name": "Pedagogy of Suffering",
      "description": "Affliction as divine instruction",
      "lemmas": ["aequitas", "judicium", "veritas", "humilio"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Humiliation through truth (v.75) as formative"
    },
    {
      "name": "Merciful Consolation",
      "description": "Comfort anchored in God's promises",
      "lemmas": ["misericordia", "consolor", "eloquium", "miseratio"],
      "startLine": 4,
      "endLine": 5,
      "comment": "Mercy-life connection (vv.76-77) through meditation"
    },
    {
      "name": "Antithetical Community",
      "description": "Contrast between proud and faithful",
      "lemmas": ["superbia", "iniquitas", "exerceor", "testimonium"],
      "startLine": 6,
      "endLine": 7,
      "comment": "Shame for oppressors (v.78) vs. solidarity with God-fearers (v.79)"
    },
    {
      "name": "Heart Purity",
      "description": "Inward transformation goal",
      "lemmas": ["cor", "immaculatus", "justificatio", "confundor"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Blameless heart as protection from shame (v.80)"
    },
    {
      "name": "Augustine: Creator-Redeemer",
      "description": "Formation and reformation by God",
      "lemmas": ["plasto", "disco", "humilio", "immaculatus"],
      "startLine": 1,
      "endLine": 8,
      "comment": "God shapes physically (v.73) and spiritually (v.80)"
    },
    {
      "name": "Augustine: Two Cities",
      "description": "Proud vs. humble communities",
      "lemmas": ["superbus", "timeo", "confundor", "justificatio"],
      "startLine": 6,
      "endLine": 8,
      "comment": "Earthly shame vs. heavenly justification"
    }
  ]
},
{
  "psalmNumber": 118,
  "category": "caph",
  "themes": [
    {
      "name": "Desperate Longing",
      "description": "Physical and spiritual exhaustion awaiting God's intervention",
      "lemmas": ["deficio", "superspero", "consolor", "anima", "oculus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Bodily metaphors (eyes/soul) for spiritual thirst"
    },
    {
      "name": "Suffering Imagery",
      "description": "Extreme vulnerability amid persecution",
      "lemmas": ["uter", "pruina", "consummo", "terra", "persequor"],
      "startLine": 3,
      "endLine": 7,
      "comment": "Wineskin/frost symbolize fragility; 'almost destroyed' (v.87)"
    },
    {
      "name": "Cry for Justice",
      "description": "Appeals for divine judgment against persecutors",
      "lemmas": ["judicium", "iniquus", "persequor", "adjuvio", "servus"],
      "startLine": 4,
      "endLine": 6,
      "comment": "Direct questions to God about timing of justice (v.84)"
    },
    {
      "name": "Truth vs Falsehood",
      "description": "Contrast between God's commands and human lies",
      "lemmas": ["fabula", "lex", "mandatum", "veritas", "iniquus"],
      "startLine": 5,
      "endLine": 6,
      "comment": "'False tales' (fabulationes) vs 'all Your commandments are truth'"
    },
    {
      "name": "Covenantal Faithfulness",
      "description": "Steadfast loyalty despite opposition",
      "lemmas": ["justificatio", "non oblitus", "non derelinquo", "custodio", "testimonium"],
      "startLine": 3,
      "endLine": 8,
      "comment": "Double negation emphasizes commitment (vv.83,87)"
    },
    {
      "name": "Life from Mercy",
      "description": "Final plea grounded in God's character",
      "lemmas": ["misericordia", "vivifico", "custodio", "os", "testimonium"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Climax: 'Revive me according to Your mercy' (v.88)"
    },
    {
      "name": "Augustine: Suffering as Remembrance",
      "description": "Affliction prevents forgetfulness of God",
      "lemmas": ["uter", "pruina", "non oblitus", "justificatio", "custodio"],
      "startLine": 3,
      "endLine": 8,
      "comment": "Frostbitten wineskin (v.83) paradoxically preserves memory"
    },
    {
      "name": "Augustine: Mercy Precedes Obedience",
      "description": "Divine action enables human response",
      "lemmas": ["misericordia", "vivifico", "custodio", "testimonium", "os"],
      "startLine": 8,
      "endLine": 8,
      "comment": "'Revive me... that I may keep' (v.88) shows grace-first logic"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "lamed",
  "themes": [
    {
      "name": "Eternal Foundations",
      "description": "God's word as enduring cosmic reality",
      "lemmas": ["aeternum", "verbum", "permaneo", "fundo", "caelum"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Creation established through divine speech"
    },
    {
      "name": "Divine Ordinance",
      "description": "Creation's obedience to God's decrees",
      "lemmas": ["ordinatio", "persevero", "servio", "dies", "omnia"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Nature's submission contrasts with human rebellion"
    },
    {
      "name": "Law as Lifeline",
      "description": "Scripture meditation preventing destruction",
      "lemmas": ["lex", "meditatio", "pereo", "humilitas", "vivifico"],
      "startLine": 4,
      "endLine": 5,
      "comment": "Torah study as antidote to spiritual death"
    },
    {
      "name": "Covenantal Identity",
      "description": "Belonging to God through obedience",
      "lemmas": ["tuus", "salvo", "exquiro", "justificatio", "obliviscor"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Mutual possession expressed through law-keeping"
    },
    {
      "name": "Enemy Contrast",
      "description": "Righteous understanding vs. destructive intent",
      "lemmas": ["peccator", "perdo", "exspecto", "testimonium", "intellego"],
      "startLine": 7,
      "endLine": 7,
      "comment": "Opposition highlighting divine wisdom"
    },
    {
      "name": "Boundless Commandment",
      "description": "Infinite scope of God's instruction",
      "lemmas": ["consummatio", "finis", "latus", "mandatum", "nimis"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Paradox of perfect law exceeding human limits"
    },
    {
      "name": "Augustine: Eternal Word",
      "description": "Christ as the abiding divine utterance",
      "lemmas": ["verbum", "permaneo", "caelum", "veritas", "fundo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Johannine connection (John 1:1)"
    },
    {
      "name": "Augustine: Law and Grace",
      "description": "Commandments as means of vivification",
      "lemmas": ["justificatio", "vivifico", "salvo", "mandatum", "misericordia"],
      "startLine": 5,
      "endLine": 8,
      "comment": "Grace-enabled obedience to life-giving law"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "mem",
  "themes": [
    {
      "name": "Love for God's Law",
      "description": "Deep affection and meditation on divine commandments",
      "lemmas": ["diligo", "meditatio", "quaero", "custodio"],
      "startLine": 1,
      "endLine": 8,
      "comment": "Emotional and intellectual engagement with Torah"
    },
    {
      "name": "Wisdom Superiority",
      "description": "Divine law provides understanding surpassing human teachers",
      "lemmas": ["intellego", "prudens", "super", "senex"],
      "startLine": 2,
      "endLine": 4,
      "comment": "Divine wisdom exceeds even elders and teachers"
    },
    {
      "name": "Sensory Delight",
      "description": "Physical metaphors for spiritual satisfaction",
      "lemmas": ["dulcis", "eloquium", "mel", "os"],
      "startLine": 7,
      "endLine": 7,
      "comment": "Taste imagery for God's words"
    },
    {
      "name": "Radical Rejection",
      "description": "Understanding leads to complete opposition to evil",
      "lemmas": ["odi", "iniquitas", "prohibeo", "declino"],
      "startLine": 5,
      "endLine": 8,
      "comment": "Cognitive understanding produces moral revulsion"
    },
    {
      "name": "Divine Pedagogy",
      "description": "God's commandments as transformative instruction",
      "lemmas": ["doceo", "prudens", "intellego", "mandatum"],
      "startLine": 1,
      "endLine": 4,
      "comment": "Law makes wise beyond normal education"
    },
    {
      "name": "Two Ways Contrast",
      "description": "Clear dichotomy between God's way and evil path",
      "lemmas": ["via", "malus", "iniquitas", "custodio"],
      "startLine": 5,
      "endLine": 8,
      "comment": "Classic wisdom literature theme"
    },
    {
      "name": "Augustine: Sweetness of Truth",
      "description": "Sensory delight as metaphor for spiritual truth",
      "lemmas": ["dulcis", "mel", "eloquium", "odi"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Contrast between honey-sweet words and hated iniquity"
    },
    {
      "name": "Augustine: Illuminated Understanding",
      "description": "Divine light enabling superior comprehension",
      "lemmas": ["intellego", "super", "testimonium", "prudens"],
      "startLine": 2,
      "endLine": 4,
      "comment": "Grace grants understanding surpassing human teachers"
    }
  ]
},
{
  "psalmNumber": 118,
  "category": "nun",
  "themes": [
    {
      "name": "Light → Vows",
      "description": "Divine illumination enabling sacred commitment",
      "lemmas": ["lucerna", "verbum", "juro", "statuo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "God's word as light (lucerna) precedes and empowers human vows (juravi)"
    },
    {
      "name": "Humility → Teaching",
      "description": "Lowliness preparing for divine instruction",
      "lemmas": ["humilio", "vivifico", "doceo", "voluntarius"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Utter humiliation (usquequaque) creates space for life-giving teaching"
    },
    {
      "name": "Protection → Steadfastness",
      "description": "Divine custody ensuring covenant fidelity",
      "lemmas": ["anima", "manus", "laqueus", "erro"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Soul in God's hands (manibus) prevents straying from commands"
    },
    {
      "name": "Inheritance → Commitment",
      "description": "Eternal joy motivating wholehearted obedience",
      "lemmas": ["hereditas", "exsultatio", "inclino", "aeternum"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Testimonies as perpetual heritage (hereditate) inspire heart-inclining"
    },
    {
      "name": "Augustine: Incarnate Light",
      "description": "Christ as the walking Word enabling vows",
      "lemmas": ["lucerna", "verbum", "juro"],
      "startLine": 1,
      "endLine": 2,
      "comment": "'Lamp to feet' signifies Christ's embodied guidance (Sermon 126)"
    },
    {
      "name": "Augustine: Humilitas Docibilis",
      "description": "Humiliation as pedagogy of grace",
      "lemmas": ["humilio", "doceo", "manus"],
      "startLine": 3,
      "endLine": 5,
      "comment": "God teaches only in the valley of humility (Enarrationes 118.25)"
    },
    {
      "name": "Augustine: Inclinated Eschatology",
      "description": "Heart bent toward eternal reward",
      "lemmas": ["inclino", "retributio", "aeternum"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Grace inclines the heart toward its true homeland (Conf. XIII.9)"
    }
  ]
},

{
  "psalmNumber": 118,
  "category": "res",
  "themes": [
    {
      "name": "Affliction → Vindication",
      "description": "From personal humility under trial to God’s redemptive judgment",
      "lemmas": ["humiliatio", "iudicium", "redimo"],
      "startLine": 1,
      "endLine": 2,

      "comment": "The psalmist asks God to see his affliction and rescue him, not forgetting the Law. This is the cry of the faithful who seek both deliverance and the life-giving Word (vivifica) as the true vindication.",
      "comment2": "Augustine sees this as the soul presenting its case before God, confident that true life is restored not by escaping earthly trouble but by cleaving to the divine Law that was never forgotten (Enarr. Ps. 118-Res.1–2)."
    },
    {
      "name": "Estrangement → Mercy",
      "description": "From the distance of sinners to the nearness of divine compassion",
      "lemmas": ["peccator", "salus", "misericordia"],
      "startLine": 3,
      "endLine": 4,

       "comment": "Salvation is far from those who ignore God’s statutes, but the Lord’s mercies are abundant, and He restores life in His judgment.",
      "comment2": "Augustine contrasts the remoteness of the sinner’s life—estranged from the statutes—with the boundless nearness of mercy for those who seek God’s will. God’s judgments, though feared by the wicked, are life to the faithful (Enarr. Ps. 118-Res.3–4)."
  
    },
    {
      "name": "Persecution → Zeal",
      "description": "From many enemies to a burning grief for God’s Word",
      "lemmas": ["persequor", "tribulatio", "praevaricor"],
      "startLine": 5,
      "endLine": 6,
       "comment": "Even amid many persecutors, the psalmist does not turn from God’s testimonies. Seeing the faithless ignore His words causes deep grief.",
      "comment2": "Augustine notes that holy sorrow over others’ sins springs from love, not pride. This wasting away in grief is not despair but zeal for God’s honor, mirroring Christ’s own compassion for the erring (Enarr. Ps. 118-Res.5–6)."
    


    },
    {
      "name": "Love → Eternal Truth",
      "description": "From love of God’s commands to the everlasting foundation of His justice",
      "lemmas": ["dilectio", "mandatum", "veritas"],
      "startLine": 7,
      "endLine": 8,
       "comment": "The psalmist’s love for God’s commands is met with the life-giving mercy of the Lord. God’s words are truth from the beginning, and His just judgments endure forever.",
      "comment2": "Augustine interprets ‘principium verborum tuorum veritas’ as Christ Himself—the eternal Word and Truth—from whom all just decrees flow and by whom they stand unshaken through every age (Enarr. Ps. 118-Res.7–8)."
    }
  ]
},


{
  "psalmNumber": 119,
  "category": "",
  "themes": [
    {
      "name": "Distress → Deliverance",
      "description": "From inner affliction to divine liberation from deceit",
      "lemmas": ["tribulor", "clamo", "exaudio", "libero", "labium", "iniquus", "lingua", "dolosus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine sees this as the cry of the soul caught in inner tribulation, not just external hardship. The deceitful tongue symbolizes confusion and heresy. God hears, not to shield physically, but to deliver the soul through truth. The movement from anguish to 'libera animam meam' marks grace’s work in pulling the soul out of lies and into light (Enarr. Ps. 119.1–2)."
    },
    {
      "name": "Deception → Purifying Judgment",
      "description": "The harm of lies is answered by divine fire and piercing correction",
      "lemmas": ["do", "appono", "lingua", "sagitta", "potens", "acutus", "carbo", "desolatorius"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine reads these verses as the divine response to false speech. The tongue, which wounds through deceit, will receive 'sharp arrows' and 'desolating coals.' But these are not simply for destruction: they are purifying instruments. The 'coals' represent the burning power of charity, which scorches away sin and heals the deceived (Enarr. Ps. 119.3–5)."
    },
    {
      "name": "Exile → Alienation",
      "description": "Dwelling long among the ungodly deepens the soul’s sorrow",
      "lemmas": ["heu", "incolatus", "prolongo", "cedar", "incola", "anima", "odi", "pax"],
      "startLine": 5,
      "endLine": 6,
      "comment": "‘Heu mihi’ is Augustine’s sigh of the pilgrim soul exiled from its true home. To live in Kedar — a symbol of those who live in the flesh — is to be surrounded by hostility toward peace. The soul has dwelt too long here, not because of years, but because it feels the pain of separation from the City of God (Enarr. Ps. 119.5–6)."
    },
    {
      "name": "Peaceful Words → Hostile Response",
      "description": "Peace is offered, but answered with aggression",
      "lemmas": ["pax", "loquor", "impugno", "gratis"],
      "startLine": 7,
      "endLine": 7,
      "comment": "Augustine interprets this verse as the voice of Christ and His Church: always seeking peace, yet constantly met with opposition. The psalmist speaks kindly, yet is attacked 'gratis' — without cause. This unjust suffering anticipates the passion of Christ, who was hated for no reason (Enarr. Ps. 119.7)."
    }
  ]
},

{
  "psalmNumber": 120,
  "category": "",
  "themes": [
    {
      "name": "Gaze → Up",
      "description": "The soul lifts its gaze from below to the heights, marking a new spiritual trajectory",
      "lemmas": ["levo", "oculus", "mons"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine reads this upward gaze as the soul’s first act of turning — not yet arriving, but desiring. The mountains represent the apostles or spiritual heights. This gesture initiates a journey: the eyes rise, the heart follows. It’s not help received that marks the change, but the will to look up (Enarr. Ps. 120.1–2). Augustine interprets the 'mountains' not as earthly peaks but as the spiritual heights of the apostles and Scriptures. The soul first looks up but realizes that true help does not come from created things—even lofty ones—but from the Lord, who made heaven and earth. This signals a shift from creaturely confidence to Creator-dependence (Enarr. Ps. 120.1–2)."
    },
    {
      "name": "Sleep → Vigilance",
      "description": "Human instability is guarded by God’s tireless watch",
      "lemmas": ["pes", "dormio", "dormito"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine reads this as divine assurance for the soul: though our feet may falter, and though we sleep or forget, the Lord does not. The triple repetition — 'dormitet', 'dormitabit', 'dormiet' — insists that God’s watch never breaks. He keeps Israel, and each soul, through every lapse of human awareness (Enarr. Ps. 120.3–4)."
    },
    
    {
      "name": "Protection → Peace",
      "description": "God’s nearness shields the soul and brings rest from every threat",
      "lemmas": ["dextera", "sol", "luna"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine sees God's presence at the right hand as intimate and steadying. This protection brings peace — not just from physical harm, but from the fear of harm. The sun by day and moon by night represent total coverage: no time, condition, or influence escapes divine care. Peace flows from presence (Enarr. Ps. 120.5–6)."
    },


    {
      "name": "Peace → Permanence",
      "description": "The soul's calm under God's care is extended into eternity",
      "lemmas": ["custodio", "anima", "introitus", "exitus", "saeculum"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine reads this as the sealing of divine care: the soul, already protected and at peace, now walks in confidence that every step — going out or coming in — is under God’s watch. And not just for today, but 'from now and forever.' What began with an upward gaze ends in eternal companionship (Enarr. Ps. 120.7–8)."
    }

  ]
},

{
  "psalmNumber": 121,
  "category": "",
  "themes": [
    {
      "name": "Standing → Rejoicing",
      "description": "Established presence in God's house gives rise to spiritual joy",
      "lemmas": ["stantes", "pes", "atrium", "laetor", "domus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine reads this joy ('laetatus sum') as the natural overflow of standing firm in the courts of the Lord. Though the verse order suggests joy comes first, the theological order is reversed: the soul rejoices because it finds itself in God's house. The feet that once journeyed are now planted, and from this rootedness comes gladness (Enarr. Ps. 121.1–2)."
    },
    {
      "name": "Gather → Communion",
      "description": "The tribes’ upward journey culminates in unified participation and shared confession",
      "lemmas": ["aedifico", "civitas", "participatio", "idipsum", "ascendo", "tribus", "confiteor", "nomen"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine sees Jerusalem not just as a place, but a mystery: a city 'built' by God, whose unity is not geographic but spiritual. The tribes ascend not merely in space, but into a deeper communion — united in the confession of the Lord’s name. The Church is the fulfillment of this image: many ascending into one body through praise (Enarr. Ps. 121.3–4). Mass: tribes ascend = faithful gathering, city compact = church unified in Christ, confession of the name= liturgy of Word; participation in idipsum: mystical communion"      
    },
    {
      "name": "Worship → Intercession",
      "description": "Encounter with divine order leads to prayer for peace and abundance",
      "lemmas": ["sedeo", "sedes", "judicium", "rogo", "pax", "abundantia", "jerusalem"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine sees the 'thrones of judgment' not as earthly courts, but Christ’s spiritual governance within the Church. From this seat, justice flows. But worship does not end in vision — it turns to prayer: for peace, for the flourishing of the Church. As in the Catholic Mass, after hearing God’s Word and seeing His order, we pray for the city of God on earth (Enarr. Ps. 121.5–6)."
    },

    {
      "name": "Peace → Charity → Action",
      "description": "Worship concludes with love that overflows into peace-speaking and pursuit of the city's good",
      "lemmas": ["pax", "virtus", "turris", "frater", "proximus", "loquor", "quaero", "bonus", "domus"],
      "startLine": 7,
      "endLine": 9,
      "comment": "Augustine sees this as the final fruit of true worship. Peace, rooted in divine strength and abundance, becomes a spoken gift — 'I spoke peace for the sake of my brothers.' It does not end in sentiment: it seeks good for Jerusalem. The soul leaves God’s house not empty, but missioned — to speak, to seek, to build the good of the Church (Enarr. Ps. 121.7–9). Mass: after communion (abundantia in turribus); offer peace to others;dismissed (see the good of the City of God)"
    }

  ]
},

{
  "psalmNumber": 122,
  "category": "",
  "themes": [
    {
      "name": "Eyes: Lifted → Fixed",
      "description": "The soul’s vision rises from upward longing to a servant’s focused trust on the Lord’s hand",
      "lemmas": ["levo", "oculus", "habito", "caelum", "servus", "manus", "ancilla", "dominus", "domina"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine sees this as the soul’s deepening posture after worship: first lifting its eyes to the God who dwells in heaven, then fixing them like a servant on the master's hand. This movement sets the tone for the Christian's humble vigilance after leaving the liturgy (Enarr. Ps. 122.1–2)."
    },
    {
      "name": "Waiting → Crying Out",
      "description": "Hopeful attention becomes a doubled plea for mercy when God delays",
      "lemmas": ["donec", "misereor", "miserere"],
      "startLine": 3,
      "endLine": 4,
      "comment": "For Augustine, the soul's long silence and trust give way to urgent intercession. 'Miserere nostri, Domine' is not repetition, but intensification — showing a soul that still believes, but now pleads. The return to the world calls for deeper faith under pressure (Enarr. Ps. 122.3–4)."
    },
    {
      "name": "Contempt → Burdened Soul",
      "description": "The soul is overwhelmed by scorn and insult from the proud, revealing the cost of faith in the world",
      "lemmas": ["anima", "repleo", "opprobrium", "despectio", "superbus", "abundo"],
      "startLine": 5,
      "endLine": 5,
      "comment": "Augustine reads this as the soul's confession: after the heights of worship, it re-enters a world where the proud abound. The soul is repleta — filled not with grace but with contempt. The psalm ends not with resolution, but with honesty about the weight believers carry in the flesh (Enarr. Ps. 122.5)."
    }
  ]
},

{
  "psalmNumber": 123,
  "category": "",
  "themes": [
    {
      "name": "Abandonment → Preservation",
      "description": "If God had not been with us, we would have perished — but He was",
      "lemmas": ["nisi", "dominus", "erat", "in", "nos", "dico"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine sees this dual 'nisi quia Dominus' as the soul’s confession: not of victory, but of dependence. Without God, enemies would have risen and prevailed. With God, we still stand (Enarr. Ps. 123.1–2)."
    },
    
    {
      "name": "Devoured → Drowned",
      "description": "The soul first faces human rage like a beast's mouth, then escalating into overwhelming flood",
      "lemmas": ["deglutio", "vivus", "homo", "irascor", "furor", "aqua", "absorbeo"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine reads this as a two-stage escalation: first, the soul is in danger of being devoured — as if by men who rise up like beasts. Then wrath turns into a flood: fury becomes elemental, overwhelming, spiritual. The soul would have been utterly drowned if not for the Lord’s mercy (Enarr. Ps. 123.3–4)."
    },

   {
      "name": "Torrent → Survived",
      "description": "The soul endured unbearable waters and escaped predation only by divine withholding",
      "lemmas": ["pertransit", "anima", "aqua", "intolerabilis", "dedit", "captio", "dens"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine reads this as fragile grace. The soul crossed the intolerable waters not by power, but preservation. We were not given over to the enemy’s teeth — not because we fled, but because the Lord withheld us. Survival is mercy (Enarr. Ps. 123.5–6).  Augustine compares this to baptismal deliverance and Noah’s flood. The soul passed through what should have drowned it. 'Anima nostra pertransivit' marks spiritual preservation under divine mercy (Enarr. Ps. 123.5)."
    },

    {
      "name": "Trap → Deliverance",
      "description": "The soul was caught like a bird in a trap, but the Lord shattered the snare and delivered it through His name",
      "lemmas": ["passer", "laqueus", "contritus", "libero", "adjutorium", "nomen", "dominus", "caelum", "terra"],
      "startLine": 7,
      "endLine": 9,
      "comment": "Augustine interprets the sparrow as the humble believer nearly taken by the hunter’s deceit. Psalm 123 resolves the fear of Psalm 90: the laqueus is not only real — it is broken. Deliverance does not come by escape but by the name of the Lord, Creator of heaven and earth (Enarr. Ps. 123.7–9; cf. Ps. 90.3)."
    }

  ]
},


{
  "psalmNumber": 124,
  "category": "",
  "themes": [

    {
      "name": "Escaped → Dweller",
      "description": "The soul transitions from being a rescued fugitive to a secure dweller in God's city",
      "lemmas": ["confido", "mons", "habitat", "circuitu", "jerusalem"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine contrasts this with Psalm 123: the 'sparrow' (passer) freed from the snare now 'dwells' (habitat) in Jerusalem. The 'mountain' (mons) is not geographic Zion but the soul's new stability in God. Divine encirclement (circuitu) replaces the broken snare (Enarr. Ps. 124.2–3)."
    },

    {
      "name": "Shielded → Blessed",
      "description": "From potential domination by the wicked to divine protection and blessing",
      "lemmas": ["relinquo", "virga", "benefacio", "rectus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine: God actively withholds the wicked's rod ('non relinquet') to preserve the righteous, then commands blessing ('Benefac') for the upright—not based on merit but grace (Enarr. Ps. 124.5-6)."
    },
    {
      "name": "Bending → Peace",
      "description": "Those inclining toward sin are removed, while peace is declared",
      "lemmas": ["declino", "obligatio", "pax", "Israel"],
      "startLine": 5,
      "endLine": 5,
      "comment": "Augustine: The 'Declinantes' follow their trajectory into sin, while 'Pax super Israel' is God's final word—a declarative gift mirroring the Church's eschatological hope (Enarr. Ps. 124.8)."
    }

  ]
},

{
  "psalmNumber": 125,
  "category": "",
  "themes": [
    {
      "name": "Captivity → Awakening Joy",
      "description": "The memory of Zion's rescue stirs joy — like the first movement of thawed waters after spiritual winter",
      "lemmas": ["converto", "captivitas", "Sion", "consolor", "gaudium", "exsultatio", "os", "lingua"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine sees this not as completed joy but as awakening — a slow, heavy movement like ice beginning to melt. The captivity echoes previous suffering (Ps. 123), and the joy is its emotional release, not final triumph. The Church sings here like spring begins: with hope (Enarr. Ps. 125.1–2)."
    },
    {
      "name": "Foreign Wonder → Internal Praise",
      "description": "What others saw as God's greatness, Israel internalized with rejoicing.",
      "lemmas": ["magnifico", "facio", "gens", "nobiscum", "laetor"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine sees two levels here: the nations observe God's greatness from the outside, while Israel experiences it intimately. Joy is not just public testimony, but personal transformation (Enarr. Ps. 125.3–4)."
    },
    
    {
      "name": "Dry Captivity → Rushing Mercy",
      "description": "The soul prays for renewal like water returning to the desert — sorrowful sowing will yield joyful harvest",
      "lemmas": ["converto", "captivitas", "torrens", "auster", "semen", "lacrima", "meto", "exsultatio"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine says the southern torrent is the soul thawing after captivity — slow, muddy, yet promising. Tears are the sowing of this moment; joy will be its reaping. This is not instant triumph, but grace gathering force underground (Enarr. Ps. 125.5–6)."
    },

    {
      "name": "Weeping → Rejoicing",
      "description": "Those who go out weeping and sowing will return rejoicing with the fruit of endurance",
      "lemmas": ["eo", "fleo", "mitto", "semen", "venio", "exsultatio", "porto", "manipulus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine sees the Church walking in tears now — sowing prayers and love in a world of sorrow. But the end is sure: the faithful will return bearing manipuli, the harvest of mercy and endurance. This is pilgrimage language — sorrow transformed by patience (Enarr. Ps. 125.7–8)."
  }

 ]
},
{
  "psalmNumber": 126,
  "category": "",
  "themes": [
     {
      "name": "Third Captivity  → Divine Building",
      "description": "Labor without the Lord leads nowhere; true construction comes only from His participation.",
      "lemmas": ["nisi", "aedifico", "custodio", "vanus", "laboro"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine says this is about the soul’s construction. We are temples — but not builders. The inner Jerusalem must be built by God, or it collapses. Watchmen and workers without grace only labor in anxiety (Enarr. Ps. 126.1–2)."
    },
    
    {
      "name": "Anxious Toil → Beloved Rest",
      "description": "From self-reliant striving and sorrowful labor to the peaceful sleep granted by God to His beloved.",
      "lemmas": ["surgo", "sedeo", "manduco", "dolor", "dilectus", "somnus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine sees the 'bread of sorrow' as the symbol of unrestful self-effort, a labor born of anxiety. But God gives not wages but sleep — a sign of grace and belovedness. The soul is not built by fear but by trust (Enarr. Ps. 126.3–4)."
    },
    {
      "name": "Hidden Formation → Public Strength (Faith)",
      "description": "Sons (spiritual or familial) are like arrows — hidden but honed. When the moment of testing comes, the one who has formed them will stand unashamed.",
      "lemmas": ["sagitta", "manus", "potens", "filius", "excutio", "beatus", "impleo", "confundo", "inimicus", "porta"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine reads the arrows as the sons of faith — formed in silence but destined for witness. The blessed man will not be confounded in the gate (symbol of judgment), because he has cultivated spiritual strength (Enarr. Ps. 126.5–6)."
    }

 ]
},
{
  "psalmNumber": 127,
  "category": "",
  "themes": [
    {
      "name": "Fear of the Lord and Right Living",
      "description": "Blessing begins with those who fear the Lord and walk in His ways.",
      "lemmas": ["beatus", "timeo", "ambulo", "via"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Foundational condition for the blessings that follow."
    },
    {
      "name": "Fruit of Labor",
      "description": "The work of one’s hands will yield sustenance and well-being.",
      "lemmas": ["labor", "fructus", "manduco", "bene"],
      "startLine": 2,
      "endLine": 2,
      "comment": "Earthly blessing tied to faithful diligence."
    },
    {
      "name": "Domestic Abundance",
      "description": "The home is portrayed as flourishing: wife as vine, children as olive shoots.",
      "lemmas": ["uxor", "vitis", "abundo", "filius", "novellus", "oliva", "mensa", "domus"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Rich family imagery celebrating household fruitfulness."
    },
    {
      "name": "Covenantal Blessing",
      "description": "The man who fears the Lord is blessed with this abundance.",
      "lemmas": ["benedico", "homo", "timeo"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Repetition reinforces the blessing tied to fear of the Lord."
    },
    {
      "name": "Zion and Lifelong Prosperity",
      "description": "Blessings come from Zion, extending to the prosperity of Jerusalem and one’s lifetime.",
      "lemmas": ["benedico", "sion", "video", "bonus", "jerusalem", "dies", "vita"],
      "startLine": 5,
      "endLine": 5,
      "comment": "Spatial and temporal expansion of the blessing—from household to holy city."
    },
    {
      "name": "Generational Continuity and Peace",
      "description": "The final hope is to see one’s grandchildren and the peace of Israel.",
      "lemmas": ["video", "filius", "pax", "israel"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Closes with generational vision and national peace."
    }
  ]
},

{
  "psalmNumber": 128,
  "category": "",
  "themes": [
    {
      "name": "Enduring Affliction",
      "description": "Israel recalls long-standing opposition and attack from its early days.",
      "lemmas": ["expugno", "juventus", "israel", "possum"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Repeated suffering is emphasized—but without defeat."
    },
    {
      "name": "Burden of Wickedness",
      "description": "The wicked are described as having worked oppression across Israel’s back.",
      "lemmas": ["dorsum", "peccator", "fabrico", "prolongo", "iniquitas"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Graphic image of prolonged exploitation."
    },
    {
      "name": "Divine Justice",
      "description": "The Lord defeats the wicked, cutting off their strength and dominion.",
      "lemmas": ["dominus", "justus", "concido", "cervix", "peccator"],
      "startLine": 4,
      "endLine": 4,
      "comment": "God intervenes decisively against the oppressors."
    },
    {
      "name": "Reversal of the Wicked",
      "description": "Enemies of Zion are shamed and turned backward.",
      "lemmas": ["confundo", "converto", "retrorsum", "odi" ],
      "startLine": 5,
      "endLine": 5,
      "comment": "Judgment results in public reversal and disgrace."
    },
    {
      "name": "Withering Futility",
      "description": "The wicked are likened to roof-grass that dries up prematurely.",
      "lemmas": ["foenum", "tectum", "evello", "exaresco"],
      "startLine": 6,
      "endLine": 6,
      "comment": "They have no lasting root or fruit."
    },
    {
      "name": "Fruitless Effort",
      "description": "Their efforts yield nothing worth harvesting or carrying.",
      "lemmas": ["impleo", "manus", "meto", "sinus", "manipulus", "colligo"],
      "startLine": 7,
      "endLine": 7,
      "comment": "No one benefits from their work."
    },
    {
      "name": "Absence of Blessing",
      "description": "The wicked are passed over without any greeting of blessing.",
      "lemmas": ["dico", "praetereo", "benedictio", "nomen", "dominus"],
      "startLine": 8,
      "endLine": 8,
      "comment": "No one speaks peace or divine favor over them."
    }
  ]
},

{
  "psalmNumber": 129,
  "category": "",
  "themes": [
    {
      "name": "Cry from the Depths",
      "description": "The psalmist begins with a desperate plea from the lowest place of need.",
      "lemmas": ["profundum", "clamo", "dominus"],
      "startLine": 1,
      "endLine": 1,
      "comment": "A prayer launched from the symbolic depths of suffering or sin."
    },
    {
      "name": "Prayerful Appeal",
      "description": "A heartfelt call for God to hear and attend to the supplicant’s voice.",
      "lemmas": ["exaudi", "vox", "auris", "deprecatio"],
      "startLine": 2,
      "endLine": 2,
      "comment": "Layered plea for divine attentiveness and mercy."
    },
    {
      "name": "Recognition of Guilt",
      "description": "Acknowledgment of human iniquity and unworthiness before divine justice.",
      "lemmas": ["iniquitas", "observo", "sustineo"],
      "startLine": 3,
      "endLine": 3,
      "comment": "No one can stand before God if sins are accounted."
    },
    {
      "name": "Hope in Mercy and Word",
      "description": "Despite guilt, the psalmist waits for God's mercy and trusts in His word.",
      "lemmas": ["propitiatio", "sustineo", "verbum", "spero", "anima"],
      "startLine": 4,
      "endLine": 5,
      "comment": "Patience, waiting, and reliance on the Lord’s promise."
    },
    {
      "name": "Communal Invitation to Hope",
      "description": "The entire people of Israel are called to wait in faith for the Lord.",
      "lemmas": ["custodia", "matutinus", "nox", "spero", "Israel"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Israel is summoned to collective, persistent hope."
    },
    {
      "name": "Abundant Redemption",
      "description": "God is portrayed as rich in mercy and redemption.",
      "lemmas": ["misericordia", "redemptio", "copiosus"],
      "startLine": 7,
      "endLine": 7,
      "comment": "Confidence in divine fullness and capacity to forgive."
    },
    {
      "name": "Promise of Deliverance",
      "description": "God Himself will redeem Israel from all sin.",
      "lemmas": ["redimo"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Final assurance of total salvation through the Lord."
    }
  ]
},

{
  "psalmNumber": 130,
  "category": "",
  "themes": [
    {
      "name": "Rejection of Pride",
      "description": "The psalmist denies any exaltation of heart, eyes, or ambition.",
      "lemmas": ["exalto", "cor", "elatus", "oculus", "ambulo", "magnus", "mirabilis"],
      "startLine": 1,
      "endLine": 1,
      "comment": "A declaration of humility and distance from greatness or vanity."
    },
    {
      "name": "Interior Humility",
      "description": "Even in feelings, the soul is subdued and peaceful like a weaned child.",
      "lemmas": ["humiliter", "sentio", "exalto", "anima", "ablactatus", "mater", "retributio"],
      "startLine": 2,
      "endLine": 2,
      "comment": "Powerful image of spiritual calm, not striving or restlessness."
    },
    {
      "name": "Communal Hope in God",
      "description": "Israel is invited to place lasting hope in the Lord.",
      "lemmas": ["spero", "israel", "dominus", "saeculum"],
      "startLine": 3,
      "endLine": 3,
      "comment": "Final line turns personal stillness into collective trust."
    },
    {
  "name": "Augustine: Holy Humility",
  "description": "The psalmist's refusal to walk in greatness is true spiritual humility—Augustine sees this as the virtue by which all other virtues ascend.",
  "lemmas": ["exalto", "humiliter", "cor", "magnus", "mirabilis"],
  "startLine": 1,
  "endLine": 1,
  "comment": "En. Ps. 130.1 – Augustine: 'What lifts the soul is not pride but humility. The greater you want to be, the lower you must stoop.'"
},
{
  "name": "Augustine: Weaned Soul as Peaceful Soul",
  "description": "Augustine sees the weaned child as the image of a soul detached from worldly ambition and resting in quiet trust before God.",
  "lemmas": ["ablacto"],
  "startLine": 2,
  "endLine": 2,
  "comment": "En. Ps. 130.2 – The soul is quieted like a weaned child: no longer crying for milk, but resting on the mother’s lap in peace."
}

  ]
},


{
  "psalmNumber": 131,
  "category": "",
  "themes": [
    {
      "name": "David’s Humble Vow",
      "description": "David humbly vows not to rest until he finds a dwelling place for the Lord.",
      "lemmas": ["david", "mansuetudo", "juro", "votum", "domus", "lectus", "somnus", "tabernaculum"],
      "startLine": 1,
      "endLine": 5,
      "comment": "Opening remembrance of David’s humility and dedication to securing a resting place for God."
    },
    {
      "name": "Seeking and Entering God's Presence",
      "description": "The ark is discovered and honored; the people enter and worship in God's dwelling.",
      "lemmas": ["ephrata", "invenio", "tabernaculum", "introeo", "adoro", "arca", "requies"],
      "startLine": 6,
      "endLine": 8,
      "comment": "A sacred procession from hearing about the ark to entering God's presence."
    },
    {
      "name": "Priestly Joy and Messianic Plea",
      "description": "The people pray for priestly righteousness and appeal for God’s favor on His anointed.",
      "lemmas": ["sacerdos", "justitia", "sanctus", "exsulto", "facies", "christus"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Petition for priestly blessing and the Messiah’s honor, rooted in David’s legacy."
    },
    {
      "name": "Divine Promise to David",
      "description": "God swears to establish David’s lineage forever, conditioned on faithfulness.",
      "lemmas": ["juravit", "fructus", "venter", "testamentum", "sedes", "doceo"],
      "startLine": 11,
      "endLine": 13,
      "comment": "Unbreakable divine covenant with David’s house and throne."
    },
    {
      "name": "Zion as God’s Chosen Dwelling",
      "description": "God chooses Zion forever and promises to bless its people and priests.",
      "lemmas": ["Sion", "eligo", "habitatio", "requies", "benedico", "pauper", "panis", "salutare"],
      "startLine": 14,
      "endLine": 17,
      "comment": "Zion is the eternal site of God’s presence and blessing for the community."
    },
    {
      "name": "Messianic Glory and Final Victory",
      "description": "God exalts David’s power and prepares light for His Christ, while enemies are shamed.",
      "lemmas": ["cornu", "lucerna", "christus", "inimicus", "confusio", "sanctificatio"],
      "startLine": 18,
      "endLine": 19,
      "comment": "Messianic hope fulfilled as God glorifies His anointed and defeats opposition."
    },
    {
      "name": "Augustine: Christ as Tabernacle",
      "description": "David’s longing for a place for the Lord is fulfilled in Christ, who is both the Temple and the resting place of God in humanity.",
      "lemmas": ["tabernaculum", "dominus", "christus"],
      "startLine": 4,
      "endLine": 8,
      "comment": "En. Ps. 131 – The Word made flesh is where God comes to dwell among us."
    },
    {
      "name": "Augustine: Zion as the Church",
      "description": "Zion is chosen by God not just as a city, but as the figure of the eternal Church where He dwells and blesses forever.",
      "lemmas": ["Sion", "habito", "saeculum", "sanctificatio"],
      "startLine": 14,
      "endLine": 19,
      "comment": "Zion is the heavenly city, the Church filled with saints and Christ’s light."
    }
  ]
},
{
  "psalmNumber": 132,
  "category": "",
  "themes": [
    {
  "name": "Augustine: Anointing as Christ",
  "description": "The anointing oil flowing from Aaron’s head is a figure of Christ, the Anointed One, through whom divine blessing flows from the head (Christ) to the body (the Church).",
  "lemmas": ["unguentum", "caput", "descendo", "aaron", "vestimentum"],
  "startLine": 2,
  "endLine": 3,
  "comment": "En. Ps. 132 – Augustine sees the anointing as a metaphor for Christ's grace descending upon the unity of the Church."
},
{
  "name": "Augustine: Dew as Holy Spirit",
  "description": "The dew of Hermon represents the Holy Spirit descending on the Church (Mount Zion), bringing divine refreshment and eternal life.",
  "lemmas": ["ros", "hermon", "sion", "descendo", "vita"],
  "startLine": 3,
  "endLine": 4,
  "comment": "En. Ps. 132 – Augustine: As dew brings fruitfulness to earth, so the Spirit brings fruit to the Church."
},


    {
      "name": "Fraternal Unity",
      "description": "Unity among brethren is declared good and joyful.",
      "lemmas": ["frater", "habito", "bonus", "jucundus", "unum"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Opens with a vision of blessed communal harmony."
    },
    {
      "name": "Priestly Anointing and Sacred Flow",
      "description": "Unity is likened to anointing oil flowing from Aaron’s head to his garments.",
      "lemmas": ["unguentum", "caput", "descendo", "barba", "vestimentum", "Aaron"],
      "startLine": 2,
      "endLine": 3,
      "comment": "Priestly imagery conveys blessing flowing from head to body."
    },
    {
      "name": "Dew and Blessing from Zion",
      "description": "Divine blessing descends like Hermon’s dew on Zion, bringing eternal life.",
      "lemmas": ["ros", "Hermon", "mons", "Sion", "mando", "benedictio", "vita", "saeculum"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Natural imagery illustrates God's commanded blessing and life."
    }
  ]
},

{
  "psalmNumber": 133,
  "category": "",
  "themes": [
    {
      "name": "Call → Standing",
      "description": "Summon into active, vigilant worship",
      "lemmas": ["ecce", "nunc", "benedico", "sto", "domus", "servus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalm opens with a call: 'Behold now, bless the Lord, all you servants.' This is answered by their standing in the house of the Lord, a posture of vigilance and consecration. Worship is not passive but active, and standing symbolizes readiness and faithfulness, especially in the night watches.",
      "comment2": "Augustine emphasizes that 'blessing the Lord' is not adding anything to Him, but aligning the soul with divine praise. To stand in His house means interior stability and perseverance in service, lifting the heart continually toward God (Enarr. Ps. 133.1–2)."
    },
    {
      "name": "Night Prayer → Blessing",
      "description": "Darkness transfigured into ascent, crowned by God’s cosmic blessing",
      "lemmas": ["nox", "extollo", "manus", "sanctus", "benedico", "caelum", "terra"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The night, often a time of rest, becomes here a moment of prayerful ascent: hands lifted in holiness. The psalm concludes with blessing flowing not just from Zion, but from the Lord who made heaven and earth, grounding all worship in His creative power.",
      "comment2": "For Augustine, nocturnal prayer symbolizes the Church in pilgrimage, persevering in faith amid darkness. The final blessing comes from the Creator Himself, showing that holiness derives not from the temple, but from the God who sanctifies it (Enarr. Ps. 133.3–4)."
    }
  ]
},

{
  "psalmNumber": 136,
  "category": "",
  "themes": [
    {
      "name": "Exile → Paralysis",
      "description": "From displacement in Babylon to emotional and spiritual suspension",
      "lemmas": ["flumen", "sedeo", "fleo", "salix", "organum"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Augustine: 'Sitting by Babylon’s rivers' (v.1) symbolizes spiritual inertia; 'hanging harps' (v.2) represents the soul’s refusal to misuse sacred gifts in exile (Enarr. Ps. 136.2)."
    },
    {
      "name": "Mockery → Defiance",
      "description": "From captors’ demands to theological resistance",
      "lemmas": ["captivus", "interrogo", "canticum", "hymnus", "terra", "alienus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Augustine: The command to sing 'Zion’s songs' (v.3) in Babylon provokes the crisis of v.5—sacred joy cannot be forced. The soul must choose exile or faithfulness (Enarr. Ps. 136.4)."
    },
    {
      "name": "Sacred Music → Refusal",
      "description": "From captors’ demands for Zion's songs to a refusal to perform the sacred in exile",
      "lemmas": ["captivus", "interrogo", "canticum", "hymnus", "terra", "alienus"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Augustine: The psalmist resists profaning sacred music for worldly amusement. 'How can we sing the Lord's song in a foreign land?' marks a line between worship and worldliness (Enarr. Ps. 136.4–5).Augustine: The self-curse ('let my right hand wither,' v.6) binds the body to memory—a physical vow against spiritual forgetfulness (Enarr. Ps. 136.6)."
    },

    {
      "name": "Forgetfulness -> Destruction → Imprecation",
      "description": "From Edom’s violence to prophetic curse",
      "lemmas": ["lingua", "memini", "edom", "exinanio", "fundamentum", "memor"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine: 'Remember Edom’s cry' (v.8) invokes divine justice. The psalmist’s plea mirrors Revelation’s martyrs (Rev 6:10)—a cry against oppression (Enarr. Ps. 136.8)."
    },
    
    {
      "name": "Infants → Divine Justice",
      "description": "From helpless victims to divine retribution",
      "lemmas": ["parvulus", "allido", "petra"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Augustine allegorizes v.9: the ‘dashing of infants’ signifies destroying sinful desires (Babylon’s ‘offspring’) against Christ the Rock. The literal cry for retribution is transfigured into spiritual warfare (Enarr. Ps. 136.21; 1 Cor 10:4).",
      "comment2": "Without allegory, this final cry is a wounded demand for justice after unbearable trauma. The psalmist's emotional violence expresses anguish too deep for silence — a biblical lament echoing Psalm 21: 'My God, my God, why have you forsaken me?' It reminds us that even rage can be laid bare before God."
    }

    
  ]
},

{
  "psalmNumber": 138,
  "category": "a",
  "themes": [
    {
      "name": "Personal Praise",
      "description": "Individual confession and personal testimony",
      "lemmas": ["cognosco", "intellego"],
      "startLine": 1,
      "endLine": 1,
      "comment": "Complete knowledge, Deep understanding"
    },
    {
      "name": "Human Experience",
      "description": "Daily activities and life transitions",
      "lemmas": ["sessio", "resurrectio"],
      "startLine": 1,
      "endLine": 2,
      "comment": "From sitting to rising - encompassing all of life"
    },
    {
      "name": "Divine Scrutiny",
      "description": "God's thorough examination of the individual",
      "lemmas": ["probo", "investigo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Testing and searching of the heart"
    },
    {
      "name": "Divine Foreknowledge",
      "description": "God's complete foresight of human paths",
      "lemmas": ["praevideo", "via"],
      "startLine": 3,
      "endLine": 4,
      "comment": "All ways and paths are known beforehand"
    },
    {
      "name": "Creative Power",
      "description": "God's formative action in human life",
      "lemmas": ["formo", "pono"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Formation and purposeful placement"
    },
    {
      "name": "Temporal Knowledge",
      "description": "God's knowledge across all time",
      "lemmas": ["novissimus", "antiquus"],
      "startLine": 4,
      "endLine": 4,
      "comment": "From ancient times to the future"
    },
    {
      "name": "Divine Knowledge",
      "description": "The wonderful nature of God's understanding",
      "lemmas": ["scientia", "mirabilis"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Beyond human comprehension"
    },
    {
      "name": "Divine Presence",
      "description": "God's omnipresence in all places",
      "lemmas": ["spiritus", "facies"],
      "startLine": 6,
      "endLine": 7,
      "comment": "From heaven to hell, God is present"
    },
    {
      "name": "Human Limitation",
      "description": "The boundaries of human ability",
      "lemmas": ["possum", "fugio"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Inability to escape or fully comprehend"
    },
    {
      "name": "Omnipresence",
      "description": "God's constant presence everywhere",
      "lemmas": ["adsum", "caelum", "infernus"],
      "startLine": 7,
      "endLine": 8,
      "comment": "From highest heaven to deepest hell"
    },
    {
      "name": "Extreme Locations",
      "description": "God's presence in the farthest places",
      "lemmas": ["extremus", "mare"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Uttermost parts of the sea"
    },
    {
      "name": "Divine Guidance",
      "description": "God's active leading in life",
      "lemmas": ["deduco", "manus"],
      "startLine": 9,
      "endLine": 9,
      "comment": "God's hand guides and directs"
    },
    {
      "name": "Divine Protection",
      "description": "God's secure holding of the believer",
      "lemmas": ["teneo", "dexter"],
      "startLine": 9,
      "endLine": 9,
      "comment": "Right hand as symbol of strength and protection"
    }
  ]
},

{
  "psalmNumber": 138,
  "category": "b",
  "themes": [
    {
      "name": "Divine Illumination",
      "description": "God's light transforming darkness",
      "lemmas": ["illuminatio", "lumen"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Darkness becomes light in God's presence"
    },
    {
      "name": "Darkness Transformed",
      "description": "The overcoming of darkness by divine light",
      "lemmas": ["tenebrae", "nox"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Night shines like day before God"
    },
    {
      "name": "Divine Formation",
      "description": "God's intimate knowledge of human development",
      "lemmas": ["possideo", "suscipio"],
      "startLine": 3,
      "endLine": 4,
      "comment": "From conception to birth and beyond"
    },
    {
      "name": "Awe and Wonder",
      "description": "Response to God's marvelous works",
      "lemmas": ["terribilis", "mirabilis"],
      "startLine": 4,
      "endLine": 4,
      "comment": "Fearful and wonderful works of God"
    },
    {
      "name": "Divine Knowledge",
      "description": "Nothing hidden from God's sight",
      "lemmas": ["occulto", "oculus"],
      "startLine": 5,
      "endLine": 6,
      "comment": "Sees even unformed substance and future days"
    },
    {
      "name": "Creative Sovereignty",
      "description": "God's control over time and development",
      "lemmas": ["formo", "imperfectus"],
      "startLine": 6,
      "endLine": 6,
      "comment": "Forms both days and human life"
    },
    {
      "name": "Divine Friendship",
      "description": "Honored relationship with God",
      "lemmas": ["amicus", "honoro"],
      "startLine": 7,
      "endLine": 8,
      "comment": "God's friends are highly valued"
    },
    {
      "name": "Abundant Blessing",
      "description": "Multiplication of God's people",
      "lemmas": ["multiplico", "arena"],
      "startLine": 8,
      "endLine": 8,
      "comment": "Numerous as sand on the shore"
    },
    {
      "name": "Divine Judgment",
      "description": "Against the wicked and violent",
      "lemmas": ["occido", "peccator"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Separation from bloodthirsty men"
    },
    {
      "name": "Righteous Hatred",
      "description": "Proper hatred of evil",
      "lemmas": ["odi", "perfectus"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Complete rejection of God's enemies"
    },
    {
      "name": "Divine Examination",
      "description": "Request for testing and purification",
      "lemmas": ["probo", "interrogo"],
      "startLine": 13,
      "endLine": 14,
      "comment": "Invitation for God to search the heart"
    },
    {
      "name": "Eternal Guidance",
      "description": "Prayer for God's everlasting direction",
      "lemmas": ["deduco", "aeternus"],
      "startLine": 14,
      "endLine": 14,
      "comment": "Lead me in the way everlasting"
    },
    {
      "name": "Identification with God",
      "description": "Sharing God's perspective on enemies",
      "lemmas": ["inimicus", "tabesco"],
      "startLine": 11,
      "endLine": 12,
      "comment": "Emotional alignment with God's values"
    },
    {
      "name": "Heart Knowledge",
      "description": "Deep understanding of inner being",
      "lemmas": ["cor", "scio"],
      "startLine": 13,
      "endLine": 14,
      "comment": "God's complete knowledge of the heart"
    }
  ]
},

{
  "psalmNumber": 144,
  "category": "a",
  "themes": [
    {
      "name": "Exaltation → Daily Praise",
      "description": "From the eternal kingship of God to unceasing blessing",
      "lemmas": ["exalto", "benedico", "rex"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalmist begins with personal exaltation of God as King, moving to a rhythm of daily praise. Augustine notes that true kingship is God’s alone, and His reign draws forth perpetual blessing (Enarr. Ps. 144.1–2)."
    },
    {
      "name": "Greatness → Proclamation",
      "description": "From God’s immeasurable majesty to generational witness",
      "lemmas": ["magnus", "magnitudo", "generatio", "opera"],
      "startLine": 3,
      "endLine": 4,
      "comment": "God’s greatness is beyond measure. Augustine emphasizes that each generation receives and passes on the proclamation of His works, building a living chain of witness (Enarr. Ps. 144.3–4)."
    },
    {
      "name": "Glory → Wonders",
      "description": "From the splendour of holiness to the telling of God’s wonders",
      "lemmas": ["gloria", "sanctitas", "mirabile"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The glory of God’s holiness stirs speech; His wonders compel narration. Augustine sees this as the impulse of the Church to speak of God’s majesty and mighty acts (Enarr. Ps. 144.5–6)."
    },
    {
      "name": "Abundance → Mercy",
      "description": "From overflowing goodness to universal compassion",
      "lemmas": ["abundantia", "suavitas", "miseratio"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Out of the abundance of God’s goodness comes joy in His justice, and the revelation that He is merciful and patient. Augustine links this patience to the salvation offered to all (Enarr. Ps. 144.7–8)."
    },
    {
      "name": "Kindness → Universal Care",
      "description": "From God’s sweetness to His mercy over all creation",
      "lemmas": ["suavis", "miseratio", "opus"],
      "startLine": 9,
      "endLine": 9,
      "comment": "The Lord’s kindness embraces all; His mercy extends to every work of His hand. Augustine hears here the inclusive call of grace—nothing is beyond His care (Enarr. Ps. 144.9)."
    }
  ]
},

{
  "psalmNumber": 148,
  "category": "",
  "themes": [
    {
      "name": "Heavens → Hosts",
      "description": "From cosmic heights to angelic praise",
      "lemmas": ["caelum", "excelsum", "angelus", "virtus"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Praise begins in the highest realms — 'de caelis' and 'in excelsis' — and descends through angels and celestial powers. Augustine sees this as the call of invisible creation to glorify its Creator (Enarr. Ps. 148.1–2)."
    },
    {
      "name": "Luminaries → Waters Above",
      "description": "From sun and stars to upper waters praising the Lord",
      "lemmas": ["sol", "luna", "astra", "aqua"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The visible heavens respond in praise: sun, moon, stars, and the mysterious 'waters above the heavens' (Gen 1:7). Augustine allegorizes this as the harmony of creation reflecting divine order (Enarr. Ps. 148.3–4)."
    },
    {
      "name": "Command → Creation",
      "description": "From divine utterance to the formation of all things",
      "lemmas": ["dico", "creo", "praeceptum"],
      "startLine": 5,
      "endLine": 6,
      "comment": "'He spoke, and they were made' — creation is traced back to God’s word and will. Augustine emphasizes the eternal stability granted to creation by God’s decree (Enarr. Ps. 148.5–6)."
    },
    {
      "name": "Depths → Storms",
      "description": "From abyssal monsters to obedient tempests",
      "lemmas": ["draco", "abyssus", "spiritus", "verbum"],
      "startLine": 7,
      "endLine": 8,
      "comment": "The earth joins the praise — including its most fearsome aspects: dragons, depths, fire, hail. Even storms are subject to God’s Word. Augustine sees all nature as under divine command, terrifying yet obedient (Enarr. Ps. 148.7–8)."
    },
    {
      "name": "Mountains → Beasts",
      "description": "From immovable heights to creatures of the earth",
      "lemmas": ["mons", "cedrus", "bestia", "serpens"],
      "startLine": 9,
      "endLine": 10,
      "comment": "Nature’s grandeur and wildness — trees and beasts — are summoned to praise. Augustine reads the fruitful and the fearsome alike as figures for souls transformed or untamed (Enarr. Ps. 148.9–10)."
    },
    {
      "name": "Rulers → Youth",
      "description": "From kings to children united in praise",
      "lemmas": ["rex", "iudex", "iuvenis", "senex"],
      "startLine": 11,
      "endLine": 12,
      "comment": "All human conditions and generations — rulers, judges, youth and elders — are drawn into the liturgy of creation. For Augustine, this symbolizes the unity of the Church transcending age and status (Enarr. Ps. 148.11–12)."
    },
    {
      "name": "Name → People",
      "description": "From God’s exalted name to His intimate people",
      "lemmas": ["nomen", "confessio", "cornu", "populus"],
      "startLine": 13,
      "endLine": 14,
      "comment": "The psalm ends in covenant joy: God’s name is exalted above all, yet His people are drawn close. Augustine interprets the 'horn' as Christ glorified in the midst of the saints (Enarr. Ps. 148.13–14)."
    }
  ]
},


{
  "psalmNumber": 149,
  "category": "",
  "themes": [
    {
      "name": "New Song → Holy Assembly",
      "description": "From renewed praise to communal joy among the saints",
      "lemmas": ["canticum", "novus",  "ecclesia", "laetor", "exsulto"],
      "startLine": 1,
      "endLine": 2,
      "comment": "The psalm opens with a new song ('canticum novum'), which Augustine takes as the song of the New Covenant. Joy in the Creator and King fills the assembly of the saints, where the Church celebrates her risen life (Enarr. Ps. 149.1–2)."
    },
    {
      "name": "Dance → Favor",
      "description": "From bodily worship to divine delight in the meek",
      "lemmas": ["chorus", "tympanum", "psalterium", "beneplacitum", "mansuetus"],
      "startLine": 3,
      "endLine": 4,
      "comment": "Praise through dance and instruments symbolizes total bodily devotion. Augustine connects God's delight in the meek to Christ’s humility, which becomes salvation for the lowly (Enarr. Ps. 149.3–4; Matt 5:5)."
    },
    {
      "name": "Rest → Exaltation",
      "description": "From contemplative joy to vocal praise of God's power",
      "lemmas": ["gloria", "cubile", "guttur", "exaltatio", "gladius", "anceps"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The saints rejoice even upon their beds, a figure of inner peace. Augustine sees the 'double-edged swords' as the Word of God on their lips and in action — praise that is both contemplative and militant (Enarr. Ps. 149.5–6; Heb 4:12)."
    },
    {
      "name": "Judgment → Dominion",
      "description": "From vindication over nations to holy authority",
      "lemmas": ["vindicta", "increpatio", "populus", "rego", "compedes", "manicae"],
      "startLine": 7,
      "endLine": 8,
      "comment": "Augustine allegorizes the saints’ role in judgment: not carnal vengeance, but spiritual discernment and dominion. The binding of rulers represents the subjection of prideful powers to the will of Christ (Enarr. Ps. 149.7–8; 1 Cor 6:2)."
    },
    {
      "name": "Written Judgment → Shared Glory",
      "description": "From divine decree to the honor of all God's faithful",
      "lemmas": ["iudicium", "conscriptus", "gloria", "sanctus"],
      "startLine": 9,
      "endLine": 9,
      "comment": "This final line reveals that all judgment is already 'written' (conscriptum) — according to divine justice. Augustine sees the glory of the saints not in earthly power, but in union with God's will and final vindication (Enarr. Ps. 149.9)."
    }
  ]
},

{
  "psalmNumber": 150,
  "category": "",
  "themes": [
    {
      "name": "Temple → Majesty",
      "description": "From sanctuary worship to awe before divine greatness",
      "lemmas": ["sanctus", "firmamentum", "virtus", "magnitudo"],
      "startLine": 1,
      "endLine": 2,
      "comment": "Praise begins in God's sancta — the temple — and extends to the firmament of His power. Augustine sees this as an ascent from visible liturgy to contemplation of divine majesty. God's mighty acts (virtutes) and immeasurable greatness (magnitudo) inspire reverent joy (Enarr. Ps. 150.1–2)."
    },
    {
      "name": "Instruments → Communion",
      "description": "From diverse instruments to unified spiritual praise",
      "lemmas": ["tuba", "psalterium", "cithara", "tympanum", "chorus", "chorda", "organum"],
      "startLine": 3,
      "endLine": 4,
      "comment": "The instruments — wind, string, and dance — symbolize various gifts and temperaments. Augustine sees harmony in their diversity: the Church praises with all members, each contributing uniquely in the Spirit’s unity (Enarr. Ps. 150.3–4)."
    },
    {
      "name": "Cymbals → Breath",
      "description": "From jubilant sound to universal participation",
      "lemmas": ["cymbalum", "iubilatio", "spiritus", "laudo"],
      "startLine": 5,
      "endLine": 6,
      "comment": "The climax of praise is marked by 'jubilation' — a joy beyond words. Augustine notes that 'every spirit' (omnis spiritus) signifies the totality of redeemed creation praising God not only with music but with breath, life, and being itself (Enarr. Ps. 150.5–6)."
    }
  ]
}

  ]
}

